{
    "azure-affinity-group": {
        "body": "resource \"azure_affinity_group\" \"$1\" {\n    # label - (Required) A label to be used for tracking purposes.\n    label = \"\"\n\n    # location - (Required) The location where the affinity group should be created.   For a list of all Azure locations, please consult [this link](https://azure.microsoft.com/en-us/regions/).\n    location = \"\"\n\n    # name - (Required) The name of the affinity group. Must be unique on your   Azure subscription.\n    name = \"\"\n\n    # description - (Optional) A description for the affinity group.\n    description = \"\"\n\n    # Exported Attributes\n    # \"id\" - The affinity group ID. Coincides with the given \"name\".\n    # \"description\" - (Optional) A description for the affinity group.\n}",
        "description": "Creates a new affinity group on Azure.",
        "prefix": "azure-affinity-group"
    },
    "azure-hosted-service": {
        "body": "resource \"azure_hosted_service\" \"$1\" {\n    # ephemeral_contents - (Required) A boolean value (true|false), specifying   whether all the resources present in the hosted hosted service should be   destroyed following the hosted service's destruction.\n    ephemeral_contents = \"\"\n\n    # location - (Required) The location where the hosted service should be created.   For a list of all Azure locations, please consult [this link](https://azure.microsoft.com/en-us/regions/).\n    location = \"\"\n\n    # name - (Required) The name of the hosted service. Must be unique on Azure.\n    name = \"\"\n\n    # reverse_dns_fqdn - (Optional) The reverse of the fully qualified domain name   for the hosted service.\n    reverse_dns_fqdn = \"\"\n\n    # label - (Optional) A label to be used for tracking purposes. Must be   non-void. Defaults to `Made by Terraform.`.\n    label = \"\"\n\n    # description - (Optional) A description for the hosted service.\n    description = \"\"\n\n    # Exported Attributes\n    # \"id\" - The hosted service ID. Coincides with the given \"name\".\n    # \"description\" - (Optional) A description for the hosted service.\n}",
        "description": "Creates a new hosted service on Azure with its own .cloudapp.net domain.",
        "prefix": "azure-hosted-service"
    },
    "azure-resource-data-disk": {
        "body": "resource \"azure_data_disk\" \"$1\" {\n    # virtual_machine - (Required) The name of the virtual machine the disk will   be attached to.\n    virtual_machine = \"\"\n\n    # lun - (Required) The Logical Unit Number (LUN) for the disk. The LUN   specifies the slot in which the data drive appears when mounted for usage   by the virtual machine. Valid LUN values are 0 through 31.\n    lun = \"\"\n\n    # name - (Optional) The name of an existing registered disk to attach to the   virtual machine. If left empty, a new empty disk will be created and   attached instead. Changing this forces a new resource to be created.\n    name = \"\"\n\n    # label - (Optional) The identifier of the data disk. Changing this forces a   new resource to be created (defaults to \"virtual_machine-lun\")\n    label = \"\"\n\n    # size - (Optional) The size, in GB, of an empty disk to be attached to the   virtual machine. Required when creating a new disk, not used otherwise.\n    size = \"\"\n\n    # caching - (Optional) The caching behavior of data disk. Valid options are:   `None`, `ReadOnly` and `ReadWrite` (defaults `None`)\n    caching = \"\"\n\n    # storage_service_name - (Optional) The name of an existing storage account   within the subscription which will be used to store the VHD of this disk.   Required if no value is supplied for `media_link`. Changing this forces   a new resource to be created.\n    storage_service_name = \"\"\n\n    # media_link - (Optional) The location of the blob in storage where the VHD   of this disk will be created. The storage account where must be associated   with the subscription. Changing this forces a new resource to be created.\n    media_link = \"\"\n\n    # source_media_link - (Optional) The location of a blob in storage where a   VHD file is located that is imported and registered as a disk. If a value   is supplied, `media_link` will not be used.\n    source_media_link = \"\"\n\n    # Exported Attributes\n    # \"id\" - The security group ID.\n    # \"virtual_machine\" - (Required) The name of the virtual machine the disk will   be attached to.\n    # \"name\" - The name of the disk.\n    # \"virtual_machine\" - (Required) The name of the virtual machine the disk will   be attached to.\n    # \"label\" - The identifier for the disk.\n    # \"virtual_machine\" - (Required) The name of the virtual machine the disk will   be attached to.\n    # \"media_link\" - The location of the blob in storage where the VHD of this disk\n    # \"virtual_machine\" - (Required) The name of the virtual machine the disk will   be attached to.\n}",
        "description": "Adds a data disk to a virtual machine. If the name of an existing disk is given,\nit will attach that disk. Otherwise it will create and attach a new empty disk.",
        "prefix": "azure-resource-data-disk"
    },
    "azure-resource-dns-server": {
        "body": "resource \"azure_dns_server\" \"$1\" {\n    # dns_address - (Required) The IP address of the DNS server.\n    dns_address = \"\"\n\n    # name - (Required) The name of the DNS server reference. Changing this   forces a new resource to be created.\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\" - The DNS server definition ID. Coincides with the given \"name\".\n    # \"dns_address\" - (Required) The IP address of the DNS server.\n}",
        "description": "Creates a new DNS server definition to be used internally in Azure.",
        "prefix": "azure-resource-dns-server"
    },
    "azure-resource-instance": {
        "body": "resource \"azure_instance\" \"$1\" {\n    # private_port - (Required) The private port on which the instance is   listening.\n    private_port = \"\"\n\n    # public_port - (Required) The external port to use for the endpoint.\n    public_port = \"\"\n\n    # name - (Required) The name of the external endpoint.\n    name = \"\"\n\n    # username - (Required) The username of a new user that will be created while   creating the instance. Changing this forces a new resource to be created.\n    username = \"\"\n\n    # location - (Required) The location/region where the cloud service is   created. Changing this forces a new resource to be created.\n    location = \"\"\n\n    # size - (Required) The size of the instance.\n    size = \"\"\n\n    # image - (Required) The name of an existing VM or OS image to use for this   instance. Changing this forces a new resource to be created.\n    image = \"\"\n\n    # name - (Required) The name of the instance. Changing this forces a new   resource to be created.\n    name = \"\"\n\n    # hosted_service_name - (Optional) The name of the hosted service the   instance should be deployed under. If not provided; it will default to the   value of `name`. Changes to this parameter forces the creation of a new   resource.\n    hosted_service_name = \"\"\n\n    # description - (Optional) The description for the associated hosted service.   Changing this forces a new resource to be created (defaults to the instance   name).\n    description = \"\"\n\n    # subnet - (Optional) The name of the subnet to connect this instance to. If   a value is supplied `virtual_network` is required. Changing this forces a   new resource to be created.\n    subnet = \"\"\n\n    # virtual_network - (Optional) The name of the virtual network the `subnet`   belongs to. If a value is supplied `subnet` is required. Changing this   forces a new resource to be created.\n    virtual_network = \"\"\n\n    # storage_service_name - (Optional) The name of an existing storage account   within the subscription which will be used to store the VHDs of this   instance. Changing this forces a new resource to be created. **A Storage   Service is required if you are using a Platform Image**\n    storage_service_name = \"\"\n\n    # reverse_dns - (Optional) The DNS address to which the IP address of the   hosted service resolves when queried using a reverse DNS query. Changing   this forces a new resource to be created.\n    reverse_dns = \"\"\n\n    # automatic_updates - (Optional) If true this will enable automatic updates.   This attribute is only used when creating a Windows instance. Changing this   forces a new resource to be created (defaults false)\n    automatic_updates = \"\"\n\n    # time_zone - (Optional) The appropriate time zone for this instance in the   format 'America/Los_Angeles'. This attribute is only used when creating a   Windows instance. Changing this forces a new resource to be created   (defaults false)\n    time_zone = \"\"\n\n    # password - (Optional) The password of the new user that will be created   while creating the instance. Required when creating a Windows instance or   when not supplying an `ssh_key_thumbprint` while creating a Linux instance.   Changing this forces a new resource to be created.\n    password = \"\"\n\n    # ssh_key_thumbprint - (Optional) The SSH thumbprint of an existing SSH key   within the subscription. This attribute is only used when creating a Linux   instance. Changing this forces a new resource to be created.\n    ssh_key_thumbprint = \"\"\n\n    # security_group - (Optional) The Network Security Group to associate with   this instance.\n    security_group = \"\"\n\n    # endpoint - (Optional) Can be specified multiple times to define multiple   endpoints. Each `endpoint` block supports fields documented below.\n    endpoint = \"\"\n\n    # domain_name - (Optional) The name of an Active Directory domain to join.\n    domain_name = \"\"\n\n    # domain_ou - (Optional) Specifies the LDAP Organizational Unit to place the   instance in.\n    domain_ou = \"\"\n\n    # domain_username - (Optional) The username of an account with permission to   join the instance to the domain. Required if a domain_name is specified.\n    domain_username = \"\"\n\n    # domain_password - (Optional) The password for the domain_username account   specified above.\n    domain_password = \"\"\n\n    # custom_data - (Optional) The custom data to provide when launching the   instance.\n    custom_data = \"\"\n\n    # protocol - (Optional) The transport protocol for the endpoint. Valid   options are: `tcp` and `udp` (defaults `tcp`)\n    protocol = \"\"\n\n    # Exported Attributes\n    # \"id\" - The instance ID.\n    # \"private_port\" - (Required) The private port on which the instance is   listening.\n    # \"description\" - The description for the associated hosted service.\n    # \"private_port\" - (Required) The private port on which the instance is   listening.\n    # \"subnet\" - The subnet the instance is connected to.\n    # \"private_port\" - (Required) The private port on which the instance is   listening.\n    # \"endpoint\" - The complete set of configured endpoints.\n    # \"private_port\" - (Required) The private port on which the instance is   listening.\n    # \"security_group\" - The associated Network Security Group.\n    # \"private_port\" - (Required) The private port on which the instance is   listening.\n    # \"ip_address\" - The private IP address assigned to the instance.\n    # \"private_port\" - (Required) The private port on which the instance is   listening.\n    # \"vip_address\" - The public IP address assigned to the instance.\n    # \"private_port\" - (Required) The private port on which the instance is   listening.\n}",
        "description": "Creates a hosted service, role and deployment and then creates a virtual\nmachine in the deployment based on the specified configuration.",
        "prefix": "azure-resource-instance"
    },
    "azure-resource-local-network-connection": {
        "body": "resource \"azure_local_network_connection\" \"$1\" {\n    # address_space_prefixes - (Required) List of address spaces accessible   through the VPN connection. The elements are in the CIDR format.\n    address_space_prefixes = \"\"\n\n    # vpn_gateway_address - (Required) The public IPv4 of the VPN endpoint.\n    vpn_gateway_address = \"\"\n\n    # name - (Required) The name by which this local network connection will   be referenced by. Changing this forces a new resource to be created.\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\" - The local network connection ID.\n    # \"address_space_prefixes\" - (Required) List of address spaces accessible   through the VPN connection. The elements are in the CIDR format.\n}",
        "description": "Defines a new connection to a remote network through a VPN tunnel.",
        "prefix": "azure-resource-local-network-connection"
    },
    "azure-resource-security-group": {
        "body": "resource \"azure_security_group\" \"$1\" {\n    # location - (Required) The location/region where the security group is   created. Changing this forces a new resource to be created.\n    location = \"\"\n\n    # name - (Required) The name of the security group. Changing this forces a   new resource to be created.\n    name = \"\"\n\n    # label - (Optional) The identifier for the security group. The label can be   up to 1024 characters long. Changing this forces a new resource to be   created (defaults to the security group name)\n    label = \"\"\n\n    # Exported Attributes\n    # \"id\" - The security group ID.\n    # \"location\" - (Required) The location/region where the security group is   created. Changing this forces a new resource to be created.\n    # \"label\" - The identifier for the security group.\n    # \"location\" - (Required) The location/region where the security group is   created. Changing this forces a new resource to be created.\n}",
        "description": "Creates a new network security group within the context of the specified\nsubscription.",
        "prefix": "azure-resource-security-group"
    },
    "azure-resource-security-group-rule": {
        "body": "resource \"azure_security_group_rule\" \"$1\" {\n    # destination_port_range - (Required) The destination port or range. This value   can be between 0 and 65535. An asterisk (\\*) can also be used to match all   ports.\n    destination_port_range = \"\"\n\n    # destination_address_prefix - (Required) The address prefix of packet   destinations that should be subjected to the rule. An asterisk   (\\*) can also be used to match all destination IPs.\n    destination_address_prefix = \"\"\n\n    # source_port_range - (Required) The source port or range. This value can be   between 0 and 65535. An asterisk (\\*) can also be used to match all ports.\n    source_port_range = \"\"\n\n    # source_address_prefix - (Required) The address prefix of packet sources that   that should be subjected to the rule. An asterisk (\\*) can also be used to   match all source IPs.\n    source_address_prefix = \"\"\n\n    # priority - (Required) The priority of the network security rule. Rules with   lower priority are evaluated first. This value can be between 100 and 4096.\n    priority = \"\"\n\n    # type - (Required) The type of the security rule. Valid options are:   `Inbound` and `Outbound`.\n    type = \"\"\n\n    # security_group_names - (Required) A list of the names of the security groups   the rule should be applied to.   Changing this list forces the creation of a new resource.\n    security_group_names = \"\"\n\n    # name - (Required) The name of the security group rule.\n    name = \"\"\n\n    # action - (Optional) The action that is performed when the security rule is   matched. Valid options are: `Allow` and `Deny`.\n    action = \"\"\n\n    # protocol - (Optional) The protocol of the security rule. Valid options are:   `TCP`, `UDP` and `*`.\n    protocol = \"\"\n\n    # id - (Optional) The security group rule ID. Coincides with its given `name`.\n    id = \"\"\n\n    # protocol - (Optional) The protocol of the security rule. Valid options are:   `TCP`, `UDP` and `*`.\n    protocol = \"\"\n\n    # Exported Attributes\n}",
        "description": "Creates a new network Security Group Rule to be associated with a number of\ngiven Security Groups. ~> **NOTE on Security Group Rules**: for usability purposes; Terraform allows the\naddition of a single Security Group Rule to multiple Security Groups, despite\nit having to define each rule individually per Security Group on Azure. As a\nresult; in the event that one of the Rules on one of the Groups is modified by\nexternal factors, Terraform cannot reason as to whether or not that change\nshould be propagated to the others; let alone choose one changed Rule\nconfiguration over another in case of a conflic. As such; `terraform refresh`\nonly checks that the rule is still defined for each of the specified\n`security_group_names`; ignoring the actual parameters of the Rule and **not**\nupdating the state with regards to them.",
        "prefix": "azure-resource-security-group-rule"
    },
    "azure-resource-virtual-network": {
        "body": "resource \"azure_virtual_network\" \"$1\" {\n    # address_prefix - (Required) The address prefix to use for the subnet.\n    address_prefix = \"\"\n\n    # name - (Required) The name of the subnet.\n    name = \"\"\n\n    # subnet - (Required) Can be specified multiple times to define multiple   subnets. Each `subnet` block supports fields documented below.\n    subnet = \"\"\n\n    # location - (Required) The location/region where the virtual network is   created. Changing this forces a new resource to be created.\n    location = \"\"\n\n    # address_space - (Required) The address space that is used the virtual   network. You can supply more than one address space. Changing this forces   a new resource to be created.\n    address_space = \"\"\n\n    # name - (Required) The name of the virtual network. Changing this forces a   new resource to be created.\n    name = \"\"\n\n    # dns_servers - (Optional) List of names of DNS servers previously registered   on Azure.\n    dns_servers = \"\"\n\n    # security_group - (Optional) The Network Security Group to associate with   the subnet.\n    security_group = \"\"\n\n    # Exported Attributes\n    # \"id\" - The virtual NetworkConfiguration ID.\n    # \"security_group\" - (Optional) The Network Security Group to associate with   the subnet.\n}",
        "description": "Creates a new virtual network including any configured subnets. Each subnet can\noptionally be configured with a security group to be associated with the subnet.",
        "prefix": "azure-resource-virtual-network"
    },
    "azure-sql-database-server": {
        "body": "resource \"azure_sql_database_server\" \"$1\" {\n    # password - (Required) The password for the administrator of the database server.\n    password = \"\"\n\n    # username - (Required) The username for the administrator of the database server.\n    username = \"\"\n\n    # location - (Required) The location where the database server should be created.   For a list of all Azure locations, please consult [this link](https://azure.microsoft.com/en-us/regions/).\n    location = \"\"\n\n    # name - (Optional) (Computed) The name of the database server. It is determined upon   creation as it is randomly-generated per server.\n    name = \"\"\n\n    # version - (Optional) The version of the database server to be used. Can be any   one of `2.0` or `12.0`.\n    version = \"\"\n\n    # url - (Optional) (Computed) The fully qualified domain name of the database server.   Will be of the form `<name>.database.windows.net`.\n    url = \"\"\n\n    # Exported Attributes\n    # \"id\" - The database server ID. Coincides with the randomly-generated \"name\".\n    # \"url\" - (Computed) The fully qualified domain name of the database server.   Will be of the form \"<name>.database.windows.net\".\n}",
        "description": "Allocates a new SQL Database Server on Azure.",
        "prefix": "azure-sql-database-server"
    },
    "azure-sql-database-server-firewall-rule": {
        "body": "resource \"azure_sql_database_server_firewall_rule\" \"$1\" {\n    # database_server_names - (Required) The set of names of the Azure SQL   Database servers the rule should be enforced on.\n    database_server_names = \"\"\n\n    # end_ip - (Required) The IPv4 which will represent the upper bound of the   rule's application IP's. Traffic to/from IP's lesser that or equal to this   one all the way down to the `start_ip` will be permitted.\n    end_ip = \"\"\n\n    # start_ip - (Required) The IPv4 which will represent the lower bound of the   rule's application IP's. Traffic to/from IP's greater than or equal to this   one up to the `end_ip` will be permitted.\n    start_ip = \"\"\n\n    # name - (Required) The name of the rule. Changing forces the creation of a   new resource.\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\" - The database server ID. Coincides with the given \"name\".\n    # \"database_server_names\" - (Required) The set of names of the Azure SQL   Database servers the rule should be enforced on.\n}",
        "description": "Defines a new Firewall Rule to be applied across the given Database Servers.",
        "prefix": "azure-sql-database-server-firewall-rule"
    },
    "azure-sql-database-service": {
        "body": "resource \"azure_sql_database_service\" \"$1\" {\n    # database_server_name - (Required) The name of the database server this service   should run on. Changes here force the creation of a new resource.\n    database_server_name = \"\"\n\n    # name - (Required) The name of the database service.\n    name = \"\"\n\n    # edition - (Optional) The edition of the database service. For more information   on each variant, please view [this](https://msdn.microsoft.com/library/azure/dn741340.aspx) link.\n    edition = \"\"\n\n    # collation - (Optional) The collation to be used within the database service.   Defaults to the standard Latin charset.\n    collation = \"\"\n\n    # max_size_bytes - (Optional) The maximum size in bytes the database service   should be allowed to expand to. Range depends on the database `edition`   selected above.\n    max_size_bytes = \"\"\n\n    # service_level_id - (Optional) The ID corresponding to the service level per   edition. Please refer to [this](https://msdn.microsoft.com/en-us/library/azure/dn505701.aspx) link for more details.\n    service_level_id = \"\"\n\n    # Exported Attributes\n    # \"id\" - The database service ID. Coincides with the given \"name\".\n    # \"service_level_id\" - (Optional) The ID corresponding to the service level per   edition. Please refer to [this](https://msdn.microsoft.com/en-us/library/azure/dn505701.aspx) link for more details.\n}",
        "description": "Creates a new SQL database service on an Azure database server.",
        "prefix": "azure-sql-database-service"
    },
    "azure-storage-blob": {
        "body": "resource \"azure_storage_blob\" \"$1\" {\n    # type - (Required) The type of the storage blob to be created. One of either   `BlockBlob` or `PageBlob`.\n    type = \"\"\n\n    # storage_container_name - (Required) The name of the storage container   in which this blob should be created. Must be located on the storage   service given with `storage_service_name`.\n    storage_container_name = \"\"\n\n    # storage_service_name - (Required) The name of the storage service within   which the storage container in which the blob will be created resides.\n    storage_service_name = \"\"\n\n    # name - (Required) The name of the storage blob. Must be unique within   the storage service the blob is located.\n    name = \"\"\n\n    # size - (Optional) Used only for `PageBlob`'s to specify the size in bytes   of the blob to be created. Must be a multiple of 512. Defaults to 0.\n    size = \"\"\n\n    # Exported Attributes\n    # \"id\" - The storage blob ID. Coincides with the given \"name\".\n    # \"size\" - (Optional) Used only for \"PageBlob\"'s to specify the size in bytes   of the blob to be created. Must be a multiple of 512. Defaults to 0.\n}",
        "description": "Creates a new storage blob within a given storage container on Azure.",
        "prefix": "azure-storage-blob"
    },
    "azure-storage-container": {
        "body": "resource \"azure_storage_container\" \"$1\" {\n    # container_access_type - (Required) The 'interface' for access the container   provides. Can be either `blob`, `container` or ``.\n    container_access_type = \"\"\n\n    # storage_service_name - (Required) The name of the storage service within   which the storage container should be created.\n    storage_service_name = \"\"\n\n    # name - (Required) The name of the storage container. Must be unique within   the storage service the container is located.\n    name = \"\"\n\n    # properties - (Optional) Key-value definition of additional properties   associated to the storage service.\n    properties = \"\"\n\n    # Exported Attributes\n    # \"id\" - The storage container ID. Coincides with the given \"name\".\n    # \"properties\" - (Optional) Key-value definition of additional properties   associated to the storage service.\n}",
        "description": "Creates a new storage container within a given storage service on Azure.",
        "prefix": "azure-storage-container"
    },
    "azure-storage-queue": {
        "body": "resource \"azure_storage_queue\" \"$1\" {\n    # storage_service_name - (Required) The name of the storage service within   which the storage queue should be created.\n    storage_service_name = \"\"\n\n    # name - (Required) The name of the storage queue. Must be unique within   the storage service the queue is located.\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\" - The storage queue ID. Coincides with the given \"name\".\n    # \"storage_service_name\" - (Required) The name of the storage service within   which the storage queue should be created.\n}",
        "description": "Creates a new storage queue within a given storage service on Azure.",
        "prefix": "azure-storage-queue"
    },
    "azure-storage-service": {
        "body": "resource \"azure_storage_service\" \"$1\" {\n    # account_type - (Required) The type of storage account to be created.   Available options include `Standard_LRS`, `Standard_ZRS`, `Standard_GRS`,   `Standard_RAGRS` and `Premium_LRS`. To learn more about the differences   of each storage account type, please consult [this link](http://blogs.msdn.com/b/windowsazurestorage/archive/2013/12/11/introducing-read-access-geo-replicated-storage-ra-grs-for-windows-azure-storage.aspx).\n    account_type = \"\"\n\n    # location - (Required) The location where the storage service should be created.   For a list of all Azure locations, please consult [this link](https://azure.microsoft.com/en-us/regions/).\n    location = \"\"\n\n    # name - (Required) The name of the storage service. Must be between 4 and 24   lowercase-only characters or digits. Must be unique on Azure.\n    name = \"\"\n\n    # affinity_group - (Optional) The affinity group the storage service should   belong to.\n    affinity_group = \"\"\n\n    # properties - (Optional) Key-value definition of additional properties   associated to the storage service. For additional information on what   these properties do, please consult [this link](https://msdn.microsoft.com/en-us/library/azure/hh452235.aspx).\n    properties = \"\"\n\n    # label - (Optional) A label to be used for tracking purposes. Must be   non-void. Defaults to `Made by Terraform.`.\n    label = \"\"\n\n    # description - (Optional) A description for the storage service.\n    description = \"\"\n\n    # Exported Attributes\n    # \"id\" - The storage service ID. Coincides with the given \"name\".\n    # \"description\" - (Optional) A description for the storage service.\n}",
        "description": "Creates a new storage service on Azure in which storage containers may be created.",
        "prefix": "azure-storage-service"
    }
}