{
    "azurestack-data-source-route-table": {
        "body": "data \"azurestack_route_table\" \"$1\" {\n    # resource_group_name - (Required) The name of the Resource Group in which the Route Table exists.\n    resource_group_name = \"\"\n\n    # name - (Required) The name of the Route Table.\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\" - The Route Table ID.\n    # \"location\" - The Azure Region in which the Route Table exists.\n    # \"route\" - One or more \"route\" blocks as documented below.\n    # \"subnets\" - The collection of Subnets associated with this route table.\n    # \"tags\" - A mapping of tags assigned to the Route Table.\n    # \"name\" - The name of the Route.\n    # \"address_prefix\" - The destination CIDR to which the route applies.\n    # \"next_hop_type\" - The type of Azure hop the packet should be sent to.\n    # \"next_hop_in_ip_address\" - Contains the IP address packets should be forwarded to.\n}",
        "description": "Gets information about a Route Table",
        "prefix": "azurestack-data-source-route-table"
    },
    "azurestack-datasource-client-config": {
        "body": "data \"azurestack_client_config\" \"$1\" {\n    # Exported Attributes\n    # \"client_id\" is set to the Azure Client ID (Application Object ID).\n    # \"tenant_id\" is set to the Azure Tenant ID.\n    # \"subscription_id\" is set to the Azure Subscription ID.\n    # \"service_principal_application_id\" is the Service Principal Application ID.\n    # \"service_principal_object_id\" is the Service Principal Object ID.\n}",
        "description": "Use this data source to access the configuration of the Azure Stack\nprovider.",
        "prefix": "azurestack-datasource-client-config"
    },
    "azurestack-datasource-network-interface": {
        "body": "data \"azurestack_network_interface\" \"$1\" {\n    # resource_group_name - (Required) Specifies the name of the resource group the Network Interface is located in.\n    resource_group_name = \"\"\n\n    # name - (Required) Specifies the name of the Network Interface.\n    name = \"\"\n\n    # Exported Attributes\n    # \"applied_dns_servers\" - List of DNS servers applied to the specified network interface.\n    # \"dns_servers\" - The list of DNS servers used by the specified network interface.\n    # \"enable_ip_forwarding\" - Indicate if IP forwarding is set on the specified network interface.\n    # \"id\" - The ID of the virtual network that the specified network interface is associated to.\n    # \"internal_dns_name_label\" - The internal dns name label of the specified network interface.\n    # \"internal_fqdn\" - The internal FQDN associated to the specified network interface.\n    # \"ip_configuration\" - The list of IP configurations associated to the specified network interface.\n    # \"location\" - The location of the specified network interface.\n    # \"network_security_group_id\" - The ID of the network security group associated to the specified network interface.\n    # \"mac_address\" - The MAC address used by the specified network interface.\n    # \"private_ip_address\" - The primary private ip address associated to the specified network interface.\n    # \"private_ip_addresses\" - The list of private ip addresses associates to the specified network interface.\n    # \"tags\" - List the tags assocatied to the specified network interface.\n    # \"virtual_machine_id\" - The ID of the virtual machine that the specified network interface is attached to.\n}",
        "description": "Use this data source to access the properties of an Azure Network Interface.",
        "prefix": "azurestack-datasource-network-interface"
    },
    "azurestack-datasource-network-security-group": {
        "body": "data \"azurestack_network_security_group\" \"$1\" {\n    # resource_group_name - (Required) Specifies the Name of the Resource Group within which the Network Security Group exists\n    resource_group_name = \"\"\n\n    # name - (Required) Specifies the Name of the Network Security Group.\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\" - The ID of the Network Security Group.\n    # \"location\" - The supported Azure location where the resource exists.\n    # \"security_rule\" - One or more \"security_rule\" blocks as defined below.\n    # \"tags\" - A mapping of tags assigned to the resource.\n    # \"name\" - The name of the security rule.\n    # \"description\" - The description for this rule.\n    # \"protocol\" - The network protocol this rule applies to.\n    # \"source_port_range\" - The Source Port or Range.\n    # \"destination_port_range\" - The Destination Port or Range.\n    # \"source_address_prefix\" - CIDR or source IP range or * to match any IP.\n    # \"destination_address_prefix\" - CIDR or destination IP range or * to match any IP.\n    # \"access\" - Is network traffic is allowed or denied?\n    # \"priority\" - The priority of the rule\n    # \"direction\" - The direction specifies if rule will be evaluated on incoming or outgoing traffic.\n}",
        "description": "Use this data source to access the properties of a Network Security Group.",
        "prefix": "azurestack-datasource-network-security-group"
    },
    "azurestack-datasource-public-ip-x": {
        "body": "data \"azurestack_public_ip\" \"$1\" {\n    # resource_group_name - (Required) Specifies the name of the resource group.\n    resource_group_name = \"\"\n\n    # name - (Required) Specifies the name of the public IP address.\n    name = \"\"\n\n    # Exported Attributes\n    # \"domain_name_label\" - The label for the Domain Name.\n    # \"idle_timeout_in_minutes\" - Specifies the timeout for the TCP idle connection.\n    # \"fqdn\" - Fully qualified domain name of the A DNS record associated with the public IP. This is the concatenation of the domainNameLabel and the regionalized DNS zone.\n    # \"ip_address\" - The IP address value that was allocated.\n    # \"tags\" - A mapping of tags to assigned to the resource.\n}",
        "description": "Use this data source to access the properties of an existing Azure Public IP Address.",
        "prefix": "azurestack-datasource-public-ip-x"
    },
    "azurestack-datasource-resource-group": {
        "body": "data \"azurestack_resource_group\" \"$1\" {\n    # name - (Required) Specifies the name of the resource group.\n    name = \"\"\n\n    # Exported Attributes\n    # \"location\" - The location of the resource group.\n    # \"tags\" - A mapping of tags assigned to the resource group.\n}",
        "description": "Use this data source to access the properties of an Azure resource group.",
        "prefix": "azurestack-datasource-resource-group"
    },
    "azurestack-datasource-storage-account": {
        "body": "data \"azurestack_storage_account\" \"$1\" {\n    # resource_group_name - (Required) Specifies the name of the resource group the Storage Account is located in.\n    resource_group_name = \"\"\n\n    # name - (Required) Specifies the name of the Storage Account\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\" - The ID of the Storage Account.\n    # \"location\" - The Azure location where the Storage Account exists\n    # \"account_kind\" - (Optional) Defines the Kind of account. Valid option is \"Storage\".  . Changing this forces a new resource to be created.   Defaults to \"Storage\" currently as per [Azure Stack Storage Differences](https://docs.microsoft.com/en-us/azure/azure-stack/user/azure-stack-acs-differences)\n    # \"account_tier\" - Defines the Tier of this storage account.\n    # \"account_replication_type\" - Defines the type of replication used for this storage account.\n    # \"access_tier\" - (Required for \"BlobStorage\" accounts) Defines the access tier   for \"BlobStorage\" accounts. Valid options are \"Hot\" and \"Cold\", defaults to   \"Hot\". - **\"Currently Not Supported on Azure Stack\"**\n    # \"account_encryption_source\" - The Encryption Source for this Storage Account.\n    # \"custom_domain\" - A \"custom_domain\" block as documented below.\n    # \"tags\" - A mapping of tags to assigned to the resource.\n    # \"primary_location\" - The primary location of the Storage Account.\n    # \"secondary_location\" - The secondary location of the Storage Account.\n    # \"primary_blob_endpoint\" - The endpoint URL for blob storage in the primary location.\n    # \"secondary_blob_endpoint\" - The endpoint URL for blob storage in the secondary location.\n    # \"primary_queue_endpoint\" - The endpoint URL for queue storage in the primary location.\n    # \"secondary_queue_endpoint\" - The endpoint URL for queue storage in the secondary location.\n    # \"primary_table_endpoint\" - The endpoint URL for table storage in the primary location.\n    # \"secondary_table_endpoint\" - The endpoint URL for table storage in the secondary location.\n    # \"primary_file_endpoint\" - The endpoint URL for file storage in the primary location.\n    # \"primary_access_key\" - The primary access key for the Storage Account.\n    # \"secondary_access_key\" - The secondary access key for the Storage Account.\n    # \"primary_connection_string\" - The connection string associated with the primary location\n    # \"secondary_connection_string\" - The connection string associated with the secondary location\n    # \"primary_blob_connection_string\" - The connection string associated with the primary blob location\n    # \"secondary_blob_connection_string\" - The connection string associated with the secondary blob location\n    # \"custom_domain\" supports the following:\n    # \"name\" - The Custom Domain Name used for the Storage Account.\n}",
        "description": "Gets information about the specified Storage Account.",
        "prefix": "azurestack-datasource-storage-account"
    },
    "azurestack-datasource-subnet": {
        "body": "data \"azurestack_subnet\" \"$1\" {\n    # resource_group_name - (Required) Specifies the name of the resource group the Virtual Network is located in.\n    resource_group_name = \"\"\n\n    # virtual_network_name - (Required) Specifies the name of the Virtual Network this Subnet is located within.\n    virtual_network_name = \"\"\n\n    # name - (Required) Specifies the name of the Subnet.\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\" - The ID of the Subnet.\n    # \"address_prefix\" - The address prefix used for the subnet.\n    # \"network_security_group_id\" - The ID of the Network Security Group associated with the subnet.\n    # \"route_table_id\" - The ID of the Route Table associated with this subnet.\n    # \"ip_configurations\" - The collection of IP Configurations with IPs within this subnet.\n}",
        "description": "Use this data source to access the properties of an Azure Subnet located within a Virtual Network.",
        "prefix": "azurestack-datasource-subnet"
    },
    "azurestack-datasource-virtual-network-x": {
        "body": "data \"azurestack_virtual_network\" \"$1\" {\n    # resource_group_name - (Required) Specifies the name of the resource group the Virtual Network is located in.\n    resource_group_name = \"\"\n\n    # name - (Required) Specifies the name of the Virtual Network.\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\" - The ID of the virtual network.\n    # \"address_spaces\" - The list of address spaces used by the virtual network.\n    # \"dns_servers\" - The list of DNS servers used by the virtual network.\n    # \"subnets\" - The list of name of the subnets that are attached to this virtual network.\n}",
        "description": "Use this data source to access the properties of an Azure Virtual Network.",
        "prefix": "azurestack-datasource-virtual-network-x"
    },
    "azurestack-resource-compute-availability-set": {
        "body": "resource \"azurestack_availability_set\" \"$1\" {\n    # location - (Required) Specifies the supported Azure location where the resource exists. Changing this forces a new resource to be created.\n    location = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to create the availability set. Changing this forces a new resource to be created.\n    resource_group_name = \"\"\n\n    # name - (Required) Specifies the name of the availability set. Changing this forces a new resource to be created.\n    name = \"\"\n\n    # platform_update_domain_count - (Optional) Specifies the number of update domains that are used. Defaults to 5.\n    platform_update_domain_count = \"\"\n\n    # platform_fault_domain_count - (Optional) Specifies the number of fault domains that are used. Defaults to 3.\n    platform_fault_domain_count = \"\"\n\n    # platform_update_domain_count - (Optional) Specifies the number of update domains that are used. Defaults to 5.\n    platform_update_domain_count = \"\"\n\n    # tags - (Optional) A mapping of tags to assign to the resource.\n    tags = \"\"\n\n    # platform_update_domain_count - (Optional) Specifies the number of update domains that are used. Defaults to 5.\n    platform_update_domain_count = \"\"\n\n    # Exported Attributes\n    # \"id\" - The virtual Availability Set ID.\n    # \"platform_update_domain_count\" - (Optional) Specifies the number of update domains that are used. Defaults to 5.\n}",
        "description": "Manages an availability set for virtual machines.",
        "prefix": "azurestack-resource-compute-availability-set"
    },
    "azurestack-resource-compute-virtual-machine": {
        "body": "resource \"azurestack_virtual_machine\" \"$1\" {\n    # certificate_url - (Required) Specifies the URI of the key vault secrets in the format of `https://<vaultEndpoint>/secrets/<secretName>/<secretVersion>`. Stored secret is the Base64 encoding of a JSON Object that which is encoded in UTF-8 of which the contents need to be\n    certificate_url = \"\"\n\n    # vault_certificates - (Required) A collection of Vault Certificates as documented below\n    vault_certificates = \"\"\n\n    # source_vault_id - (Required) Specifies the key vault to use.\n    source_vault_id = \"\"\n\n    # disable_password_authentication - (Required) Specifies whether password authentication should be disabled. If set to `false`, an `admin_password` must be specified.\n    disable_password_authentication = \"\"\n\n    # setting_name - (Required) Specifies the name of the setting to which the content applies. Possible values are: `FirstLogonCommands` and `AutoLogon`.\n    setting_name = \"\"\n\n    # component - (Required) Specifies the name of the component to configure with the added content. The only allowable value is `Microsoft-Windows-Shell-Setup`.\n    component = \"\"\n\n    # pass - (Required) Specifies the name of the pass that the content applies to. The only allowable value is `oobeSystem`.\n    pass = \"\"\n\n    # protocol - (Required) Specifies the protocol of listener\n    protocol = \"\"\n\n    # type - (Required) Specifies the identity type of the virtual machine. The only allowable value is `SystemAssigned`. To enable Managed Service Identity the virtual machine extension \"ManagedIdentityExtensionForWindows\" or \"ManagedIdentityExtensionForLinux\" must also be added to the virtual machine. The Principal ID can be retrieved after the virtual machine has been created, e.g.\n    type = \"\"\n\n    # admin_username - (Required) Specifies the name of the administrator account.\n    admin_username = \"\"\n\n    # computer_name - (Required) Specifies the name of the virtual machine.\n    computer_name = \"\"\n\n    # lun - (Required) Specifies the logical unit number of the data disk.\n    lun = \"\"\n\n    # disk_size_gb - (Required) Specifies the size of the data disk in gigabytes.\n    disk_size_gb = \"\"\n\n    # create_option - (Required) Specifies how the data disk should be created. Possible values are `Attach`, `FromImage` and `Empty`.\n    create_option = \"\"\n\n    # name - (Required) Specifies the name of the data disk.\n    name = \"\"\n\n    # create_option - (Required) Specifies how the virtual machine should be created. Possible value is`FromImage`.\n    create_option = \"\"\n\n    # name - (Required) Specifies the disk name.\n    name = \"\"\n\n    # storage_uri - (Required) Blob endpoint for the storage account to hold the virtual machine's diagnostic files. This must be the root of a storage account, and not a storage container.\n    storage_uri = \"\"\n\n    # enabled - (Required) Whether to enable boot diagnostics for the virtual machine.\n    enabled = \"\"\n\n    # product - (Required) Specifies the product of the image from the marketplace.\n    product = \"\"\n\n    # publisher - (Required) Specifies the publisher of the image.\n    publisher = \"\"\n\n    # name - (Required) Specifies the name of the image from the marketplace.\n    name = \"\"\n\n    # network_interface_ids - (Required) Specifies the list of resource IDs for the network interfaces associated with the virtual machine.\n    network_interface_ids = \"\"\n\n    # storage_os_disk - (Required) A Storage OS DFlag to enable deletion of the OS disk VHD blob when the VM is deleted, defaults to `false` (not yet supported).\n    storage_os_disk = \"\"\n\n    # vm_size - (Required) Specifies the [size of the virtual machine](https://azure.microsoft.com/en-us/documentation/articles/virtual-machines-size-specs/).\n    vm_size = \"\"\n\n    # location - (Required) Specifies the supported Azure Stack Region where the resource exists. Changing this forces a new resource to be created.\n    location = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to\n    resource_group_name = \"\"\n\n    # name - (Required) Specifies the name of the virtual machine resource. Changing this forces a\n    name = \"\"\n\n    # plan - (Optional) A plan block as documented below.\n    plan = \"\"\n\n    # availability_set_id - (Optional) The Id of the Availability Set in which to create the virtual machine\n    availability_set_id = \"\"\n\n    # boot_diagnostics - (Optional) A boot diagnostics profile block as referenced below.\n    boot_diagnostics = \"\"\n\n    # storage_image_reference - (Optional) A Storage Image Reference block as documented below.\n    storage_image_reference = \"\"\n\n    # storage_data_disk - (Optional) A list of Storage Data disk blocks as referenced below.\n    storage_data_disk = \"\"\n\n    # delete_data_disks_on_termination - (Optional) Flag to enable deletion of storage data disk VHD blobs when the VM is deleted, defaults to `false`.\n    delete_data_disks_on_termination = \"\"\n\n    # os_profile - (Optional) An OS Profile block as documented below. Required when `create_option` in the `storage_os_disk` block is set to `FromImage`.\n    os_profile = \"\"\n\n    # identity - (Optional) An identity block as documented below.\n    identity = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # os_profile_windows_config - (Optional) (Required, when a Windows machine) A Windows config block as documented below.\n    os_profile_windows_config = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # os_profile_linux_config - (Optional) (Required, when a Linux machine) A Linux config block as documented below.\n    os_profile_linux_config = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # os_profile_secrets - (Optional) A collection of Secret blocks as documented below.\n    os_profile_secrets = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # primary_network_interface_id - (Optional) Specifies the resource ID for the primary network interface associated with the virtual machine.\n    primary_network_interface_id = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # tags - (Optional) A mapping of tags to assign to the resource.\n    tags = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # boot_diagnostics - (Optional) `boot_diagnostics` supports the following:\n    boot_diagnostics = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # storage_image_reference - (Optional) `storage_image_reference` supports the following:\n    storage_image_reference = \"\"\n\n    # id - (Optional) Specifies the ID of the (custom) image to use to create the virtual\n    id = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # publisher - (Optional) (Required, when not using image resource) Specifies the publisher of the image used to create the virtual machine. Changing this forces a new resource to be created.\n    publisher = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # offer - (Optional) (Required, when not using image resource) Specifies the offer of the image used to create the virtual machine. Changing this forces a new resource to be created.\n    offer = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # sku - (Optional) (Required, when not using image resource) Specifies the SKU of the image used to create the virtual machine. Changing this forces a new resource to be created.\n    sku = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # version - (Optional) Specifies the version of the image used to create the virtual machine. Changing this forces a new resource to be created.\n    version = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # storage_os_disk - (Optional) `storage_os_disk` supports the following:\n    storage_os_disk = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # vhd_uri - (Optional) Specifies the vhd uri. Changing this forces a new resource to be created.\n    vhd_uri = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # caching - (Optional) Specifies the caching requirements.\n    caching = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # image_uri - (Optional) Specifies the image_uri in the form publisherName:offer:skus:version. `image_uri` can also specify the [VHD uri](https://azure.microsoft.com/en-us/documentation/articles/virtual-machines-linux-cli-deploy-templates/#create-a-custom-vm-image) of a custom VM image to clone. When cloning a custom disk image the `os_type` documented below becomes required.\n    image_uri = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # os_type - (Optional) Specifies the operating system Type, valid values are windows, linux.\n    os_type = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # disk_size_gb - (Optional) Specifies the size of the os disk in gigabytes.\n    disk_size_gb = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # storage_data_disk - (Optional) `storage_data_disk` supports the following:\n    storage_data_disk = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # vhd_uri - (Optional) Specifies the uri of the location in storage where the vhd for the virtual machine should be placed.\n    vhd_uri = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # caching - (Optional) Specifies the caching requirements.\n    caching = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # os_profile - (Optional) `os_profile` supports the following:\n    os_profile = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # admin_password - (Optional) (Required for Windows, Optional for Linux) Specifies the password of the administrator account.\n    admin_password = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # custom_data - (Optional) Specifies custom data to supply to the machine. On linux-based systems, this can be used as a cloud-init script. On other systems, this will be copied as a file on disk. Internally, Terraform will base64 encode this value before sending it to the API. The maximum length of the binary array is 65535 bytes.\n    custom_data = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # identity - (Optional) `identity` supports the following:\n    identity = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # os_profile_windows_config - (Optional) `os_profile_windows_config` supports the following:\n    os_profile_windows_config = \"\"\n\n    # provision_vm_agent - (Optional) This value defaults to false.\n    provision_vm_agent = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # enable_automatic_upgrades - (Optional) This value defaults to false.\n    enable_automatic_upgrades = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # winrm - (Optional) A collection of WinRM configuration blocks as documented below.\n    winrm = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # additional_unattend_config - (Optional) An Additional Unattended Config block as documented below.\n    additional_unattend_config = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # winrm - (Optional) `winrm` supports the following:\n    winrm = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # certificate_url - (Optional) Specifies URL of the certificate with which new Virtual Machines is provisioned.\n    certificate_url = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # additional_unattend_config - (Optional) `additional_unattend_config` supports the following:\n    additional_unattend_config = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # content - (Optional) Specifies the base-64 encoded XML formatted content that is added to the unattend.xml file for the specified path and component.\n    content = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # os_profile_linux_config - (Optional) `os_profile_linux_config` supports the following:\n    os_profile_linux_config = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # ssh_keys - (Optional) Specifies a collection of `path` and `key_data` to be placed on the virtual machine.\n    ssh_keys = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # os_profile_secrets - (Optional) `os_profile_secrets` supports the following:\n    os_profile_secrets = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # vault_certificates - (Optional) `vault_certificates` support the following:\n    vault_certificates = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # certificate_store - (Optional) (Required, on windows machines) Specifies the certificate store on the Virtual Machine where the certificate should be added to.\n    certificate_store = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # Exported Attributes\n    # \"id\" - The virtual machine ID.\n    # \"license_type\" - (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are \"Windows_Client\" and \"Windows_Server\".\n}",
        "description": "Manages a virtual machine.",
        "prefix": "azurestack-resource-compute-virtual-machine"
    },
    "azurestack-resource-compute-virtualmachine-extension": {
        "body": "resource \"azurestack_virtual_machine_extension\" \"$1\" {\n    # settings - (Required) The settings passed to the extension, these are   specified as a JSON object in a string.\n    settings = \"\"\n\n    # settings - (Required) The settings passed to the extension, these are   specified as a JSON object in a string.\n    settings = \"\"\n\n    # type_handler_version - (Required) Specifies the version of the extension to   use, available versions can be found using the Azure CLI.\n    type_handler_version = \"\"\n\n    # type - (Required) The type of extension, available types for a publisher can   be found using the Azure CLI.\n    type = \"\"\n\n    # publisher - (Required) The publisher of the extension, available publishers   can be found by using the Azure CLI.\n    publisher = \"\"\n\n    # virtual_machine_name - (Required) The name of the virtual machine. Changing   this forces a new resource to be created.\n    virtual_machine_name = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to   create the virtual network. Changing this forces a new resource to be   created.\n    resource_group_name = \"\"\n\n    # location - (Required) The location where the extension is created. Changing   this forces a new resource to be created.\n    location = \"\"\n\n    # name - (Required) The name of the virtual machine extension peering. Changing   this forces a new resource to be created.\n    name = \"\"\n\n    # auto_upgrade_minor_version - (Optional) Specifies if the platform deploys   the latest minor version update to the `type_handler_version` specified.\n    auto_upgrade_minor_version = \"\"\n\n    # protected_settings - (Optional) The protected_settings passed to the\n    protected_settings = \"\"\n\n    # Exported Attributes\n    # \"id\" - The Virtual Machine Extension ID.\n    # \"settings\" - (Required) The settings passed to the extension, these are   specified as a JSON object in a string.\n}",
        "description": "Creates a new Virtual Machine Extension to provide post deployment configuration\nand run automated tasks. ~> **Please Note:** The CustomScript extensions for Linux & Windows require that the `commandToExecute` returns a `0` exit code to be classified as successfully deployed. You can achieve this by appending `exit 0` to the end of your `commandToExecute`.",
        "prefix": "azurestack-resource-compute-virtualmachine-extension"
    },
    "azurestack-resource-compute-virtualmachine-scale-set": {
        "body": "resource \"azurestack_virtual_machine_scale_set\" \"$1\" {\n    # product - (Required) Specifies the product of the image from the marketplace.\n    product = \"\"\n\n    # publisher - (Required) Specifies the publisher of the image.\n    publisher = \"\"\n\n    # name - (Required) Specifies the name of the image from the marketplace.\n    name = \"\"\n\n    # settings - (Required) The settings passed to the extension, these are specified as a JSON object in a string.\n    settings = \"\"\n\n    # type_handler_version - (Required) Specifies the version of the extension to use, available versions can be found using the Azure CLI.\n    type_handler_version = \"\"\n\n    # type - (Required) The type of extension, available types for a publisher can be found using the Azure CLI.\n    type = \"\"\n\n    # publisher - (Required) The publisher of the extension, available publishers can be found by using the Azure CLI.\n    publisher = \"\"\n\n    # name - (Required) Specifies the name of the extension.\n    name = \"\"\n\n    # storage_uri - (Required) Blob endpoint for the storage account to hold the virtual machine's diagnostic files. This must be the root of a storage account, and not a storage container.\n    storage_uri = \"\"\n\n    # enabled - (Required) Whether to enable boot diagnostics for the virtual machine.\n    enabled = \"\"\n\n    # lun - (Required) Specifies the Logical Unit Number of the disk in each virtual machine in the scale set.\n    lun = \"\"\n\n    # create_option - (Required) Specifies how the virtual machine should be created. The only possible option is `FromImage`.\n    create_option = \"\"\n\n    # domain_name_label - (Required) The domain name label for the dns settings.\n    domain_name_label = \"\"\n\n    # idle_timeout - (Required) The idle timeout in minutes. This value must be between 4 and 32.\n    idle_timeout = \"\"\n\n    # name - (Required) The name of the public ip address configuration\n    name = \"\"\n\n    # ip_configuration - (Required) An ip_configuration block as documented below.\n    ip_configuration = \"\"\n\n    # primary - (Required) Indicates whether network interfaces created from the network interface configuration will be the primary NIC of the VM.\n    primary = \"\"\n\n    # name - (Required) Specifies the name of the network interface configuration.\n    name = \"\"\n\n    # disable_password_authentication - (Required) Specifies whether password authentication should be disabled. Changing this forces a new resource to be created.\n    disable_password_authentication = \"\"\n\n    # setting_name - (Required) Specifies the name of the setting to which the content applies. Possible values are: `FirstLogonCommands` and `AutoLogon`.\n    setting_name = \"\"\n\n    # component - (Required) Specifies the name of the component to configure with the added content. The only allowable value is `Microsoft-Windows-Shell-Setup`.\n    component = \"\"\n\n    # pass - (Required) Specifies the name of the pass that the content applies to. The only allowable value is `oobeSystem`.\n    pass = \"\"\n\n    # protocol - (Required) Specifies the protocol of listener\n    protocol = \"\"\n\n    # certificate_url - (Required) It is the Base64 encoding of a JSON Object that which is encoded in UTF-8 of which the contents need to be `data`, `dataType` and `password`.\n    certificate_url = \"\"\n\n    # source_vault_id - (Required) Specifies the key vault to use.\n    source_vault_id = \"\"\n\n    # admin_password - (Required) Specifies the administrator password to use for all the instances of virtual machines in a scale set.\n    admin_password = \"\"\n\n    # admin_username - (Required) Specifies the administrator account name to use for all the instances of virtual machines in the scale set.\n    admin_username = \"\"\n\n    # computer_name_prefix - (Required) Specifies the computer name prefix for all of the virtual machines in the scale set. Computer name prefixes must be 1 to 9 characters long for windows images and 1 - 58 for linux. Changing this forces a new resource to be created.\n    computer_name_prefix = \"\"\n\n    # type - (Required) Specifies the identity type to be assigned to the scale set. The only allowable value is `SystemAssigned`. To enable Managed Service Identity (MSI) on all machines in the scale set, an extension with the type \"ManagedIdentityExtensionForWindows\" or \"ManagedIdentityExtensionForLinux\" must also be added. The scale set's Service Principal ID (SPN) can be retrieved after the scale set has been created.\n    type = \"\"\n\n    # capacity - (Required) Specifies the number of virtual machines in the scale set.\n    capacity = \"\"\n\n    # name - (Required) Specifies the size of virtual machines in a scale set.\n    name = \"\"\n\n    # storage_profile_os_disk - (Required) A storage profile os disk block as documented below\n    storage_profile_os_disk = \"\"\n\n    # network_profile - (Required) A collection of network profile block as documented below.\n    network_profile = \"\"\n\n    # os_profile - (Required) A Virtual Machine OS Profile block as documented below.\n    os_profile = \"\"\n\n    # upgrade_policy_mode - (Required) Specifies the mode of an upgrade to virtual machines in the scale set. Possible values, `Manual` or `Automatic`.\n    upgrade_policy_mode = \"\"\n\n    # sku - (Required) A sku block as documented below.\n    sku = \"\"\n\n    # location - (Required) Specifies the supported Azure location where the resource exists. Changing this forces a new resource to be created.\n    location = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to create the virtual machine scale set. Changing this forces a new resource to be created.\n    resource_group_name = \"\"\n\n    # name - (Required) Specifies the name of the virtual machine scale set resource. Changing this forces a new resource to be created.\n    name = \"\"\n\n    # overprovision - (Optional) Specifies whether the virtual machine scale set should be overprovisioned. Defaults to `true`.\n    overprovision = \"\"\n\n    # license_type - (Optional) (Optional, when a Windows machine) Specifies the Windows OS license type. If supplied, the only allowed values are `Windows_Client` and `Windows_Server`.\n    license_type = \"\"\n\n    # os_profile_secrets - (Optional) A collection of Secret blocks as documented below.\n    os_profile_secrets = \"\"\n\n    # os_profile_windows_config - (Optional) (Required, when a windows machine) A Windows config block as documented below.\n    os_profile_windows_config = \"\"\n\n    # os_profile_linux_config - (Optional) (Required, when a linux machine) A Linux config block as documented below.\n    os_profile_linux_config = \"\"\n\n    # storage_profile_image_reference - (Optional) A storage profile image reference block as documented below.\n    storage_profile_image_reference = \"\"\n\n    # extension - (Optional) Can be specified multiple times to add extension profiles to the scale set. Each `extension` block supports the fields documented below.\n    extension = \"\"\n\n    # plan - (Optional) A plan block as documented below.\n    plan = \"\"\n\n    # priority - (Optional) Specifies the priority for the virtual machines in the scale set, defaults to `Regular`. Possible values are `Low` and `Regular`.\n    priority = \"\"\n\n    # tags - (Optional) A mapping of tags to assign to the resource.\n    tags = \"\"\n\n    # sku - (Optional) `sku` supports the following:\n    sku = \"\"\n\n    # tier - (Optional) Specifies the tier of virtual machines in a scale set. Possible values, `standard` or `basic`.\n    tier = \"\"\n\n    # identity - (Optional) `identity` supports the following:\n    identity = \"\"\n\n    # os_profile - (Optional) `os_profile` supports the following:\n    os_profile = \"\"\n\n    # custom_data - (Optional) Specifies custom data to supply to the machine. On linux-based systems, this can be used as a cloud-init script. On other systems, this will be copied as a file on disk. Internally, Terraform will base64 encode this value before sending it to the API. The maximum length of the binary array is 65535 bytes.\n    custom_data = \"\"\n\n    # os_profile_secrets - (Optional) `os_profile_secrets` supports the following:\n    os_profile_secrets = \"\"\n\n    # vault_certificates - (Optional) (Required, on windows machines) A collection of Vault Certificates as documented below\n    vault_certificates = \"\"\n\n    # vault_certificates - (Optional) `vault_certificates` support the following:\n    vault_certificates = \"\"\n\n    # certificate_store - (Optional) (Required, on windows machines) Specifies the certificate store on the Virtual Machine where the certificate should be added to.\n    certificate_store = \"\"\n\n    # os_profile_windows_config - (Optional) `os_profile_windows_config` supports the following:\n    os_profile_windows_config = \"\"\n\n    # provision_vm_agent - (Optional) Indicates whether virtual machine agent should be provisioned on the virtual machines in the scale set.\n    provision_vm_agent = \"\"\n\n    # enable_automatic_upgrades - (Optional) Indicates whether virtual machines in the scale set are enabled for automatic updates.\n    enable_automatic_upgrades = \"\"\n\n    # winrm - (Optional) A collection of WinRM configuration blocks as documented below.\n    winrm = \"\"\n\n    # additional_unattend_config - (Optional) An Additional Unattended Config block as documented below.\n    additional_unattend_config = \"\"\n\n    # winrm - (Optional) `winrm` supports the following:\n    winrm = \"\"\n\n    # certificate_url - (Optional) Specifies URL of the certificate with which new Virtual Machines is provisioned.\n    certificate_url = \"\"\n\n    # additional_unattend_config - (Optional) `additional_unattend_config` supports the following:\n    additional_unattend_config = \"\"\n\n    # content - (Optional) Specifies the base-64 encoded XML formatted content that is added to the unattend.xml file for the specified path and component.\n    content = \"\"\n\n    # os_profile_linux_config - (Optional) `os_profile_linux_config` supports the following:\n    os_profile_linux_config = \"\"\n\n    # ssh_keys - (Optional) Specifies a collection of `path` and `key_data` to be placed on the virtual machine.\n    ssh_keys = \"\"\n\n    # network_profile - (Optional) `network_profile` supports the following:\n    network_profile = \"\"\n\n    # public_ip_address_configuration - (Optional) `public_ip_address_configuration` supports the following:\n    public_ip_address_configuration = \"\"\n\n    # storage_profile_os_disk - (Optional) `storage_profile_os_disk` supports the following:\n    storage_profile_os_disk = \"\"\n\n    # name - (Optional) Specifies the disk name. Must be specified when using unmanaged disk ('managed_disk_type' property not set).\n    name = \"\"\n\n    # vhd_containers - (Optional) Specifies the vhd uri. Cannot be used when `image` or `managed_disk_type` is specified.\n    vhd_containers = \"\"\n\n    # managed_disk_type - (Optional) Specifies the type of managed disk to create. Value you must be either `Standard_LRS` or `Premium_LRS`. Cannot be used when `vhd_containers` or `image` is specified.\n    managed_disk_type = \"\"\n\n    # caching - (Optional) Specifies the caching requirements. Possible values include: `None` (default), `ReadOnly`, `ReadWrite`.\n    caching = \"\"\n\n    # image - (Optional) Specifies the blob uri for user image. A virtual machine scale set creates an os disk in the same container as the user image.\n    image = \"\"\n\n    # os_type - (Optional) Specifies the operating system Type, valid values are windows, linux.\n    os_type = \"\"\n\n    # storage_profile_data_disk - (Optional) `storage_profile_data_disk` supports the following:\n    storage_profile_data_disk = \"\"\n\n    # create_option - (Optional) Specifies how the data disk should be created. The only possible options are `FromImage` and `Empty`.\n    create_option = \"\"\n\n    # caching - (Optional) Specifies the caching requirements. Possible values include: `None` (default), `ReadOnly`, `ReadWrite`.\n    caching = \"\"\n\n    # disk_size_gb - (Optional) Specifies the size of the disk in GB. This element is required when creating an empty disk.\n    disk_size_gb = \"\"\n\n    # storage_profile_image_reference - (Optional) `storage_profile_image_reference` supports the following:\n    storage_profile_image_reference = \"\"\n\n    # id - (Optional) Specifies the ID of the (custom) image to use to create the virtual\n    id = \"\"\n\n    # publisher - (Optional) Specifies the publisher of the image used to create the virtual machines.\n    publisher = \"\"\n\n    # offer - (Optional) Specifies the offer of the image used to create the virtual machines.\n    offer = \"\"\n\n    # sku - (Optional) Specifies the SKU of the image used to create the virtual machines.\n    sku = \"\"\n\n    # version - (Optional) Specifies the version of the image used to create the virtual machines.\n    version = \"\"\n\n    # boot_diagnostics - (Optional) `boot_diagnostics` supports the following:\n    boot_diagnostics = \"\"\n\n    # extension - (Optional) `extension` supports the following:\n    extension = \"\"\n\n    # auto_upgrade_minor_version - (Optional) Specifies whether or not to use the latest minor version available.\n    auto_upgrade_minor_version = \"\"\n\n    # protected_settings - (Optional) The protected_settings passed to the extension, like settings, these are specified as a JSON object in a string.\n    protected_settings = \"\"\n\n    # plan - (Optional) `plan` supports the following:\n    plan = \"\"\n\n    # Exported Attributes\n    # \"id\" - The virtual machine scale set ID.\n    # \"boot_diagnostics\" - A boot diagnostics profile block as referenced below.\n}",
        "description": "Manages a virtual machine scale set. ~> **Note:** All arguments including the administrator login and password will be stored in the raw state as plain-text.\n[Read more about sensitive data in state](/docs/state/sensitive-data.html).",
        "prefix": "azurestack-resource-compute-virtualmachine-scale-set"
    },
    "azurestack-resource-dns-a-record": {
        "body": "resource \"azurestack_dns_a_record\" \"$1\" {\n    # records - (Required) List of IPv4 Addresses.\n    records = \"\"\n\n    # zone_name - (Required) Specifies the DNS Zone where the resource exists. Changing this forces a new resource to be created.\n    zone_name = \"\"\n\n    # resource_group_name - (Required) Specifies the resource group where the resource exists. Changing this forces a new resource to be created.\n    resource_group_name = \"\"\n\n    # name - (Required) The name of the DNS A Record.\n    name = \"\"\n\n    # tags - (Optional) A mapping of tags to assign to the resource.\n    tags = \"\"\n\n    # Exported Attributes\n    # \"id\" - The DNS A Record ID.\n    # \"tags\" - (Optional) A mapping of tags to assign to the resource.\n}",
        "description": "Enables you to manage DNS A Records within Azure DNS.",
        "prefix": "azurestack-resource-dns-a-record"
    },
    "azurestack-resource-dns-zone": {
        "body": "resource \"azurestack_dns_zone\" \"$1\" {\n    # resource_group_name - (Required) Specifies the resource group where the resource exists. Changing this forces a new resource to be created.\n    resource_group_name = \"\"\n\n    # name - (Required) The name of the DNS Zone. Must be a valid domain name.\n    name = \"\"\n\n    # tags - (Optional) A mapping of tags to assign to the resource.\n    tags = \"\"\n\n    # Exported Attributes\n    # \"id\" - The DNS Zone ID.\n    # \"tags\" - (Optional) A mapping of tags to assign to the resource.\n    # \"max_number_of_record_sets\" - (Optional) Maximum number of Records in the zone. Defaults to \"1000\".\n    # \"tags\" - (Optional) A mapping of tags to assign to the resource.\n    # \"number_of_record_sets\" - (Optional) The number of records already in the zone.\n    # \"tags\" - (Optional) A mapping of tags to assign to the resource.\n    # \"name_servers\" - (Optional) A list of values that make up the NS record for the zone.\n    # \"tags\" - (Optional) A mapping of tags to assign to the resource.\n}",
        "description": "Enables you to manage DNS zones within Azure DNS. These zones are hosted on Azure's name servers to which you can delegate the zone from the parent domain.",
        "prefix": "azurestack-resource-dns-zone"
    },
    "azurestack-resource-loadbalancer-backend-address-pool": {
        "body": "resource \"azurestack_lb_backend_address_pool\" \"$1\" {\n    # loadbalancer_id - (Required) The ID of the LoadBalancer in which to create the Backend Address Pool.\n    loadbalancer_id = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to create the resource.\n    resource_group_name = \"\"\n\n    # name - (Required) Specifies the name of the Backend Address Pool.\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\" - The ID of the LoadBalancer to which the resource is attached.\n}",
        "description": "Manages a LoadBalancer Backend Address Pool. ~> **NOTE:** When using this resource, the LoadBalancer needs to have a FrontEnd IP Configuration Attached",
        "prefix": "azurestack-resource-loadbalancer-backend-address-pool"
    },
    "azurestack-resource-loadbalancer-nat-pool": {
        "body": "resource \"azurestack_lb_nat_pool\" \"$1\" {\n    # backend_port - (Required) The port used for the internal endpoint. Possible values range between 1 and 65535, inclusive.\n    backend_port = \"\"\n\n    # frontend_port_end - (Required) The last port number in the range of external ports that will be used to provide Inbound Nat to NICs associated with this Load Balancer. Possible values range between 1 and 65534, inclusive.\n    frontend_port_end = \"\"\n\n    # frontend_port_start - (Required) The first port number in the range of external ports that will be used to provide Inbound Nat to NICs associated with this Load Balancer. Possible values range between 1 and 65534, inclusive.\n    frontend_port_start = \"\"\n\n    # protocol - (Required) The transport protocol for the external endpoint. Possible values are `Udp` or `Tcp`.\n    protocol = \"\"\n\n    # frontend_ip_configuration_name - (Required) The name of the frontend IP configuration exposing this rule.\n    frontend_ip_configuration_name = \"\"\n\n    # loadbalancer_id - (Required) The ID of the Load Balancer in which to create the NAT pool.\n    loadbalancer_id = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to create the resource.\n    resource_group_name = \"\"\n\n    # name - (Required) Specifies the name of the NAT pool.\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\" - The ID of the Load Balancer to which the resource is attached.\n}",
        "description": "Manages a Load Balancer NAT pool. ~> **NOTE** When using this resource, the Load Balancer needs to have a FrontEnd IP Configuration Attached",
        "prefix": "azurestack-resource-loadbalancer-nat-pool"
    },
    "azurestack-resource-loadbalancer-nat-rule": {
        "body": "resource \"azurestack_lb_nat_rule\" \"$1\" {\n    # backend_port - (Required) The port used for internal connections on the endpoint. Possible values range between 1 and 65535, inclusive.\n    backend_port = \"\"\n\n    # frontend_port - (Required) The port for the external endpoint. Port numbers for each Rule must be unique within the Load Balancer. Possible values range between 1 and 65534, inclusive.\n    frontend_port = \"\"\n\n    # protocol - (Required) The transport protocol for the external endpoint. Possible values are `Udp` or `Tcp`.\n    protocol = \"\"\n\n    # frontend_ip_configuration_name - (Required) The name of the frontend IP configuration exposing this rule.\n    frontend_ip_configuration_name = \"\"\n\n    # loadbalancer_id - (Required) The ID of the LoadBalancer in which to create the NAT Rule.\n    loadbalancer_id = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to create the resource.\n    resource_group_name = \"\"\n\n    # name - (Required) Specifies the name of the NAT Rule.\n    name = \"\"\n\n    # enable_floating_ip - (Optional) Enables the Floating IP Capacity, required to configure a SQL AlwaysOn Availability Group.\n    enable_floating_ip = \"\"\n\n    # Exported Attributes\n    # \"id\" - The ID of the LoadBalancer to which the resource is attached.\n}",
        "description": "Manages a LoadBalancer NAT Rule. ~> **NOTE** When using this resource, the LoadBalancer needs to have a FrontEnd IP Configuration Attached",
        "prefix": "azurestack-resource-loadbalancer-nat-rule"
    },
    "azurestack-resource-loadbalancer-probe": {
        "body": "resource \"azurestack_lb_probe\" \"$1\" {\n    # port - (Required) Port on which the Probe queries the backend endpoint. Possible values range from 1 to 65535, inclusive.\n    port = \"\"\n\n    # loadbalancer_id - (Required) The ID of the LoadBalancer in which to create the NAT Rule.\n    loadbalancer_id = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to create the resource.\n    resource_group_name = \"\"\n\n    # name - (Required) Specifies the name of the Probe.\n    name = \"\"\n\n    # protocol - (Optional) Specifies the protocol of the end point. Possible values are `Http` or `Tcp`. If Tcp is specified, a received ACK is required for the probe to be successful. If Http is specified, a 200 OK response from the specified URI is required for the probe to be successful.\n    protocol = \"\"\n\n    # request_path - (Optional) The URI used for requesting health status from the backend endpoint. Required if protocol is set to Http. Otherwise, it is not allowed.\n    request_path = \"\"\n\n    # interval_in_seconds - (Optional) The interval, in seconds between probes to the backend endpoint for health status. The default value is 15, the minimum value is 5.\n    interval_in_seconds = \"\"\n\n    # number_of_probes - (Optional) The number of failed probe attempts after which the backend endpoint is removed from rotation. The default value is 2. NumberOfProbes multiplied by intervalInSeconds value must be greater or equal to 10.Endpoints are returned to rotation when at least one probe is successful.\n    number_of_probes = \"\"\n\n    # Exported Attributes\n    # \"id\" - The ID of the LoadBalancer to which the resource is attached.\n}",
        "description": "Manages a LoadBalancer Probe Resource. ~> **NOTE** When using this resource, the LoadBalancer needs to have a FrontEnd IP Configuration Attached",
        "prefix": "azurestack-resource-loadbalancer-probe"
    },
    "azurestack-resource-loadbalancer-rule": {
        "body": "resource \"azurestack_lb_rule\" \"$1\" {\n    # backend_port - (Required) The port used for internal connections on the endpoint. Possible values range between 1 and 65535, inclusive.\n    backend_port = \"\"\n\n    # frontend_port - (Required) The port for the external endpoint. Port numbers for each Rule must be unique within the Load Balancer. Possible values range between 1 and 65534, inclusive.\n    frontend_port = \"\"\n\n    # protocol - (Required) The transport protocol for the external endpoint. Possible values are `Udp` or `Tcp`.\n    protocol = \"\"\n\n    # frontend_ip_configuration_name - (Required) The name of the frontend IP configuration to which the rule is associated.\n    frontend_ip_configuration_name = \"\"\n\n    # loadbalancer_id - (Required) The ID of the Load Balancer in which to create the Rule.\n    loadbalancer_id = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to create the resource.\n    resource_group_name = \"\"\n\n    # name - (Required) Specifies the name of the LB Rule.\n    name = \"\"\n\n    # backend_address_pool_id - (Optional) A reference to a Backend Address Pool over which this Load Balancing Rule operates.\n    backend_address_pool_id = \"\"\n\n    # probe_id - (Optional) A reference to a Probe used by this Load Balancing Rule.\n    probe_id = \"\"\n\n    # enable_floating_ip - (Optional) Floating IP is pertinent to failover scenarios: a \"floating” IP is reassigned to a secondary server in case the primary server fails. Floating IP is required for SQL AlwaysOn.\n    enable_floating_ip = \"\"\n\n    # idle_timeout_in_minutes - (Optional) Specifies the timeout for the Tcp idle connection. The value can be set between 4 and 30 minutes. The default value is 4 minutes. This element is only used when the protocol is set to Tcp.\n    idle_timeout_in_minutes = \"\"\n\n    # load_distribution - (Optional) Specifies the load balancing distribution type to be used by the Load Balancer. Possible values are: `Default` – The load balancer is configured to use a 5 tuple hash to map traffic to available servers. `SourceIP` – The load balancer is configured to use a 2 tuple hash to map traffic to available servers. `SourceIPProtocol` – The load balancer is configured to use a 3 tuple hash to map traffic to available servers. Also known as Session Persistence, where  the options are called `None`, `Client IP` and `Client IP and Protocol` respectively.\n    load_distribution = \"\"\n\n    # Exported Attributes\n    # \"id\" - The ID of the Load Balancer to which the resource is attached.\n}",
        "description": "Manages a Load Balancer Rule. ~> **NOTE** When using this resource, the Load Balancer needs to have a FrontEnd IP Configuration Attached",
        "prefix": "azurestack-resource-loadbalancer-rule"
    },
    "azurestack-resource-loadbalancer-x": {
        "body": "resource \"azurestack_lb\" \"$1\" {\n    # name - (Required) Specifies the name of the frontend ip configuration.\n    name = \"\"\n\n    # location - (Required) Specifies the supported Azure location where the resource exists.\n    location = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to create the LoadBalancer.\n    resource_group_name = \"\"\n\n    # name - (Required) Specifies the name of the LoadBalancer.\n    name = \"\"\n\n    # frontend_ip_configuration - (Optional) A frontend ip configuration block as documented below.\n    frontend_ip_configuration = \"\"\n\n    # tags - (Optional) A mapping of tags to assign to the resource.\n    tags = \"\"\n\n    # frontend_ip_configuration - (Optional) `frontend_ip_configuration` supports the following:\n    frontend_ip_configuration = \"\"\n\n    # tags - (Optional) A mapping of tags to assign to the resource.\n    tags = \"\"\n\n    # subnet_id - (Optional) Reference to subnet associated with the IP Configuration.\n    subnet_id = \"\"\n\n    # tags - (Optional) A mapping of tags to assign to the resource.\n    tags = \"\"\n\n    # private_ip_address - (Optional) Private IP Address to assign to the Load Balancer. The last one and first four IPs in any range are reserved and cannot be manually assigned.\n    private_ip_address = \"\"\n\n    # tags - (Optional) A mapping of tags to assign to the resource.\n    tags = \"\"\n\n    # private_ip_address_allocation - (Optional) Defines how a private IP address is assigned. Options are Static or Dynamic.\n    private_ip_address_allocation = \"\"\n\n    # tags - (Optional) A mapping of tags to assign to the resource.\n    tags = \"\"\n\n    # public_ip_address_id - (Optional) Reference to Public IP address to be associated with the Load Balancer.\n    public_ip_address_id = \"\"\n\n    # tags - (Optional) A mapping of tags to assign to the resource.\n    tags = \"\"\n\n    # Exported Attributes\n    # \"id\" - The LoadBalancer ID.\n    # \"tags\" - (Optional) A mapping of tags to assign to the resource.\n    # \"private_ip_address\" - The first private IP address assigned to the load balancer in \"frontend_ip_configuration\" blocks, if any.\n    # \"tags\" - (Optional) A mapping of tags to assign to the resource.\n    # \"private_ip_addresses\" - The list of private IP address assigned to the load balancer in \"frontend_ip_configuration\" blocks, if any.\n    # \"tags\" - (Optional) A mapping of tags to assign to the resource.\n}",
        "description": "Manages a Load Balancer Resource.",
        "prefix": "azurestack-resource-loadbalancer-x"
    },
    "azurestack-resource-network-interface": {
        "body": "resource \"azurestack_network_interface\" \"$1\" {\n    # private_ip_address_allocation - (Required) Defines how a private IP address is assigned. Options are Static or Dynamic.\n    private_ip_address_allocation = \"\"\n\n    # subnet_id - (Required) Reference to a subnet in which this NIC has been created.\n    subnet_id = \"\"\n\n    # name - (Required) User-defined name of the IP.\n    name = \"\"\n\n    # ip_configuration - (Required) One or more `ip_configuration` associated with this NIC as documented below.\n    ip_configuration = \"\"\n\n    # location - (Required) The location/region where the network interface is created. Changing this forces a new resource to be created.\n    location = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to create the network interface. Changing this forces a new resource to be created.\n    resource_group_name = \"\"\n\n    # name - (Required) The name of the network interface. Changing this forces a new resource to be created.\n    name = \"\"\n\n    # network_security_group_id - (Optional) The ID of the Network Security Group to associate with the network interface.\n    network_security_group_id = \"\"\n\n    # internal_dns_name_label - (Optional) Relative DNS name for this NIC used for internal communications between VMs in the same VNet\n    internal_dns_name_label = \"\"\n\n    # enable_ip_forwarding - (Optional) Enables IP Forwarding on the NIC. Defaults to `false`.\n    enable_ip_forwarding = \"\"\n\n    # dns_servers - (Optional) List of DNS servers IP addresses to use for this NIC, overrides the VNet-level server list\n    dns_servers = \"\"\n\n    # tags - (Optional) A mapping of tags to assign to the resource.\n    tags = \"\"\n\n    # private_ip_address - (Optional) Static IP Address.\n    private_ip_address = \"\"\n\n    # public_ip_address_id - (Optional) Reference to a Public IP Address to associate with this NIC\n    public_ip_address_id = \"\"\n\n    # load_balancer_backend_address_pools_ids - (Optional) List of Load Balancer Backend Address Pool IDs references to which this NIC belongs\n    load_balancer_backend_address_pools_ids = \"\"\n\n    # load_balancer_inbound_nat_rules_ids - (Optional) List of Load Balancer Inbound Nat Rules IDs involving this NIC\n    load_balancer_inbound_nat_rules_ids = \"\"\n\n    # application_security_group_ids - (Optional) List of Application Security Group IDs which should be attached to this NIC\n    application_security_group_ids = \"\"\n\n    # primary - (Optional) Is this the Primary Network Interface? If set to `true` this should be the first `ip_configuration` in the array.\n    primary = \"\"\n\n    # application_security_group_ids - (Optional) List of Application Security Group IDs which should be attached to this NIC\n    application_security_group_ids = \"\"\n\n    # Exported Attributes\n    # \"id\" - The Virtual Network Interface ID.\n    # \"application_security_group_ids\" - (Optional) List of Application Security Group IDs which should be attached to this NIC\n    # \"mac_address\" - The media access control (MAC) address of the network interface.\n    # \"application_security_group_ids\" - (Optional) List of Application Security Group IDs which should be attached to this NIC\n    # \"private_ip_address\" - The private ip address of the network interface.\n    # \"application_security_group_ids\" - (Optional) List of Application Security Group IDs which should be attached to this NIC\n    # \"virtual_machine_id\" - Reference to a VM with which this NIC has been associated.\n    # \"application_security_group_ids\" - (Optional) List of Application Security Group IDs which should be attached to this NIC\n    # \"applied_dns_servers\" - If the VM that uses this NIC is part of an Availability Set, then this list will have the union of all DNS servers from all NICs that are part of the Availability Set\n    # \"application_security_group_ids\" - (Optional) List of Application Security Group IDs which should be attached to this NIC\n    # \"internal_fqdn\" - Fully qualified DNS name supporting internal communications between VMs in the same VNet\n    # \"application_security_group_ids\" - (Optional) List of Application Security Group IDs which should be attached to this NIC\n}",
        "description": "Manages a Network Interface located in a Virtual Network, usually attached to a Virtual Machine.",
        "prefix": "azurestack-resource-network-interface"
    },
    "azurestack-resource-network-local-network-gateway": {
        "body": "resource \"azurestack_local_network_gateway\" \"$1\" {\n    # bgp_peering_address - (Required) The BGP peering address and BGP identifier   of this BGP speaker.\n    bgp_peering_address = \"\"\n\n    # asn - (Required) The BGP speaker's ASN.\n    asn = \"\"\n\n    # address_space - (Required) The list of string CIDRs representing the   address spaces the gateway exposes.\n    address_space = \"\"\n\n    # gateway_address - (Required) The IP address of the gateway to which to   connect.\n    gateway_address = \"\"\n\n    # location - (Required) The location/region where the local network gateway is   created. Changing this forces a new resource to be created.\n    location = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to   create the local network gateway.\n    resource_group_name = \"\"\n\n    # name - (Required) The name of the local network gateway. Changing this   forces a new resource to be created.\n    name = \"\"\n\n    # bgp_settings - (Optional) A `bgp_settings` block as defined below containing the   Local Network Gateway's BGP speaker settings.\n    bgp_settings = \"\"\n\n    # tags - (Optional) A mapping of tags to assign to the resource.\n    tags = \"\"\n\n    # bgp_settings - (Optional) `bgp_settings` supports the following:\n    bgp_settings = \"\"\n\n    # peer_weight - (Optional) The weight added to routes learned from this   BGP speaker.\n    peer_weight = \"\"\n\n    # Exported Attributes\n    # \"id\" - The local network gateway unique ID within Azure.\n    # \"peer_weight\" - (Optional) The weight added to routes learned from this   BGP speaker.\n}",
        "description": "Manages a local network gateway connection over which specific connections can be configured.",
        "prefix": "azurestack-resource-network-local-network-gateway"
    },
    "azurestack-resource-network-public-ip": {
        "body": "resource \"azurestack_public_ip\" \"$1\" {\n    # public_ip_address_allocation - (Required) Defines whether the IP address is static or dynamic. Options are Static or Dynamic.\n    public_ip_address_allocation = \"\"\n\n    # location - (Required) Specifies the supported Azure location where the resource exists. Changing this forces a new resource to be created.\n    location = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to   create the public ip.\n    resource_group_name = \"\"\n\n    # name - (Required) Specifies the name of the Public IP resource . Changing this forces a   new resource to be created.\n    name = \"\"\n\n    # idle_timeout_in_minutes - (Optional) Specifies the timeout for the TCP idle connection. The value can be set between 4 and 30 minutes.\n    idle_timeout_in_minutes = \"\"\n\n    # domain_name_label - (Optional) Label for the Domain Name. Will be used to make up the FQDN.  If a domain name label is specified, an A DNS record is created for the public IP in the Microsoft Azure DNS system.\n    domain_name_label = \"\"\n\n    # reverse_fqdn - (Optional) A fully qualified domain name that resolves to this public IP address. If the reverseFqdn is specified, then a PTR DNS record is created pointing from the IP address in the in-addr.arpa domain to the reverse FQDN.\n    reverse_fqdn = \"\"\n\n    # tags - (Optional) A mapping of tags to assign to the resource.\n    tags = \"\"\n\n    # Exported Attributes\n    # \"id\" - The Public IP ID.\n    # \"tags\" - (Optional) A mapping of tags to assign to the resource.\n    # \"ip_address\" - The IP address value that was allocated.\n    # \"tags\" - (Optional) A mapping of tags to assign to the resource.\n    # \"fqdn\" - Fully qualified domain name of the A DNS record associated with the public IP. This is the concatenation of the domainNameLabel and the regionalized DNS zone\n    # \"tags\" - (Optional) A mapping of tags to assign to the resource.\n}",
        "description": "Manages a Public IP Address.",
        "prefix": "azurestack-resource-network-public-ip"
    },
    "azurestack-resource-network-route-table": {
        "body": "resource \"azurestack_route_table\" \"$1\" {\n    # next_hop_type - (Required) The type of Azure hop the packet should be sent to. Possible values are `VirtualNetworkGateway`, `VnetLocal`, `Internet`, `VirtualAppliance` and `None`.\n    next_hop_type = \"\"\n\n    # address_prefix - (Required) The destination CIDR to which the route applies, such as 10.1.0.0/16\n    address_prefix = \"\"\n\n    # name - (Required) The name of the route.\n    name = \"\"\n\n    # location - (Required) Specifies the supported Azure location where the resource exists. Changing this forces a new resource to be created.\n    location = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to create the route table. Changing this forces a new resource to be created.\n    resource_group_name = \"\"\n\n    # name - (Required) The name of the route table. Changing this forces a new resource to be created.\n    name = \"\"\n\n    # route - (Optional) Can be specified multiple times to define multiple routes. Each `route` block supports fields documented below.\n    route = \"\"\n\n    # tags - (Optional) A mapping of tags to assign to the resource.\n    tags = \"\"\n\n    # next_hop_in_ip_address - (Optional) Contains the IP address packets should be forwarded to. Next hop values are only allowed in routes where the next hop type is `VirtualAppliance`.\n    next_hop_in_ip_address = \"\"\n\n    # Exported Attributes\n    # \"id\" - The Route Table ID.\n    # \"next_hop_in_ip_address\" - (Optional) Contains the IP address packets should be forwarded to. Next hop values are only allowed in routes where the next hop type is \"VirtualAppliance\".\n    # \"subnets\" - The collection of Subnets associated with this route table.\n    # \"next_hop_in_ip_address\" - (Optional) Contains the IP address packets should be forwarded to. Next hop values are only allowed in routes where the next hop type is \"VirtualAppliance\".\n}",
        "description": "Manages a Route Table",
        "prefix": "azurestack-resource-network-route-table"
    },
    "azurestack-resource-network-route-x": {
        "body": "resource \"azurestack_route\" \"$1\" {\n    # next_hop_type - (Required) The type of Azure hop the packet should be sent to. Possible values are `VirtualNetworkGateway`, `VnetLocal`, `Internet`, `VirtualAppliance` and `None`\n    next_hop_type = \"\"\n\n    # address_prefix - (Required) The destination CIDR to which the route applies, such as `10.1.0.0/16`\n    address_prefix = \"\"\n\n    # route_table_name - (Required) The name of the route table within which create the route. Changing this forces a new resource to be created.\n    route_table_name = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to create the route. Changing this forces a new resource to be created.\n    resource_group_name = \"\"\n\n    # name - (Required) The name of the route. Changing this forces a new resource to be created.\n    name = \"\"\n\n    # next_hop_in_ip_address - (Optional) Contains the IP address packets should be forwarded to. Next hop values are only allowed in routes where the next hop type is `VirtualAppliance`.\n    next_hop_in_ip_address = \"\"\n\n    # Exported Attributes\n    # \"id\" - The Route ID.\n    # \"next_hop_in_ip_address\" - (Optional) Contains the IP address packets should be forwarded to. Next hop values are only allowed in routes where the next hop type is \"VirtualAppliance\".\n}",
        "description": "Manages a Route within a Route Table.",
        "prefix": "azurestack-resource-network-route-x"
    },
    "azurestack-resource-network-security-group": {
        "body": "resource \"azurestack_network_security_group\" \"$1\" {\n    # direction - (Required) The direction specifies if rule will be evaluated on incoming or outgoing traffic. Possible values are `Inbound` and `Outbound`.\n    direction = \"\"\n\n    # priority - (Required) Specifies the priority of the rule. The value can be between 100 and 4096. The priority number must be unique for each rule in the collection. The lower the priority number, the higher the priority of the rule.\n    priority = \"\"\n\n    # access - (Required) Specifies whether network traffic is allowed or denied. Possible values are `Allow` and `Deny`.\n    access = \"\"\n\n    # protocol - (Required) Network protocol this rule applies to. Can be `Tcp`, `Udp` or `*` to match both.\n    protocol = \"\"\n\n    # name - (Required) The name of the security rule.\n    name = \"\"\n\n    # location - (Required) Specifies the supported Azure location where the resource exists. Changing this forces a new resource to be created.\n    location = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to create the network security group. Changing this forces a new resource to be created.\n    resource_group_name = \"\"\n\n    # name - (Required) Specifies the name of the network security group. Changing this forces a new resource to be created.\n    name = \"\"\n\n    # security_rule - (Optional) One or more `security_rule` blocks as defined below.\n    security_rule = \"\"\n\n    # tags - (Optional) A mapping of tags to assign to the resource.\n    tags = \"\"\n\n    # description - (Optional) A description for this rule. Restricted to 140 characters.\n    description = \"\"\n\n    # source_port_range - (Optional) Source Port or Range. Integer or range between `0` and `65535` or `*` to match any.\n    source_port_range = \"\"\n\n    # destination_port_range - (Optional) Destination Port or Range. Integer or range between `0` and `65535` or `*` to match any.\n    destination_port_range = \"\"\n\n    # source_address_prefix - (Optional) CIDR or source IP range or * to match any IP. Tags such as ‘VirtualNetwork’, ‘AzureLoadBalancer’ and ‘Internet’ can also be used.\n    source_address_prefix = \"\"\n\n    # destination_address_prefix - (Optional) CIDR or destination IP range or * to match any IP. Tags such as ‘VirtualNetwork’, ‘AzureLoadBalancer’ and ‘Internet’ can also be used.\n    destination_address_prefix = \"\"\n\n    # Exported Attributes\n    # \"id\" - The Network Security Group ID.\n    # \"direction\" - (Required) The direction specifies if rule will be evaluated on incoming or outgoing traffic. Possible values are \"Inbound\" and \"Outbound\".\n}",
        "description": "Manages a network security group that contains a list of network security rules.  Network security groups enable inbound or outbound traffic to be enabled or denied. ~> **NOTE on Network Security Groups and Network Security Rules:** Terraform currently\nprovides both a standalone [Network Security Rule resource](network_security_rule.html), and allows for Network Security Rules to be defined in-line within the [Network Security Group resource](network_security_group.html).\nAt this time you cannot use a Network Security Group with in-line Network Security Rules in conjunction with any Network Security Rule resources. Doing so will cause a conflict of rule settings and will overwrite rules.",
        "prefix": "azurestack-resource-network-security-group"
    },
    "azurestack-resource-network-security-rule": {
        "body": "resource \"azurestack_network_security_rule\" \"$1\" {\n    # direction - (Required) The direction specifies if rule will be evaluated on incoming or outgoing traffic. Possible values are `Inbound` and `Outbound`.\n    direction = \"\"\n\n    # priority - (Required) Specifies the priority of the rule. The value can be between 100 and 4096. The priority number must be unique for each rule in the collection. The lower the priority number, the higher the priority of the rule.\n    priority = \"\"\n\n    # access - (Required) Specifies whether network traffic is allowed or denied. Possible values are `Allow` and `Deny`.\n    access = \"\"\n\n    # protocol - (Required) Network protocol this rule applies to. Possible values include `Tcp`, `Udp` or `*` (which matches both).\n    protocol = \"\"\n\n    # network_security_group_name - (Required) The name of the Network Security Group that we want to attach the rule to. Changing this forces a new resource to be created.\n    network_security_group_name = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to create the Network Security Rule. Changing this forces a new resource to be created.\n    resource_group_name = \"\"\n\n    # name - (Required) The name of the security rule. This needs to be unique across all Rules in the Network Security Group. Changing this forces a new resource to be created.\n    name = \"\"\n\n    # description - (Optional) A description for this rule. Restricted to 140 characters.\n    description = \"\"\n\n    # source_port_range - (Optional) Source Port or Range. Integer or range between `0` and `65535` or `*` to match any.\n    source_port_range = \"\"\n\n    # destination_port_range - (Optional) Destination Port or Range. Integer or range between `0` and `65535` or `*` to match any.\n    destination_port_range = \"\"\n\n    # source_address_prefix - (Optional) CIDR or source IP range or * to match any IP. Tags such as ‘VirtualNetwork’, ‘AzureLoadBalancer’ and ‘Internet’ can also be used.\n    source_address_prefix = \"\"\n\n    # destination_address_prefix - (Optional) CIDR or destination IP range or * to match any IP. Tags such as ‘VirtualNetwork’, ‘AzureLoadBalancer’ and ‘Internet’ can also be used.\n    destination_address_prefix = \"\"\n\n    # Exported Attributes\n    # \"id\" - The Network Security Rule ID.\n    # \"direction\" - (Required) The direction specifies if rule will be evaluated on incoming or outgoing traffic. Possible values are \"Inbound\" and \"Outbound\".\n}",
        "description": "Manages a Network Security Rule. ~> **NOTE on Network Security Groups and Network Security Rules:** Terraform currently\nprovides both a standalone [Network Security Rule resource](network_security_rule.html), and allows for Network Security Rules to be defined in-line within the [Network Security Group resource](network_security_group.html).\nAt this time you cannot use a Network Security Group with in-line Network Security Rules in conjunction with any Network Security Rule resources. Doing so will cause a conflict of rule settings and will overwrite rules.",
        "prefix": "azurestack-resource-network-security-rule"
    },
    "azurestack-resource-network-subnet": {
        "body": "resource \"azurestack_subnet\" \"$1\" {\n    # address_prefix - (Required) The address prefix to use for the subnet.\n    address_prefix = \"\"\n\n    # virtual_network_name - (Required) The name of the virtual network to which to attach the subnet. Changing this forces a new resource to be created.\n    virtual_network_name = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to create the subnet. Changing this forces a new resource to be created.\n    resource_group_name = \"\"\n\n    # name - (Required) The name of the subnet. Changing this forces a new resource to be created.\n    name = \"\"\n\n    # network_security_group_id - (Optional) The ID of the Network Security Group to associate with the subnet.\n    network_security_group_id = \"\"\n\n    # route_table_id - (Optional) The ID of the Route Table to associate with the subnet.\n    route_table_id = \"\"\n\n    # Exported Attributes\n    # \"id\" - The subnet ID.\n    # \"route_table_id\" - (Optional) The ID of the Route Table to associate with the subnet.\n    # \"ip_configurations\" - The collection of IP Configurations with IPs within this subnet.\n    # \"route_table_id\" - (Optional) The ID of the Route Table to associate with the subnet.\n    # \"name\" - The name of the subnet.\n    # \"route_table_id\" - (Optional) The ID of the Route Table to associate with the subnet.\n    # \"resource_group_name\" - The name of the resource group in which the subnet is created in.\n    # \"route_table_id\" - (Optional) The ID of the Route Table to associate with the subnet.\n    # \"virtual_network_name\" - The name of the virtual network in which the subnet is created in\n    # \"route_table_id\" - (Optional) The ID of the Route Table to associate with the subnet.\n    # \"address_prefix\" - The address prefix for the subnet\n    # \"route_table_id\" - (Optional) The ID of the Route Table to associate with the subnet.\n}",
        "description": "Manages a subnet. Subnets represent network segments within the IP space defined by the virtual network. ~> **NOTE on Virtual Networks and Subnet's:** Terraform currently\nprovides both a standalone [Subnet resource](subnet.html), and allows for Subnets to be defined in-line within the [Virtual Network resource](virtual_network.html).\nAt this time you cannot use a Virtual Network with in-line Subnets in conjunction with any Subnet resources. Doing so will cause a conflict of Subnet configurations and will overwrite Subnet's.",
        "prefix": "azurestack-resource-network-subnet"
    },
    "azurestack-resource-network-virtual-network": {
        "body": "resource \"azurestack_virtual_network\" \"$1\" {\n    # address_prefix - (Required) The address prefix to use for the subnet.\n    address_prefix = \"\"\n\n    # name - (Required) The name of the subnet.\n    name = \"\"\n\n    # location - (Required) The location/region where the virtual network is   created. Changing this forces a new resource to be created.\n    location = \"\"\n\n    # address_space - (Required) The address space that is used the virtual   network. You can supply more than one address space. Changing this forces   a new resource to be created.\n    address_space = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to   create the virtual network.\n    resource_group_name = \"\"\n\n    # name - (Required) The name of the virtual network. Changing this forces a   new resource to be created.\n    name = \"\"\n\n    # dns_servers - (Optional) List of IP addresses of DNS servers\n    dns_servers = \"\"\n\n    # subnet - (Optional) Can be specified multiple times to define multiple   subnets. Each `subnet` block supports fields documented below.\n    subnet = \"\"\n\n    # tags - (Optional) A mapping of tags to assign to the resource.\n    tags = \"\"\n\n    # security_group - (Optional) The Network Security Group to associate with   the subnet. (Referenced by `id`, ie. `azurestack_network_security_group.test.id`)\n    security_group = \"\"\n\n    # Exported Attributes\n    # \"id\" - The virtual NetworkConfiguration ID.\n    # \"name\" - The name of the virtual network.\n    # \"resource_group_name\" - The name of the resource group in which to create the virtual network.\n    # \"location\" - The location/region where the virtual network is created\n    # \"address_space\" - The address space that is used the virtual network.\n}",
        "description": "Creates a new virtual network including any configured subnets. Each subnet can\noptionally be configured with a security group to be associated with the subnet. ~> **NOTE on Virtual Networks and Subnet's:** Terraform currently\nprovides both a standalone [Subnet resource](subnet.html), and allows for Subnets to be defined in-line within the [Virtual Network resource](virtual_network.html).\nAt this time you cannot use a Virtual Network with in-line Subnets in conjunction with any Subnet resources. Doing so will cause a conflict of Subnet configurations and will overwrite Subnets.",
        "prefix": "azurestack-resource-network-virtual-network"
    },
    "azurestack-resource-network-virtual-network-gateway-connection": {
        "body": "resource \"azurestack_virtual_network_gateway_connection\" \"$1\" {\n    # virtual_network_gateway_id - (Required) The ID of the Virtual Network Gateway   in which the connection will be created. Changing the gateway forces a new   resource to be created.\n    virtual_network_gateway_id = \"\"\n\n    # type - (Required) The type of connection. Valid options are `IPsec`   (Site-to-Site), `ExpressRoute` (ExpressRoute), and `Vnet2Vnet` (VNet-to-VNet).   Each connection type requires different mandatory arguments (refer to the   examples above). Changing the connection type will force a new connection   to be created.\n    type = \"\"\n\n    # location - (Required) The location/region where the connection is   located. Changing this forces a new resource to be created.\n    location = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to   create the connection Changing the name forces a new resource to be created.\n    resource_group_name = \"\"\n\n    # name - (Required) The name of the connection. Changing the name forces a   new resource to be created.\n    name = \"\"\n\n    # authorization_key - (Optional) The authorization key associated with the   Express Route Circuit. This field is required only if the type is an   ExpressRoute connection.\n    authorization_key = \"\"\n\n    # express_route_circuit_id - (Optional) The ID of the Express Route Circuit   when creating an ExpressRoute connection (i.e. when `type` is `ExpressRoute`).   The Express Route Circuit can be in the same or in a different subscription.\n    express_route_circuit_id = \"\"\n\n    # peer_virtual_network_gateway_id - (Optional) The ID of the peer virtual   network gateway when creating a VNet-to-VNet connection (i.e. when `type`   is `Vnet2Vnet`). The peer Virtual Network Gateway can be in the same or   in a different subscription.\n    peer_virtual_network_gateway_id = \"\"\n\n    # local_network_gateway_id - (Optional) The ID of the local network gateway   when creating Site-to-Site connection (i.e. when `type` is `IPsec`).\n    local_network_gateway_id = \"\"\n\n    # routing_weight - (Optional) The routing weight. Defaults to `10`.\n    routing_weight = \"\"\n\n    # shared_key - (Optional) The shared IPSec key. A key must be provided if a   Site-to-Site or VNet-to-VNet connection is created whereas ExpressRoute   connections do not need a shared key.\n    shared_key = \"\"\n\n    # enable_bgp - (Optional) If `true`, BGP (Border Gateway Protocol) is enabled   for this connection. Defaults to `false`.\n    enable_bgp = \"\"\n\n    # tags - (Optional) A mapping of tags to assign to the resource.\n    tags = \"\"\n\n    # Exported Attributes\n    # \"id\" - The connection ID.\n    # \"tags\" - (Optional) A mapping of tags to assign to the resource.\n}",
        "description": "Manages a connection in an existing Virtual Network Gateway.",
        "prefix": "azurestack-resource-network-virtual-network-gateway-connection"
    },
    "azurestack-resource-resource-group": {
        "body": "resource \"azurestack_resource_group\" \"$1\" {\n    # location - (Required) The location where the resource group should be created.   For a list of all Azure locations, please consult [this link](http://azure.microsoft.com/en-us/regions/) or run `az account list-locations --output table`.\n    location = \"\"\n\n    # name - (Required) The name of the resource group. Must be unique on your   Azure subscription.\n    name = \"\"\n\n    # tags - (Optional) A mapping of tags to assign to the resource.\n    tags = \"\"\n\n    # Exported Attributes\n    # \"id\" - The resource group ID.\n    # \"tags\" - (Optional) A mapping of tags to assign to the resource.\n}",
        "description": "Creates a new resource group on Azure.",
        "prefix": "azurestack-resource-resource-group"
    },
    "azurestack-resource-storage-account": {
        "body": "resource \"azurestack_storage_account\" \"$1\" {\n    # account_replication_type - (Required) Defines the type of replication to use for this storage account. Valid option is `LRS` currently as per [Azure Stack Storage Differences](https://docs.microsoft.com/en-us/azure/azure-stack/user/azure-stack-acs-differences)\n    account_replication_type = \"\"\n\n    # account_tier - (Required) Defines the Tier to use for this storage account. Valid options are `Standard` and `Premium`. Changing this forces a new resource to be created - **`Can be provisioned, but no performance limit or guarantee.`**\n    account_tier = \"\"\n\n    # location - (Required) Specifies the supported Azure location where the   resource exists. Changing this forces a new resource to be created.\n    location = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to   create the storage account. Changing this forces a new resource to be created.\n    resource_group_name = \"\"\n\n    # name - (Required) Specifies the name of the storage account. Changing this forces a   new resource to be created. This must be unique across the entire Azure service,   not just within the resource group.\n    name = \"\"\n\n    # account_kind - (Optional) Defines the Kind of account. Valid option is `Storage`.  . Changing this forces a new resource to be created.   Defaults to `Storage` currently as per [Azure Stack Storage Differences](https://docs.microsoft.com/en-us/azure/azure-stack/user/azure-stack-acs-differences)\n    account_kind = \"\"\n\n    # access_tier - (Optional) **`Currently Not Supported on Azure Stack`**\n    access_tier = \"\"\n\n    # account_encryption_source - (Optional) The Encryption Source for this Storage Account. Possible values are `Microsoft.Keyvault` and `Microsoft.Storage`. Defaults to `Microsoft.Storage`.\n    account_encryption_source = \"\"\n\n    # custom_domain - (Optional) A `custom_domain` block as documented below.\n    custom_domain = \"\"\n\n    # tags - (Optional) A mapping of tags to assign to the resource.\n    tags = \"\"\n\n    # custom_domain - (Optional) `custom_domain` supports the following:\n    custom_domain = \"\"\n\n    # name - (Optional) The Custom Domain Name to use for the Storage Account, which will be validated by Azure.\n    name = \"\"\n\n    # use_subdomain - (Optional) Should the Custom Domain Name be validated by using indirect CNAME validation?\n    use_subdomain = \"\"\n\n    # name - (Optional) The Custom Domain Name to use for the Storage Account, which will be validated by Azure.\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\" - The storage account Resource ID.\n    # \"name\" - (Optional) The Custom Domain Name to use for the Storage Account, which will be validated by Azure.\n    # \"primary_location\" - The primary location of the storage account.\n    # \"name\" - (Optional) The Custom Domain Name to use for the Storage Account, which will be validated by Azure.\n    # \"secondary_location\" - The secondary location of the storage account.\n    # \"name\" - (Optional) The Custom Domain Name to use for the Storage Account, which will be validated by Azure.\n    # \"primary_blob_endpoint\" - The endpoint URL for blob storage in the primary location.\n    # \"name\" - (Optional) The Custom Domain Name to use for the Storage Account, which will be validated by Azure.\n    # \"secondary_blob_endpoint\" - The endpoint URL for blob storage in the secondary location.\n    # \"name\" - (Optional) The Custom Domain Name to use for the Storage Account, which will be validated by Azure.\n    # \"primary_queue_endpoint\" - The endpoint URL for queue storage in the primary location.\n    # \"name\" - (Optional) The Custom Domain Name to use for the Storage Account, which will be validated by Azure.\n    # \"secondary_queue_endpoint\" - The endpoint URL for queue storage in the secondary location.\n    # \"name\" - (Optional) The Custom Domain Name to use for the Storage Account, which will be validated by Azure.\n    # \"primary_table_endpoint\" - The endpoint URL for table storage in the primary location.\n    # \"name\" - (Optional) The Custom Domain Name to use for the Storage Account, which will be validated by Azure.\n    # \"secondary_table_endpoint\" - The endpoint URL for table storage in the secondary location.\n    # \"name\" - (Optional) The Custom Domain Name to use for the Storage Account, which will be validated by Azure.\n    # \"primary_file_endpoint\" - The endpoint URL for file storage in the primary location.\n    # \"name\" - (Optional) The Custom Domain Name to use for the Storage Account, which will be validated by Azure.\n    # \"primary_access_key\" - The primary access key for the storage account\n    # \"name\" - (Optional) The Custom Domain Name to use for the Storage Account, which will be validated by Azure.\n    # \"secondary_access_key\" - The secondary access key for the storage account\n    # \"name\" - (Optional) The Custom Domain Name to use for the Storage Account, which will be validated by Azure.\n    # \"primary_connection_string\" - The connection string associated with the primary location\n    # \"name\" - (Optional) The Custom Domain Name to use for the Storage Account, which will be validated by Azure.\n    # \"secondary_connection_string\" - The connection string associated with the secondary location\n    # \"name\" - (Optional) The Custom Domain Name to use for the Storage Account, which will be validated by Azure.\n    # \"primary_blob_connection_string\" - The connection string associated with the primary blob location\n    # \"name\" - (Optional) The Custom Domain Name to use for the Storage Account, which will be validated by Azure.\n    # \"secondary_blob_connection_string\" - The connection string associated with the secondary blob location\n    # \"name\" - (Optional) The Custom Domain Name to use for the Storage Account, which will be validated by Azure.\n}",
        "description": "Manages an Azure Storage Account.",
        "prefix": "azurestack-resource-storage-account"
    },
    "azurestack-resource-storage-blob": {
        "body": "resource \"azurestack_storage_blob\" \"$1\" {\n    # storage_container_name - (Required) The name of the storage container in which this blob should be created.\n    storage_container_name = \"\"\n\n    # storage_account_name - (Required) Specifies the storage account in which to create the storage container. Changing this forces a new resource to be created.\n    storage_account_name = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to   create the storage container. Changing this forces a new resource to be created.\n    resource_group_name = \"\"\n\n    # name - (Required) The name of the storage blob. Must be unique within the storage container the blob is located.\n    name = \"\"\n\n    # type - (Optional) The type of the storage blob to be created. One of either `block` or `page`. When not copying from an existing blob,   this becomes required.\n    type = \"\"\n\n    # size - (Optional) Used only for `page` blobs to specify the size in bytes of the blob to be created. Must be a multiple of 512. Defaults to 0.\n    size = \"\"\n\n    # source - (Optional) An absolute path to a file on the local system. Cannot be defined if `source_uri` is defined.\n    source = \"\"\n\n    # source_uri - (Optional) The URI of an existing blob, or a file in the Azure File service, to use as the source contents   for the blob to be created. Changing this forces a new resource to be created. Cannot be defined if `source` is defined.\n    source_uri = \"\"\n\n    # parallelism - (Optional) The number of workers per CPU core to run for concurrent uploads. Defaults to `8`.\n    parallelism = \"\"\n\n    # attempts - (Optional) The number of attempts to make per page or block when uploading. Defaults to `1`.\n    attempts = \"\"\n\n    # Exported Attributes\n    # \"id\" - The storage blob Resource ID.\n    # \"attempts\" - (Optional) The number of attempts to make per page or block when uploading. Defaults to \"1\".\n    # \"url\" - The URL of the blob\n    # \"attempts\" - (Optional) The number of attempts to make per page or block when uploading. Defaults to \"1\".\n}",
        "description": "Manages an Azure Storage Blob.",
        "prefix": "azurestack-resource-storage-blob"
    },
    "azurestack-resource-storage-container": {
        "body": "resource \"azurestack_storage_container\" \"$1\" {\n    # storage_account_name - (Required) Specifies the storage account in which to create the storage container. Changing this forces a new resource to be created.\n    storage_account_name = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to   create the storage container. Changing this forces a new resource to be created.\n    resource_group_name = \"\"\n\n    # name - (Required) The name of the storage container. Must be unique within the storage service the container is located.\n    name = \"\"\n\n    # container_access_type - (Optional) The 'interface' for access the container provides. Can be either `blob`, `container` or `private`. Defaults to `private`. Changing this forces a new resource to be created.\n    container_access_type = \"\"\n\n    # Exported Attributes\n    # \"id\" - The storage container Resource ID.\n    # \"container_access_type\" - (Optional) The 'interface' for access the container provides. Can be either \"blob\", \"container\" or \"private\". Defaults to \"private\". Changing this forces a new resource to be created.\n    # \"properties\" - Key-value definition of additional properties associated to the storage container\n    # \"container_access_type\" - (Optional) The 'interface' for access the container provides. Can be either \"blob\", \"container\" or \"private\". Defaults to \"private\". Changing this forces a new resource to be created.\n}",
        "description": "Manages an Azure Storage Container.",
        "prefix": "azurestack-resource-storage-container"
    },
    "azurestack-resource-template-deployment": {
        "body": "resource \"azurestack_template_deployment\" \"$1\" {\n    # deployment_mode - (Required) Specifies the mode that is used to deploy resources. This value could be either `Incremental` or `Complete`.\n    deployment_mode = \"\"\n\n    # resource_group_name - (Required) The name of the resource group in which to\n    resource_group_name = \"\"\n\n    # name - (Required) Specifies the name of the template deployment. Changing this forces a\n    name = \"\"\n\n    # template_body - (Optional) Specifies the JSON definition for the template.\n    template_body = \"\"\n\n    # parameters - (Optional) Specifies the name and value pairs that define the deployment parameters for the template.\n    parameters = \"\"\n\n    # parameters_body - (Optional) Specifies a valid Azure JSON parameters file that define the deployment parameters. It can contain KeyVault references\n    parameters_body = \"\"\n\n    # Exported Attributes\n    # \"id\" - The Template Deployment ID.\n    # \"outputs\" - A map of supported scalar output types returned from the deployment (currently, Azure Template Deployment outputs of type String, Int and Bool are supported, and are converted to strings - others will be ignored) and can be accessed using \".outputs[\"name\"]\".\n}",
        "description": "Manages a template deployment of resources ~> **Note on ARM Template Deployments:** Due to the way the underlying Azure API is designed, Terraform can only manage the deployment of the ARM Template - and not any resources which are created by it.\nThis means that when deleting the `azurestack_template_deployment` resource, Terraform will only remove the reference to the deployment, whilst leaving any resources created by that ARM Template Deployment.\nOne workaround for this is to use a unique Resource Group for each ARM Template Deployment, which means deleting the Resource Group would contain any resources created within it - however this isn't ideal. [More information](https://docs.microsoft.com/en-us/rest/api/resources/deployments#Deployments_Delete).",
        "prefix": "azurestack-resource-template-deployment"
    }
}