{
    "cloudflare-datasource-ip_ranges": {
        "body": "data \"cloudflare_ip_ranges\" \"$1\" {\n    # Exported Attributes\n    # \"cidr_blocks\" - The lexically ordered list of all CIDR blocks.\n    # \"ipv4_cidr_blocks\" - The lexically ordered list of only the IPv4 CIDR blocks.\n    # \"ipv6_cidr_blocks\" - The lexically ordered list of only the IPv6 CIDR blocks.\n}",
        "description": "Use this data source to get the [IP ranges][1] of Cloudflare edge nodes.",
        "prefix": "cloudflare-datasource-ip_ranges"
    },
    "cloudflare-datasource-zones": {
        "body": "data \"cloudflare_zones\" \"$1\" {\n    # filter - (Required) One or more values used to look up zone records. If more than one value is given all\n    filter = \"\"\n\n    # name - (Optional) A regular expression matching the zone to lookup.\n    name = \"\"\n\n    # status - (Optional) Status of the zone to lookup. Valid values: active, pending, initializing, moved, deleted, deactivated and read only.\n    status = \"\"\n\n    # paused - (Optional) Paused status of the zone to lookup. Valid values are `true` or `false`.\n    paused = \"\"\n\n    # Exported Attributes\n    # \"zones\" - A list of zone names\n}",
        "description": "Use this data source to look up [Zone][1] records.",
        "prefix": "cloudflare-datasource-zones"
    },
    "cloudflare-resource-access-application": {
        "body": "resource \"cloudflare_access_application\" \"$1\" {\n    # domain - (Required) The complete URL of the asset you wish to put\n    domain = \"\"\n\n    # name - (Required) Friendly name of the Access Application.\n    name = \"\"\n\n    # zone_id - (Required) The DNS zone to which the access rule should be added.\n    zone_id = \"\"\n\n    # session_duration - (Optional) How often a user will be forced to\n    session_duration = \"\"\n\n    # Exported Attributes\n}",
        "description": "Provides a Cloudflare Access Application resource. Access Applications\nare used to restrict access to a whole application using an\nauthorisation gateway managed by Cloudflare.",
        "prefix": "cloudflare-resource-access-application"
    },
    "cloudflare-resource-access-policy": {
        "body": "resource \"cloudflare_access_policy\" \"$1\" {\n    # include - (Required) A series of access conditions, see below for\n    include = \"\"\n\n    # name - (Required) Friendly name of the Access Application.\n    name = \"\"\n\n    # decision - (Required) The complete URL of the asset you wish to put\n    decision = \"\"\n\n    # zone_id - (Required) The DNS zone to which the access rule should be\n    zone_id = \"\"\n\n    # application_id - (Required) The ID of the application the policy is\n    application_id = \"\"\n\n    # precedence - (Optional) The unique precedence for policies on a single application. Integer.\n    precedence = \"\"\n\n    # require - (Optional) A series of access conditions, see below for\n    require = \"\"\n\n    # exclude - (Optional) A series of access conditions, see below for\n    exclude = \"\"\n\n    # Exported Attributes\n}",
        "description": "Provides a Cloudflare Access Policy resource. Access Policies are used\nin conjunction with Access Applications to restrict access to a\nparticular resource.",
        "prefix": "cloudflare-resource-access-policy"
    },
    "cloudflare-resource-access-rule": {
        "body": "resource \"cloudflare_access_rule\" \"$1\" {\n    # value - (Required) The value to target. Depends on target's type.\n    value = \"\"\n\n    # target - (Required) The request property to target. Allowed values: \"ip\", \"ip_range\", \"asn\", \"country\"\n    target = \"\"\n\n    # configuration - (Required) Rule configuration to apply to a matched request. It's a complex value. See description below.\n    configuration = \"\"\n\n    # mode - (Required) The action to apply to a matched request. Allowed values: \"block\", \"challenge\", \"whitelist\", \"js_challenge\"\n    mode = \"\"\n\n    # zone - (Optional) The DNS zone to which the access rule should be added. Will be resolved to `zone_id` upon creation.\n    zone = \"\"\n\n    # zone_id - (Optional) The DNS zone to which the access rule should be added.\n    zone_id = \"\"\n\n    # notes - (Optional) A personal note about the rule. Typically used as a reminder or explanation for the rule.\n    notes = \"\"\n\n    # Exported Attributes\n    # \"id\" - The access rule ID.\n    # \"zone_id\" - The DNS zone ID.\n}",
        "description": "Provides a Cloudflare IP Firewall Access Rule resource. Access control can be applied on basis of IP addresses, IP ranges, AS numbers or countries.",
        "prefix": "cloudflare-resource-access-rule"
    },
    "cloudflare-resource-account-member": {
        "body": "resource \"cloudflare_account_member\" \"$1\" {\n    # role_ids - (Required) Array of account role IDs that you want to assign to a member.\n    role_ids = \"\"\n\n    # email_address - (Required) The email address of the user who you wish to manage. Note: Following creation, this field becomes read only via the API and cannot be updated.\n    email_address = \"\"\n\n    # Exported Attributes\n}",
        "description": "Provides a resource which manages Cloudflare account members.",
        "prefix": "cloudflare-resource-account-member"
    },
    "cloudflare-resource-custom-pages": {
        "body": "resource \"cloudflare_custom_pages\" \"$1\" {\n    # state - (Required) Managed state of the custom page. Must be one of\n    state = \"\"\n\n    # url - (Required) URL of where the custom page source is located.\n    url = \"\"\n\n    # type - (Required) The type of custom page you wish to update. Must\n    type = \"\"\n\n    # zone_id - (Optional) The zone ID where the custom pages should be\n    zone_id = \"\"\n\n    # account_id - (Optional) The account ID where the custom pages should be\n    account_id = \"\"\n\n    # account_id - (Optional) `account_id` is present, it will override the zone setting.\n    account_id = \"\"\n\n    # ratelimit_block - (Optional) `ratelimit_block`, `country_challenge`, `ip_block`, `under_attack`,\n    ratelimit_block = \"\"\n\n    # default - (Optional) `default`, `customised`. If the value is `default` it will be removed\n    default = \"\"\n\n    # Exported Attributes\n}",
        "description": "Provides a resource which manages Cloudflare custom error pages.",
        "prefix": "cloudflare-resource-custom-pages"
    },
    "cloudflare-resource-filter": {
        "body": "resource \"cloudflare_filter\" \"$1\" {\n    # expression - (Required) The filter expression to be used.\n    expression = \"\"\n\n    # zone - (Optional) The DNS zone to which the Filter should be added. Will be resolved to `zone_id` upon creation.\n    zone = \"\"\n\n    # zone_id - (Optional) The DNS zone to which the Filter should be added.\n    zone_id = \"\"\n\n    # paused - (Optional) Whether this filter is currently paused. Boolean value.\n    paused = \"\"\n\n    # description - (Optional) A note that you can use to describe the purpose of the filter.\n    description = \"\"\n\n    # ref - (Optional) Short reference tag to quickly select related rules.\n    ref = \"\"\n\n    # Exported Attributes\n    # \"id\" - Filter identifier.\n    # \"zone_id\" - The DNS zone ID.\n}",
        "description": "Filter expressions that can be referenced across multiple features, e.g. [Firewall Rule](firewall_rule.html). The expression format is similar to [Wireshark Display Filter](https://www.wireshark.org/docs/man-pages/wireshark-filter.html).",
        "prefix": "cloudflare-resource-filter"
    },
    "cloudflare-resource-firewall-rule": {
        "body": "resource \"cloudflare_firewall_rule\" \"$1\" {\n    # expression - (Required) The filter expression to be used.\n    expression = \"\"\n\n    # action - (Required) The action to apply to a matched request. Allowed values: \"block\", \"challenge\", \"allow\", \"js_challenge\".\n    action = \"\"\n\n    # zone - (Optional) The DNS zone to which the Firewall Rule should be added. Will be resolved to `zone_id` upon creation.\n    zone = \"\"\n\n    # zone_id - (Optional) The DNS zone to which the Filter should be added.\n    zone_id = \"\"\n\n    # priority - (Optional) The priority of the rule to allow control of processing order. A lower number indicates high priority. If not provided, any rules with a priority will be sequenced before those without.\n    priority = \"\"\n\n    # paused - (Optional) Whether this filter based firewall rule is currently paused. Boolean value.\n    paused = \"\"\n\n    # description - (Optional) A description of the rule to help identify it.\n    description = \"\"\n\n    # Exported Attributes\n    # \"id\" - Firewall Rule identifier.\n    # \"zone_id\" - The DNS zone ID.\n}",
        "description": "Define Firewall rules using filter expressions for more control over how traffic is matched to the rule.\nA filter expression permits selecting traffic by multiple criteria allowing greater freedom in rule creation. Filter expressions needs to be created first before using Firewall Rule. See [Filter](filter.html).",
        "prefix": "cloudflare-resource-firewall-rule"
    },
    "cloudflare-resource-load-balancer": {
        "body": "resource \"cloudflare_load_balancer\" \"$1\" {\n    # pool_ids - (Required) A list of pool IDs in failover priority to use for traffic reaching the given PoP.\n    pool_ids = \"\"\n\n    # pop - (Required) A 3-letter code for the Point-of-Presence. Allowed values can be found in the list of datacenters on the [status page](https://www.cloudflarestatus.com/). Multiple entries should not be specified with the same PoP.\n    pop = \"\"\n\n    # pool_ids - (Required) A list of pool IDs in failover priority to use in the given region.\n    pool_ids = \"\"\n\n    # region - (Required) A region code which must be in the list defined [here](https://support.cloudflare.com/hc/en-us/articles/115000540888-Load-Balancing-Geographic-Regions). Multiple entries should not be specified with the same region.\n    region = \"\"\n\n    # default_pool_ids - (Required) A list of pool IDs ordered by their failover priority. Used whenever region/pop pools are not defined.\n    default_pool_ids = \"\"\n\n    # fallback_pool_id - (Required) The pool ID to use when all other pools are detected as unhealthy.\n    fallback_pool_id = \"\"\n\n    # name - (Required) The DNS name to associate with the load balancer.\n    name = \"\"\n\n    # zone - (Required) The zone to add the load balancer to.\n    zone = \"\"\n\n    # description - (Optional) Free text description.\n    description = \"\"\n\n    # ttl - (Optional) Time to live (TTL) of this load balancer's DNS `name`. Conflicts with `proxied` - this cannot be set for proxied load balancers. Default is `30`.\n    ttl = \"\"\n\n    # steering_policy - (Optional) Determine which method the load balancer uses to determine the fastest route to your origin. Valid values  are: \"off\", \"geo\", \"dynamic_latency\" or \"\". Default is \"\".\n    steering_policy = \"\"\n\n    # proxied - (Optional) Whether the hostname gets Cloudflare's origin protection. Defaults to `false`.\n    proxied = \"\"\n\n    # region_pools - (Optional) A set containing mappings of region/country codes to a list of pool IDs (ordered by their failover priority) for the given region. Fields documented below.\n    region_pools = \"\"\n\n    # pop_pools - (Optional) A set containing mappings of Cloudflare Point-of-Presence (PoP) identifiers to a list of pool IDs (ordered by their failover priority) for the PoP (datacenter). This feature is only available to enterprise customers. Fields documented below.\n    pop_pools = \"\"\n\n    # session_affinity - (Optional) Associates all requests coming from an end-user with a single origin. Cloudflare will set a cookie on the initial response to the client, such that consequent requests with the cookie in the request will go to the same origin, so long as it is available.\n    session_affinity = \"\"\n\n    # Exported Attributes\n    # \"id\" - Unique identifier in the API for the load balancer.\n    # \"zone_id\" - ID associated with the specified \"zone\".\n    # \"created_on\" - The RFC3339 timestamp of when the load balancer was created.\n    # \"modified_on\" - The RFC3339 timestamp of when the load balancer was last modified.\n}",
        "description": "Provides a Cloudflare Load Balancer resource. This sits in front of a number of defined pools of origins and provides various options for geographically-aware load balancing. Note that the load balancing feature must be enabled in your Clouflare account before you can use this resource.",
        "prefix": "cloudflare-resource-load-balancer"
    },
    "cloudflare-resource-load-balancer-monitor": {
        "body": "resource \"cloudflare_load_balancer_monitor\" \"$1\" {\n    # values - (Required) A list of string values for the header.\n    values = \"\"\n\n    # header - (Required) The header name.\n    header = \"\"\n\n    # expected_codes - (Required) The expected HTTP response code or code range of the health check. Eg `2xx`\n    expected_codes = \"\"\n\n    # expected_body - (Required) A case-insensitive sub-string to look for in the response body. If this string is not found, the origin will be marked as unhealthy.\n    expected_body = \"\"\n\n    # method - (Optional) The HTTP method to use for the health check. Default: \"GET\".\n    method = \"\"\n\n    # timeout - (Optional) The timeout (in seconds) before marking the health check as failed. Default: 5.\n    timeout = \"\"\n\n    # path - (Optional) The endpoint path to health check against. Default: \"/\".\n    path = \"\"\n\n    # interval - (Optional) The interval between each health check. Shorter intervals may improve failover time, but will increase load on the origins as we check from multiple locations. Default: 60.\n    interval = \"\"\n\n    # retries - (Optional) The number of retries to attempt in case of a timeout before marking the origin as unhealthy. Retries are attempted immediately. Default: 2.\n    retries = \"\"\n\n    # header - (Optional) The HTTP request headers to send in the health check. It is recommended you set a Host header by default. The User-Agent header cannot be overridden. Fields documented below.\n    header = \"\"\n\n    # type - (Optional) The protocol to use for the healthcheck. Currently supported protocols are 'HTTP' and 'HTTPS'. Default: \"http\".\n    type = \"\"\n\n    # description - (Optional) Free text description.\n    description = \"\"\n\n    # Exported Attributes\n    # \"id\" - Load balancer monitor ID.\n    # \"created_on\" - The RFC3339 timestamp of when the load balancer monitor was created.\n    # \"modified_on\" - The RFC3339 timestamp of when the load balancer monitor was last modified.\n}",
        "description": "If you're using Cloudflare's Load Balancing to load-balance across multiple origin servers or data centers, you configure one of these Monitors to actively check the availability of those servers over HTTP(S).",
        "prefix": "cloudflare-resource-load-balancer-monitor"
    },
    "cloudflare-resource-load-balancer-pool": {
        "body": "resource \"cloudflare_load_balancer_pool\" \"$1\" {\n    # address - (Required) The IP address (IPv4 or IPv6) of the origin, or the publicly addressable hostname. Hostnames entered here should resolve directly to the origin, and not be a hostname proxied by Cloudflare.\n    address = \"\"\n\n    # name - (Required) A human-identifiable name for the origin.\n    name = \"\"\n\n    # origins - (Required) The list of origins within this pool. Traffic directed at this pool is balanced across all currently healthy origins, provided the pool itself is healthy. It's a complex value. See description below.\n    origins = \"\"\n\n    # name - (Required) A short name (tag) for the pool. Only alphanumeric characters, hyphens, and underscores are allowed.\n    name = \"\"\n\n    # check_regions - (Optional) A list of regions (specified by region code) from which to run health checks. Empty means every Cloudflare data center (the default), but requires an Enterprise plan. Region codes can be found [here](https://support.cloudflare.com/hc/en-us/articles/115000540888-Load-Balancing-Geographic-Regions).\n    check_regions = \"\"\n\n    # description - (Optional) Free text description.\n    description = \"\"\n\n    # enabled - (Optional) Whether to enable (the default) this pool. Disabled pools will not receive traffic and are excluded from health checks. Disabling a pool will cause any load balancers using it to failover to the next pool (if any).\n    enabled = \"\"\n\n    # minimum_origins - (Optional) The minimum number of origins that must be healthy for this pool to serve traffic. If the number of healthy origins falls below this number, the pool will be marked unhealthy and we will failover to the next available pool. Default: 1.\n    minimum_origins = \"\"\n\n    # monitor - (Optional) The ID of the Monitor to use for health checking origins within this pool.\n    monitor = \"\"\n\n    # notification_email - (Optional) The email address to send health status notifications to. This can be an individual mailbox or a mailing list.\n    notification_email = \"\"\n\n    # weight - (Optional) The weight (0.01 - 1.00) of this origin, relative to other origins in the pool. Equal values mean equal weighting. A weight of 0 means traffic will not be sent to this origin, but health is still checked. Default: 1.\n    weight = \"\"\n\n    # enabled - (Optional) Whether to enable (the default) this origin within the Pool. Disabled origins will not receive traffic and are excluded from health checks. The origin will only be disabled for the current pool.\n    enabled = \"\"\n\n    # Exported Attributes\n    # \"id\" - ID for this load balancer pool.\n    # \"created_on\" - The RFC3339 timestamp of when the load balancer was created.\n    # \"modified_on\" - The RFC3339 timestamp of when the load balancer was last modified.\n}",
        "description": "Provides a Cloudflare Load Balancer pool resource. This provides a pool of origins that can be used by a Cloudflare Load Balancer. Note that the load balancing feature must be enabled in your Clouflare account before you can use this resource.",
        "prefix": "cloudflare-resource-load-balancer-pool"
    },
    "cloudflare-resource-page-rule": {
        "body": "resource \"cloudflare_page_rule\" \"$1\" {\n    # status_code - (Required) The status code to use for the redirection.\n    status_code = \"\"\n\n    # url - (Required) The URL to which the page rule should forward.\n    url = \"\"\n\n    # actions - (Required) The actions taken by the page rule, options given below.\n    actions = \"\"\n\n    # target - (Required) The URL pattern to target with the page rule.\n    target = \"\"\n\n    # zone - (Required) The DNS zone to which the page rule should be added.\n    zone = \"\"\n\n    # priority - (Optional) The priority of the page rule among others for this target, the higher the number the higher the priority as per [API documentation](https://api.cloudflare.com/#page-rules-for-a-zone-create-page-rule).\n    priority = \"\"\n\n    # status - (Optional) Whether the page rule is active or disabled.\n    status = \"\"\n\n    # always_online - (Optional) Whether this action is `\"on\"` or `\"off\"`.\n    always_online = \"\"\n\n    # always_use_https - (Optional) Boolean of whether this action is enabled. Default: false.\n    always_use_https = \"\"\n\n    # automatic_https_rewrites - (Optional) Whether this action is `\"on\"` or `\"off\"`.\n    automatic_https_rewrites = \"\"\n\n    # browser_cache_ttl - (Optional) The Time To Live for the browser cache.\n    browser_cache_ttl = \"\"\n\n    # browser_check - (Optional) Whether this action is `\"on\"` or `\"off\"`.\n    browser_check = \"\"\n\n    # cache_level - (Optional) Whether to set the cache level to `\"bypass\"`, `\"basic\"`, `\"simplified\"`, `\"aggressive\"`, or `\"cache_everything\"`.\n    cache_level = \"\"\n\n    # disable_apps - (Optional) Boolean of whether this action is enabled. Default: false.\n    disable_apps = \"\"\n\n    # disable_performance - (Optional) Boolean of whether this action is enabled. Default: false.\n    disable_performance = \"\"\n\n    # disable_railgun - (Optional) Boolean of whether this action is enabled. Default: false.\n    disable_railgun = \"\"\n\n    # disable_security - (Optional) Boolean of whether this action is enabled. Default: false.\n    disable_security = \"\"\n\n    # edge_cache_ttl - (Optional) The Time To Live for the edge cache.\n    edge_cache_ttl = \"\"\n\n    # email_obfuscation - (Optional) Whether this action is `\"on\"` or `\"off\"`.\n    email_obfuscation = \"\"\n\n    # explicit_cache_control - (Optional) Whether origin Cache-Control action is `\"on\"` or `\"off\"`.\n    explicit_cache_control = \"\"\n\n    # forwarding_url - (Optional) The URL to forward to, and with what status. See below.\n    forwarding_url = \"\"\n\n    # host_header_override - (Optional) Value of the Host header to send.\n    host_header_override = \"\"\n\n    # ip_geolocation - (Optional) Whether this action is `\"on\"` or `\"off\"`.\n    ip_geolocation = \"\"\n\n    # mirage - (Optional) Whether this action is `\"on\"` or `\"off\"`.\n    mirage = \"\"\n\n    # opportunistic_encryption - (Optional) Whether this action is `\"on\"` or `\"off\"`.\n    opportunistic_encryption = \"\"\n\n    # polish - (Optional) Whether this action is `\"off\"`, `\"lossless\"` or `\"lossy\"`.\n    polish = \"\"\n\n    # resolve_override - (Optional) Overridden origin server name.\n    resolve_override = \"\"\n\n    # rocket_loader - (Optional) Whether to set the rocket loader to `\"on\"`, `\"off\"`.\n    rocket_loader = \"\"\n\n    # security_level - (Optional) Whether to set the security level to `\"off\"`, `\"essentially_off\"`, `\"low\"`, `\"medium\"`, `\"high\"`, or `\"under_attack\"`.\n    security_level = \"\"\n\n    # server_side_exclude - (Optional) Whether this action is `\"on\"` or `\"off\"`.\n    server_side_exclude = \"\"\n\n    # smart_errors - (Optional) Whether this action is `\"on\"` or `\"off\"`.\n    smart_errors = \"\"\n\n    # ssl - (Optional) Whether to set the SSL mode to `\"off\"`, `\"flexible\"`, `\"full\"`, or `\"strict\"`.\n    ssl = \"\"\n\n    # waf - (Optional) Whether this action is `\"on\"` or `\"off\"`.\n    waf = \"\"\n\n    # Exported Attributes\n    # \"id\" - The page rule ID.\n    # \"zone_id\" - The ID of the zone in which the page rule will be applied.\n    # \"target\" - The URL pattern targeted by the page rule.\n    # \"actions\" - The actions applied by the page rule.\n    # \"priority\" - The priority of the page rule.\n    # \"status\" - Whether the page rule is active or disabled.\n}",
        "description": "Provides a Cloudflare page rule resource.",
        "prefix": "cloudflare-resource-page-rule"
    },
    "cloudflare-resource-rate-limit": {
        "body": "resource \"cloudflare_rate_limit\" \"$1\" {\n    # body - (Required) The body to return, the content here should conform to the content_type.\n    body = \"\"\n\n    # content_type - (Required) The content-type of the body, must be one of: 'text/plain', 'text/xml', 'application/json'.\n    content_type = \"\"\n\n    # mode - (Required) The type of action to perform. Allowable values are 'simulate' and 'ban'.\n    mode = \"\"\n\n    # action - (Required) The action to be performed when the threshold of matched traffic within the period defined is exceeded.\n    action = \"\"\n\n    # period - (Required) The time in seconds to count matching traffic. If the count exceeds threshold within this period the action will be performed (min: 1, max: 86,400).\n    period = \"\"\n\n    # threshold - (Required) The threshold that triggers the rate limit mitigations, combine with period. i.e. threshold per period (min: 2, max: 1,000,000).\n    threshold = \"\"\n\n    # zone - (Required) The DNS zone to apply rate limiting to.\n    zone = \"\"\n\n    # match - (Optional) Determines which traffic the rate limit counts towards the threshold. By default matches all traffic in the zone. See definition below.\n    match = \"\"\n\n    # disabled - (Optional) Whether this ratelimit is currently disabled. Default: `false`.\n    disabled = \"\"\n\n    # description - (Optional) A note that you can use to describe the reason for a rate limit. This value is sanitized and all tags are removed.\n    description = \"\"\n\n    # bypass_url_patterns - (Optional) URLs matching the patterns specified here will be excluded from rate limiting.\n    bypass_url_patterns = \"\"\n\n    # correlate - (Optional) Determines how rate limiting is applied. By default if not specified, rate limiting applies to the clients IP address.\n    correlate = \"\"\n\n    # request - (Optional) Matches HTTP requests (from the client to Cloudflare). See definition below.\n    request = \"\"\n\n    # response - (Optional) Matches HTTP responses before they are returned to the client from Cloudflare. If this is defined, then the entire counting of traffic occurs at this stage. This field is not required.\n    response = \"\"\n\n    # methods - (Optional) HTTP Methods, can be a subset ['POST','PUT'] or all ['\\_ALL\\_']. Default: ['\\_ALL\\_'].\n    methods = \"\"\n\n    # schemes - (Optional) HTTP Schemes, can be one ['HTTPS'], both ['HTTP','HTTPS'] or all ['\\_ALL\\_'].  Default: ['\\_ALL\\_'].\n    schemes = \"\"\n\n    # url_pattern - (Optional) The URL pattern to match comprised of the host and path, i.e. example.org/path. Wildcard are expanded to match applicable traffic, query strings are not matched. Use * for all traffic to your zone. Default: '*'.\n    url_pattern = \"\"\n\n    # statuses - (Optional) HTTP Status codes, can be one [403], many [401,403] or indicate all by not providing this value.\n    statuses = \"\"\n\n    # origin_traffic - (Optional) Only count traffic that has come from your origin servers. If true, cached items that Cloudflare serve will not count towards rate limiting. Default: `true`.\n    origin_traffic = \"\"\n\n    # timeout - (Optional) The time in seconds as an integer to perform the mitigation action. This field is required if the `mode` is either `simulate` or `ban`. Must be the same or greater than the period (min: 1, max: 86400).\n    timeout = \"\"\n\n    # response - (Optional) Custom content-type and body to return, this overrides the custom error for the zone. This field is not required. Omission will result in default HTML error page. Definition below.\n    response = \"\"\n\n    # by - (Optional) If set to 'nat', NAT support will be enabled for rate limiting.\n    by = \"\"\n\n    # Exported Attributes\n    # \"id\" - The Rate limit ID.\n    # \"zone_id\" - The DNS zone ID.\n}",
        "description": "Provides a Cloudflare rate limit resource for a given zone. This can be used to limit the traffic you receive zone-wide, or matching more specific types of requests/responses.",
        "prefix": "cloudflare-resource-rate-limit"
    },
    "cloudflare-resource-record": {
        "body": "resource \"cloudflare_record\" \"$1\" {\n    # type - (Required) The type of the record\n    type = \"\"\n\n    # name - (Required) The name of the record\n    name = \"\"\n\n    # domain - (Required) The DNS zone to add the record to\n    domain = \"\"\n\n    # value - (Optional) The (string) value of the record. Either this or `data` must be specified\n    value = \"\"\n\n    # data - (Optional) Map of attributes that constitute the record value. Primarily used for LOC and SRV record types. Either this or `value` must be specified\n    data = \"\"\n\n    # ttl - (Optional) The TTL of the record ([automatic: '1'](https://api.cloudflare.com/#dns-records-for-a-zone-create-dns-record))\n    ttl = \"\"\n\n    # priority - (Optional) The priority of the record\n    priority = \"\"\n\n    # proxied - (Optional) Whether the record gets Cloudflare's origin protection; defaults to `false`.\n    proxied = \"\"\n\n    # Exported Attributes\n    # \"id\" - The record ID\n    # \"hostname\" - The FQDN of the record\n    # \"proxiable\" - Shows whether this record can be proxied, must be true if setting \"proxied=true\"\n    # \"created_on\" - The RFC3339 timestamp of when the record was created\n    # \"modified_on\" - The RFC3339 timestamp of when the record was last modified\n    # \"metadata\" - A key-value map of string metadata cloudflare associates with the record\n    # \"zone_id\" - The zone id of the record\n}",
        "description": "Provides a Cloudflare record resource.",
        "prefix": "cloudflare-resource-record"
    },
    "cloudflare-resource-waf-rule": {
        "body": "resource \"cloudflare_waf_rule\" \"$1\" {\n    # mode - (Required) The mode of the rule, can be one of [\"block\", \"challenge\", \"default\", \"disable, \"simulate\"].\n    mode = \"\"\n\n    # rule_id - (Required) The WAF Rule ID.\n    rule_id = \"\"\n\n    # zone - (Required) The DNS zone to apply to.\n    zone = \"\"\n\n    # Exported Attributes\n    # \"id\" - The WAF Rule ID, the same as rule_id.\n    # \"zone_id\" - The DNS zone ID.\n    # \"package_id\" - The ID of the WAF Rule Package that contains the rule.\n}",
        "description": "Provides a Cloudflare WAF rule resource for a particular zone. This can be used to configure firewall behaviour for pre-defined firewall rules.",
        "prefix": "cloudflare-resource-waf-rule"
    },
    "cloudflare-resource-worker-route": {
        "body": "resource \"cloudflare_worker_route\" \"$1\" {\n    # pattern - (Required) The [route pattern](https://developers.cloudflare.com/workers/api/route-matching/)\n    pattern = \"\"\n\n    # zone - (Required) The zone to add the route to.\n    zone = \"\"\n\n    # enabled - (Optional) `enabled` (For single-script accounts only) Whether to run the worker script for requests that match the route pattern. Default is `false`\n    enabled = \"\"\n\n    # script_name - (Optional) `script_name` (For multi-script accounts only) Which worker script to run for requests that match the route pattern. If `script_name` is empty, workers will be skipped for matching requests.\n    script_name = \"\"\n\n    # Exported Attributes\n    # \"zone_id\" - The zone id of the route\n}",
        "description": "Provides a Cloudflare worker route resource. A route will also require a `cloudflare_worker_script`.",
        "prefix": "cloudflare-resource-worker-route"
    },
    "cloudflare-resource-worker-script": {
        "body": "resource \"cloudflare_worker_script\" \"$1\" {\n    # content - (Required) The script content.\n    content = \"\"\n\n    # zone - (Optional) (Required for single-script accounts) The zone for the script.\n    zone = \"\"\n\n    # name - (Optional) (Required for multi-script accounts) The name for the script. \n    name = \"\"\n\n    # Exported Attributes\n    # \"zone_id\" - The zone id of the script (only for non-multi-script resources)\n}",
        "description": "Provides a Cloudflare worker script resource. In order for a script to be active, you'll also need to setup a `cloudflare_worker_route`.",
        "prefix": "cloudflare-resource-worker-script"
    },
    "cloudflare-resource-zone": {
        "body": "resource \"cloudflare_zone\" \"$1\" {\n    # zone - (Required) The DNS zone name which will be added.\n    zone = \"\"\n\n    # paused - (Optional) Boolean of whether this zone is paused (traffic bypasses Cloudflare). Default: false.\n    paused = \"\"\n\n    # jump_start - (Optional) Boolean of whether to scan for DNS records on creation. Ignored after zone is created. Default: false.\n    jump_start = \"\"\n\n    # plan - (Optional) The name of the commercial plan to apply to the zone, can be updated once the one is created; one of `free`, `pro`, `business`, `enterprise`. \n    plan = \"\"\n\n    # Exported Attributes\n    # \"id\" - The zone ID.\n    # \"plan\" - The name of the commercial plan to apply to the zone.\n    # \"vanity_name_servers\" - List of Vanity Nameservers (if set).\n    # \"meta.wildcard_proxiable\" - Indicates whether wildcard DNS records can receive Cloudflare security and performance features.\n    # \"meta.phishing_detected\" - Indicates if URLs on the zone have been identified as hosting phishing content.\n    # \"status\" - Status of the zone. Valid values: \"active\", \"pending\", \"initializing\", \"moved\", \"deleted\", \"deactivated\"\n    # \"type\" - A full zone implies that DNS is hosted with Cloudflare. A partial zone is typically a partner-hosted zone or a CNAME setup. Valid values: \"full\", \"partial\"\n    # \"name_servers\" - Cloudflare-assigned name servers. This is only populated for zones that use Cloudflare DNS.\n}",
        "description": "Provides a Cloudflare Zone resource. Zone is the basic resource for working with Cloudflare and is roughly equivalent to a domain name that the user purchases.",
        "prefix": "cloudflare-resource-zone"
    },
    "cloudflare-resource-zone-lockdown": {
        "body": "resource \"cloudflare_zone_lockdown\" \"$1\" {\n    # value - (Required) The value to target. Depends on target's type. IP addresses should just be standard IPv4/IPv6 notation i.e. `198.51.100.4` or `2001:db8::/32` and IP ranges in CIDR format i.e. `198.51.0.0/16`.\n    value = \"\"\n\n    # target - (Required) The request property to target. Allowed values: \"ip\", \"ip_range\"\n    target = \"\"\n\n    # configurations - (Required) A list of IP addresses or IP ranges to match the request against specified in target, value pairs.  It's a complex value. See description below.   The order of the configuration entries is unimportant.\n    configurations = \"\"\n\n    # urls - (Required) A list of simple wildcard patterns to match requests against. The order of the urls is unimportant.\n    urls = \"\"\n\n    # zone - (Optional) The DNS zone to which the lockdown will be added. Will be resolved to `zone_id` upon creation.\n    zone = \"\"\n\n    # zone_id - (Optional) The DNS zone to which the access rule should be added.\n    zone_id = \"\"\n\n    # description - (Optional) A description about the lockdown entry. Typically used as a reminder or explanation for the lockdown.\n    description = \"\"\n\n    # paused - (Optional) Boolean of whether this zone lockdown is currently paused. Default: false.\n    paused = \"\"\n\n    # Exported Attributes\n    # \"id\" - The access rule ID.\n}",
        "description": "Provides a Cloudflare Zone Lockdown resource. Zone Lockdown allows you to define one or more URLs (with wildcard matching on the domain or path) that will only permit access if the request originates from an IP address that matches a safelist of one or more IP addresses and/or IP ranges.",
        "prefix": "cloudflare-resource-zone-lockdown"
    },
    "cloudflare-resource-zone-settings-override": {
        "body": "resource \"cloudflare_zone_settings_override\" \"$1\" {\n    # name - (Required) The DNS zone to which apply settings.\n    name = \"\"\n\n    # settings - (Optional) Settings overrides that will be applied to the zone. If a setting is not specified the existing setting will be used. For a full list of available settings see below.\n    settings = \"\"\n\n    # Exported Attributes\n    # \"id\" - The zone ID.\n    # \"initial_settings\" - Settings present in the zone at the time the resource is created. This will be used to restore the original settings when this resource is destroyed. Shares the same schema as the \"settings\" attribute (Above).\n    # \"intial_settings_read_at\" - Time when this resource was created and the \"initial_settings\" were set.\n    # \"readonly_settings\" - Which of the current \"settings\" are not able to be set by the user. Which settings these are is determined by plan level and user permissions.\n    # \"zone_status\". A full zone implies that DNS is hosted with Cloudflare. A partial zone is typically a partner-hosted zone or a CNAME setup.\n    # \"zone_type\". Status of the zone. Valid values: active, pending, initializing, moved, deleted, deactivated.\n}",
        "description": "Provides a resource which customizes Cloudflare zone settings. Note that after destroying this resource Zone Settings will be reset to their initial values.",
        "prefix": "cloudflare-resource-zone-settings-override"
    }
}