{
    "cloudscale-resource-floating-ip": {
        "body": "resource \"cloudscale_floating_ip\" \"$1\" {\n    # server - (Required) (Re-)Assign the Floating IP to this server (UUID).\n    server = \"\"\n\n    # ip_version - (Required) `4` or `6`, for an IPv4 or IPv6 address or network respectively.\n    ip_version = \"\"\n\n    # server - (Required) Assign the Floating IP to this server (UUID).\n    server = \"\"\n\n    # prefix_length - (Optional) If you want to assign an entire network instead of a single IP address to your server, you must specify the prefix length. Currently, there is only support for `ip_version=6` and `prefix_length=56`.\n    prefix_length = \"\"\n\n    # reverse_ptr - (Optional) You can specify the PTR record (reverse DNS pointer) in case of a single Floating IP address.\n    reverse_ptr = \"\"\n\n    # Exported Attributes\n    # \"href\" - The cloudscale.ch API URL of the current resource.\n    # \"network\" - The CIDR notation of the Floating IP address or network, e.g. \"192.0.2.123/32\".\n    # \"next_hop\" - The IP address of the server that your Floating IP is currently assigned to.\n}",
        "description": "Provides a cloudscale.ch Floating IP to represent a publicly-accessible static IP address or IP network that can be assigned to one of your cloudscale.ch servers. Floating IPs can be moved between servers. Possible use cases include: High-availability, non-disruptive maintenance, multiple IPs per server, or re-using the same IP after replacing a server.",
        "prefix": "cloudscale-resource-floating-ip"
    },
    "cloudscale-resource-server": {
        "body": "resource \"cloudscale_server\" \"$1\" {\n    # ssh_keys - (Required) A list of SSH public keys. Use the full content of your \\*.pub file here.\n    ssh_keys = \"\"\n\n    # image_slug - (Required) The slug (name) of the image to use for the new server. Possible values can be found in our [API documentation](https://www.cloudscale.ch/en/api/v1#images).\n    image_slug = \"\"\n\n    # flavor_slug - (Required) The slug (name) of the flavor to use for the new server. Possible values can be found in our [API documentation](https://www.cloudscale.ch/en/api/v1#flavors).\n    flavor_slug = \"\"\n\n    # name - (Required) Name of the new server. The name has to be a valid host name or a fully qualified domain name (FQDN).\n    name = \"\"\n\n    # volume_size_gb - (Optional) The size in GB of the SSD root volume of the new server. If this parameter is not specified, the value will be set to 10. Valid values are either 10 or multiples of 50.\n    volume_size_gb = \"\"\n\n    # bulk_volume_size_gb - (Optional) The size in GB of the bulk storage volume of the new server. If this parameter is not specified, no bulk storage volume will be attached to the server. Valid values are multiples of 100.\n    bulk_volume_size_gb = \"\"\n\n    # use_public_network - (Optional) Attach/detach the public network interface to/from the new server. Can be `true` (default) or `false`.\n    use_public_network = \"\"\n\n    # use_private_network - (Optional) Attach/detach the private network interface to/from the new server. Can be `true` or `false` (default).\n    use_private_network = \"\"\n\n    # anti_affinity_uuid - (Optional) Pass the UUID of another server to either create a new anti-affinity group with that server or add the new server to the same (existing) group as the other server.\n    anti_affinity_uuid = \"\"\n\n    # user_data - (Optional) User data (custom cloud-config settings) to use for the new server. Needs to be valid YAML. A default configuration will be used if this parameter is not specified or set to null. Use only if you are an advanced user with knowledge of cloud-config and cloud-init.\n    user_data = \"\"\n\n    # status - (Optional) The desired state of a server. Can be `running` (default) or `stopped`.\n    status = \"\"\n\n    # status - (Optional) The desired state of a server. Can be `running` (default) or `stopped`.\n    status = \"\"\n\n    # Exported Attributes\n    # \"id\" - The UUID of this server.\n    # \"href\" - The cloudscale.ch API URL of the current resource.\n    # \"ssh_fingerprints\" - A list of SSH host key fingerprints (strings) of this server.\n    # \"ssh_host_keys\" - A list of SSH host keys (strings) of this server.\n    # \"anti_affinity_with\" - A list of server UUIDs that belong to the same anti-affinity group as this server.\n    # \"volumes\" - A list of volume objects attached to this server. Each volume object has three attributes:\n    # \"device_path\" - The path (string) to the volume on your server (e.g. \"/dev/vda\")\n    # \"size_gb\" - The size (int) of the volume in GB. Typically matches \"volume_size_gb\" or \"bulk_volume_size_gb\".\n    # \"type\" - A string. Either \"ssd\" or \"bulk\".\n    # \"interfaces\" - A list of interface objects attached to this server. Each interface object has two attributes:\n    # \"type\" - Either \"public\" or \"private\". Public interfaces are connected to the Internet, while private interfaces are not.\n    # \"addresses\" - A list of address objects:\n    # \"address\" - An IPv4 or IPv6 address that has been assigned to this server.\n    # \"gateway\" - An IPv4 or IPv6 address that represents the default gateway for this interface.\n    # \"prefix_length\" - The prefix length for this IP address, typically 24 for IPv4 and 128 for IPv6.\n    # \"reverse_ptr\" - The PTR record (reverse DNS pointer) for this IP address. If you use an FQDN as your server name it will automatically be used here.\n    # \"version\" - The IP version, either \"4\" or \"6\".\n}",
        "description": "Provides a cloudscale.ch Server resource. This can be used to create, modify, and delete servers. ",
        "prefix": "cloudscale-resource-server"
    }
}