{
    "do-datasource-certificate": {
        "body": "data \"digitalocean_certificate\" \"$1\" {\n    # name - (Required) The name of certificate.\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\": The ID of the certificate.\n    # \"type\": The type of the certificate.\n    # \"state\": the current state of the certificate.\n    # \"domains\": Domains for which the certificate was issued.\n    # \"not_after\": The expiration date and time of the certificate.\n    # \"sha1_fingerprint\": The SHA1 fingerprint of the certificate.\n}",
        "description": "Get information on a certificate. This data source provides the name, type, state,\ndomains, expiry date, and the sha1 fingerprint as configured on your DigitalOcean account.\nThis is useful if the certificate in question is not managed by Terraform or you need to utilize\nany of the certificates data. An error is triggered if the provided certificate name does not exist.",
        "prefix": "do-datasource-certificate"
    },
    "do-datasource-domain": {
        "body": "data \"digitalocean_domain\" \"$1\" {\n    # name - (Required) The name of the domain.\n    name = \"\"\n\n    # Exported Attributes\n    # \"ttl\": The TTL of the domain.\n    # \"zone_file\": The zone file of the domain.\n}",
        "description": "Get information on a domain. This data source provides the name, TTL, and zone\nfile as configured on your DigitalOcean account. This is useful if the domain\nname in question is not managed by Terraform or you need to utilize TTL or zone\nfile data. An error is triggered if the provided domain name is not managed with your\nDigitalOcean account.",
        "prefix": "do-datasource-domain"
    },
    "do-datasource-droplet": {
        "body": "data \"digitalocean_droplet\" \"$1\" {\n    # name - (Required) The name of Droplet.\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\": The ID of the Droplet.\n    # \"region\" - The region the Droplet is running in.\n    # \"image\" - The Droplet image ID or slug.\n    # \"size\" - The unique slug that indentifies the type of Droplet.\n    # \"disk\" - The size of the Droplets disk in GB.\n    # \"vcpus\" - The number of the Droplets virtual CPUs.\n    # \"memory\" - The amount of the Droplets memory in MB.\n    # \"price_hourly\" - Droplet hourly price.\n    # \"price_monthly\" - Droplet monthly price.\n    # \"status\" - The status of the Droplet.\n    # \"locked\" - Whether the Droplet is locked.\n    # \"ipv6_address\" - The Droplets public IPv6 address\n    # \"ipv6_address_private\" - The Droplets private IPv6 address\n    # \"ipv4_address\" - The Droplets public IPv4 address\n    # \"ipv4_address_private\" - The Droplets private IPv4 address\n    # \"backups\" - Whether backups are enabled.\n    # \"ipv6\" - Whether IPv6 is enabled.\n    # \"private_networking\" - Whether private networks are enabled.\n    # \"monitoring\" - Whether monitoring agent is installed.\n    # \"volume_ids\" - List of the IDs of each volumes attached to the Droplet.\n    # \"tags\" - A list of the tags associated to the Droplet.\n}",
        "description": "Get information on a Droplet for use in other resources. This data source provides\nall of the Droplet's properties as configured on your DigitalOcean account. This\nis useful if the Droplet in question is not managed by Terraform or you need to\nutilize any of the Droplets data. An error is triggered if the provided Droplet name does not exist.",
        "prefix": "do-datasource-droplet"
    },
    "do-datasource-droplet-snapshot": {
        "body": "data \"digitalocean_droplet_snapshot\" \"$1\" {\n    # name - (Optional) The name of the Droplet snapshot.\n    name = \"\"\n\n    # name_regex - (Optional) A regex string to apply to the Droplet snapshot list returned by DigitalOcean. This allows more advanced filtering not supported from the DigitalOcean API. This filtering is done locally on what DigitalOcean returns.\n    name_regex = \"\"\n\n    # region - (Optional) A \"slug\" representing a DigitalOcean region (e.g. `nyc1`). If set, only Droplet snapshots available in the region will be returned.\n    region = \"\"\n\n    # most_recent - (Optional) If more than one result is returned, use the most recent Droplet snapshot.\n    most_recent = \"\"\n\n    # Exported Attributes\n    # \"id\" The ID of the Droplet snapshot.\n    # \"most_recent\" - (Optional) If more than one result is returned, use the most recent Droplet snapshot.\n    # \"created_at\" - The date and time the Droplet snapshot was created.\n    # \"most_recent\" - (Optional) If more than one result is returned, use the most recent Droplet snapshot.\n    # \"min_disk_size\" - The minimum size in gigabytes required for a Droplet to be created based on this Droplet snapshot.\n    # \"most_recent\" - (Optional) If more than one result is returned, use the most recent Droplet snapshot.\n    # \"regions\" - A list of DigitalOcean region \"slugs\" indicating where the Droplet snapshot is available.\n    # \"most_recent\" - (Optional) If more than one result is returned, use the most recent Droplet snapshot.\n    # \"droplet_id\" - The ID of the Droplet from which the Droplet snapshot originated.\n    # \"most_recent\" - (Optional) If more than one result is returned, use the most recent Droplet snapshot.\n    # \"size\" - The billable size of the Droplet snapshot in gigabytes.\n    # \"most_recent\" - (Optional) If more than one result is returned, use the most recent Droplet snapshot.\n}",
        "description": "Droplet snapshots are saved instances of a Droplet. Use this data\nsource to retrieve the ID of a DigitalOcean Droplet snapshot for use in other\nresources.",
        "prefix": "do-datasource-droplet-snapshot"
    },
    "do-datasource-floating-ip": {
        "body": "data \"digitalocean_floating_ip\" \"$1\" {\n    # ip_address - (Required) The allocated IP address of the specific floating IP to retrieve.\n    ip_address = \"\"\n\n    # Exported Attributes\n    # \"region\": The region that the floating IP is reserved to.\n    # \"droplet_id\": The Droplet id that the floating IP has been assigned to.\n}",
        "description": "Get information on a floating ip. This data source provides the region and Droplet id\nas configured on your DigitalOcean account. This is useful if the floating IP\nin question is not managed by Terraform or you need to find the Droplet the IP is\nattached to. An error is triggered if the provided floating IP does not exist.",
        "prefix": "do-datasource-floating-ip"
    },
    "do-datasource-image": {
        "body": "data \"digitalocean_image\" \"$1\" {\n    # name - (Optional) The name of the private image.\n    name = \"\"\n\n    # slug - (Optional) The slug of the official image.\n    slug = \"\"\n\n    # Exported Attributes\n    # \"id\": The ID of the image.\n    # \"image\" - The id of the image.\n    # \"distribution\" - The name of the distribution of the OS of the image.\n    # \"min_disk_size\": The minimum 'disk' required for the image.\n    # \"private\" - Is image a public image or not. Public images represent\n    # \"regions\": The regions that the image is available in.\n    # \"type\": Type of the image.\n}",
        "description": "Get information on an images for use in other resources (e.g. creating a Droplet\nbased on snapshot). This data source provides all of the image properties as\nconfigured on your DigitalOcean account. This is useful if the image in question\nis not managed by Terraform or you need to utilize any of the image's data. An error is triggered if zero or more than one result is returned by the query.",
        "prefix": "do-datasource-image"
    },
    "do-datasource-kubernetes-cluster": {
        "body": "data \"digitalocean_kubernetes_cluster\" \"$1\" {\n    # name - (Required) The name of Kubernetes cluster.\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\" - The unique ID that can be used to identify and reference a Kubernetes cluster.\n    # \"region\" - The slug identifier for the region where the Kubernetes cluster is located.\n    # \"version\" - The slug identifier for the version of Kubernetes used for the cluster.\n    # \"tags\" - A list of tag names to be applied to the Kubernetes cluster.\n    # \"cluster_subnet\" - The range of IP addresses in the overlay network of the Kubernetes cluster.\n    # \"service_subnet\" - The range of assignable IP addresses for services running in the Kubernetes cluster.\n    # \"ipv4_address\" - The public IPv4 address of the Kubernetes master node.\n    # \"endpoint\" - The base URL of the API server on the Kubernetes master node.\n    # \"status\" -  A string indicating the current status of the cluster. Potential values include running, provisioning, and errored.\n    # \"created_at\" - The date and time when the Kubernetes cluster was created.\n    # \"updated_at\" - The date and time when the Kubernetes cluster was last updated.\n    # \"kube_config.0\" - A representation of the Kubernetes cluster's kubeconfig with the following attributes:\n    # \"raw_config\" - The full contents of the Kubernetes cluster's kubeconfig file.\n    # \"host\" - The URL of the API server on the Kubernetes master node.\n    # \"client_key\" - The base64 encoded private key used by clients to access the cluster.\n    # \"client_certificate\" - The base64 encoded public certificate used by clients to access the cluster.\n    # \"cluster_ca_certificate\" - The base64 encoded public certificate for the cluster's certificate authority.\n    # \"node_pool\" - A list of node pools associated with the cluster. Each node pool exports the following attributes:\n    # \"id\" -  The unique ID that can be used to identify and reference the node pool.\n    # \"name\" - The name of the node pool.\n    # \"size\" - The slug identifier for the type of Droplet used as workers in the node pool.\n    # \"node_count\" - The number of Droplet instances in the node pool.\n    # \"tags\" - A list of tag names applied to the node pool.\n    # \"nodes\" - A list of nodes in the pool. Each node exports the following attributes:\n    # \"id\" -  A unique ID that can be used to identify and reference the node.\n    # \"name\" - The auto-generated name for the node.\n    # \"status\" -  A string indicating the current status of the individual node.\n    # \"created_at\" - The date and time when the node was created.\n    # \"updated_at\" - The date and time when the node was last updated.\n}",
        "description": "~> **NOTE:** DigitalOcean Kubernetes is currently in [Limited Availability](https://www.digitalocean.com/docs/platform/product-lifecycle/). In order to access its API, you must first by enable Kubernetes on your account by opting-in via the [cloud control panel](https://cloud.digitalocean.com/kubernetes/clusters). While the Kubernetes Cluster functionality is currently in limited availability the structure of this resource may change over time. Please share any feedback you may have by [opening an issue on GitHub](https://github.com/terraform-providers/terraform-provider-digitalocean/issues). Retrieves information about a DigitalOcean Kubernetes cluster for use in other resources. This data source provides all of the cluster's properties as configured on your DigitalOcean account. This is useful if the cluster in question is not managed by Terraform.",
        "prefix": "do-datasource-kubernetes-cluster"
    },
    "do-datasource-loadbalancer": {
        "body": "data \"digitalocean_loadbalancer\" \"$1\" {\n    # name - (Required) The name of load balancer.\n    name = \"\"\n\n    # Exported Attributes\n}",
        "description": "Get information on a load balancer for use in other resources. This data source\nprovides all of the load balancers properties as configured on your DigitalOcean\naccount. This is useful if the load balancer in question is not managed by\nTerraform or you need to utilize any of the load balancers data. An error is triggered if the provided load balancer name does not exist.",
        "prefix": "do-datasource-loadbalancer"
    },
    "do-datasource-record": {
        "body": "data \"digitalocean_record\" \"$1\" {\n    # domain - (Required) The domain name of the record.\n    domain = \"\"\n\n    # name - (Required) The name of the record.\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\": The ID of the record.\n    # \"type\":\tThe type of the DNS record.\n    # \"data\":\tVariable data depending on record type. For example, the \"data\" value for an A record would be the IPv4 address to which the domain will be mapped. For a CAA record, it would contain the domain name of the CA being granted permission to issue certificates.\n    # \"priority\":\tThe priority for SRV and MX records.\n    # \"port\":\tThe port for SRV records.\n    # \"ttl\": This value is the time to live for the record, in seconds. This defines the time frame that clients can cache queried information before a refresh should be requested.\n    # \"weight\":\tThe weight for SRV records.\n    # \"flags\": An unsigned integer between 0-255 used for CAA records.\n    # \"tag\": The parameter tag for CAA records.\n}",
        "description": "Get information on a DNS record. This data source provides the name, TTL, and zone\nfile as configured on your DigitalOcean account. This is useful if the record\nin question is not managed by Terraform. An error is triggered if the provided domain name or record are not managed with\nyour DigitalOcean account.",
        "prefix": "do-datasource-record"
    },
    "do-datasource-ssh-key": {
        "body": "data \"digitalocean_ssh_key\" \"$1\" {\n    # name - (Required) The name of the ssh key.\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\": The ID of the ssh key.\n    # \"public_key\": The public key of the ssh key.\n    # \"fingerprint\": The fingerprint of the public key of the ssh key.\n}",
        "description": "Get information on a ssh key. This data source provides the name, public key,\nand fingerprint as configured on your DigitalOcean account. This is useful if\nthe ssh key in question is not managed by Terraform or you need to utilize any\nof the keys data. An error is triggered if the provided ssh key name does not exist.",
        "prefix": "do-datasource-ssh-key"
    },
    "do-datasource-tag": {
        "body": "data \"digitalocean_tag\" \"$1\" {\n    # name - (Required) The name of the tag.\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\": The ID of the tag.\n}",
        "description": "Get information on a tag. This data source provides the name as configured on\nyour DigitalOcean account. This is useful if the tag name in question is not\nmanaged by Terraform or you need validate if the tag exists in the account. An error is triggered if the provided tag name does not exist.",
        "prefix": "do-datasource-tag"
    },
    "do-datasource-volume": {
        "body": "data \"digitalocean_volume\" \"$1\" {\n    # name - (Required) The name of block storage volume.\n    name = \"\"\n\n    # region - (Optional) The region the block storage volume is provisioned in.\n    region = \"\"\n\n    # Exported Attributes\n    # \"id\": The ID of the block storage volume.\n    # \"size\" - The size of the block storage volume in GiB.\n    # \"description\" - Text describing a block storage volume.\n    # \"filesystem_type\" - Filesystem type currently in-use on the block storage volume.\n    # \"filesystem_label\" - Filesystem label currently in-use on the block storage volume.\n    # \"droplet_ids\" - A list of associated Droplet ids.\n}",
        "description": "Get information on a volume for use in other resources. This data source provides\nall of the volumes properties as configured on your DigitalOcean account. This is\nuseful if the volume in question is not managed by Terraform or you need to utilize\nany of the volumes data. An error is triggered if the provided volume name does not exist.",
        "prefix": "do-datasource-volume"
    },
    "do-datasource-volume-snapshot": {
        "body": "data \"digitalocean_volume_snapshot\" \"$1\" {\n    # name - (Optional) The name of the volume snapshot.\n    name = \"\"\n\n    # name_regex - (Optional) A regex string to apply to the volume snapshot list returned by DigitalOcean. This allows more advanced filtering not supported from the DigitalOcean API. This filtering is done locally on what DigitalOcean returns.\n    name_regex = \"\"\n\n    # region - (Optional) A \"slug\" representing a DigitalOcean region (e.g. `nyc1`). If set, only volume snapshots available in the region will be returned.\n    region = \"\"\n\n    # most_recent - (Optional) If more than one result is returned, use the most recent volume snapshot.\n    most_recent = \"\"\n\n    # Exported Attributes\n    # \"id\" The ID of the volume snapshot.\n    # \"most_recent\" - (Optional) If more than one result is returned, use the most recent volume snapshot.\n    # \"created_at\" - The date and time the volume snapshot was created.\n    # \"most_recent\" - (Optional) If more than one result is returned, use the most recent volume snapshot.\n    # \"min_disk_size\" - The minimum size in gigabytes required for a volume to be created based on this volume snapshot.\n    # \"most_recent\" - (Optional) If more than one result is returned, use the most recent volume snapshot.\n    # \"regions\" - A list of DigitalOcean region \"slugs\" indicating where the volume snapshot is available.\n    # \"most_recent\" - (Optional) If more than one result is returned, use the most recent volume snapshot.\n    # \"volume_id\" - The ID of the volume from which the volume snapshot originated.\n    # \"most_recent\" - (Optional) If more than one result is returned, use the most recent volume snapshot.\n    # \"size\" - The billable size of the volume snapshot in gigabytes.\n    # \"most_recent\" - (Optional) If more than one result is returned, use the most recent volume snapshot.\n}",
        "description": "Volume snapshots are saved instances of a block storage volume. Use this data\nsource to retrieve the ID of a DigitalOcean volume snapshot for use in other\nresources.",
        "prefix": "do-datasource-volume-snapshot"
    },
    "do-resource-certificate": {
        "body": "resource \"digitalocean_certificate\" \"$1\" {\n    # name - (Required) The name of the certificate for identification.\n    name = \"\"\n\n    # type - (Optional) The type of certificate to provision. Can be either\n    type = \"\"\n\n    # custom - (Optional) `custom` or `lets_encrypt`. Defaults to `custom`.\n    custom = \"\"\n\n    # private_key - (Optional) The contents of a PEM-formatted private-key\n    private_key = \"\"\n\n    # leaf_certificate - (Optional) The contents of a PEM-formatted public\n    leaf_certificate = \"\"\n\n    # certificate_chain - (Optional) The full PEM-formatted trust chain\n    certificate_chain = \"\"\n\n    # domains - (Optional) List of fully qualified domain names (FQDNs) for\n    domains = \"\"\n\n    # Exported Attributes\n    # \"id\" - The unique ID of the certificate\n    # \"name\" - The name of the certificate\n    # \"not_after\" - The expiration date of the certificate\n    # \"sha1_fingerprint\" - The SHA-1 fingerprint of the certificate\n}",
        "description": "Provides a DigitalOcean Certificate resource that allows you to manage\ncertificates for configuring TLS termination in Load Balancers.\nCertificates created with this resource can be referenced in your\nLoad Balancer configuration via their ID. The certificate can either\nbe a custom one provided by you or automatically generated one with\nLet's Encrypt.",
        "prefix": "do-resource-certificate"
    },
    "do-resource-domain": {
        "body": "resource \"digitalocean_domain\" \"$1\" {\n    # name - (Required) The name of the domain\n    name = \"\"\n\n    # ip_address - (Optional) The IP address of the domain. If specified, this IP\n    ip_address = \"\"\n\n    # Exported Attributes\n    # \"id\" - The name of the domain\n}",
        "description": "Provides a DigitalOcean domain resource.",
        "prefix": "do-resource-domain"
    },
    "do-resource-droplet": {
        "body": "resource \"digitalocean_droplet\" \"$1\" {\n    # size - (Required) The unique slug that indentifies the type of Droplet. You can find a list of available slugs on [DigitalOcean API documentation](https://developers.digitalocean.com/documentation/v2/#list-all-sizes).\n    size = \"\"\n\n    # region - (Required) The region to start in.\n    region = \"\"\n\n    # name - (Required) The Droplet name.\n    name = \"\"\n\n    # image - (Required) The Droplet image ID or slug.\n    image = \"\"\n\n    # backups - (Optional) Boolean controlling if backups are made. Defaults to\n    backups = \"\"\n\n    # monitoring - (Optional) Boolean controlling whether monitoring agent is installed.\n    monitoring = \"\"\n\n    # private_networking - (Optional) Boolean controlling if private networks are\n    private_networking = \"\"\n\n    # ssh_keys - (Optional) A list of SSH IDs or fingerprints to enable in\n    ssh_keys = \"\"\n\n    # resize_disk - (Optional) Boolean controlling whether to increase the disk\n    resize_disk = \"\"\n\n    # tags - (Optional) A list of the tags to label this Droplet. A tag resource\n    tags = \"\"\n\n    # user_data - (Optional) - A string of the desired User Data for the Droplet.\n    user_data = \"\"\n\n    # volume_ids - (Optional) - A list of the IDs of each [block storage volume](/docs/providers/do/r/volume.html) to be attached to the Droplet.\n    volume_ids = \"\"\n\n    # Exported Attributes\n    # \"id\" - The ID of the Droplet\n    # \"name\"- The name of the Droplet\n    # \"region\" - The region of the Droplet\n    # \"image\" - The image of the Droplet\n    # \"ipv6\" - Is IPv6 enabled\n    # \"ipv6_address\" - The IPv6 address\n    # \"ipv6_address_private\" - The private networking IPv6 address\n    # \"ipv4_address\" - The IPv4 address\n    # \"ipv4_address_private\" - The private networking IPv4 address\n    # \"locked\" - Is the Droplet locked\n    # \"private_networking\" - Is private networking enabled\n    # \"price_hourly\" - Droplet hourly price\n    # \"price_monthly\" - Droplet monthly price\n    # \"size\" - The instance size\n    # \"disk\" - The size of the instance's disk in GB\n    # \"vcpus\" - The number of the instance's virtual CPUs\n    # \"status\" - The status of the Droplet\n    # \"tags\" - The tags associated with the Droplet\n    # \"volume_ids\" - A list of the attached block storage volumes\n}",
        "description": "Provides a DigitalOcean Droplet resource. This can be used to create,\nmodify, and delete Droplets. Droplets also support\n[provisioning](/docs/provisioners/index.html).",
        "prefix": "do-resource-droplet"
    },
    "do-resource-droplet-snapshot": {
        "body": "resource \"digitalocean_droplet_snapshot\" \"$1\" {\n    # droplet_id - (Required) The ID of the Droplet from which the snapshot will be taken.\n    droplet_id = \"\"\n\n    # name - (Required) A name for the Droplet snapshot.\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\" The ID of the Droplet snapshot.\n    # \"created_at\" - The date and time the Droplet snapshot was created.\n    # \"min_disk_size\" - The minimum size in gigabytes required for a Droplet to be created based on this snapshot.\n    # \"regions\" - A list of DigitalOcean region \"slugs\" indicating where the droplet snapshot is available.\n    # \"size\" - The billable size of the Droplet snapshot in gigabytes.\n}",
        "description": "Provides a resource which can be used to create a snapshot from an existing DigitalOcean Droplet.",
        "prefix": "do-resource-droplet-snapshot"
    },
    "do-resource-firewall": {
        "body": "resource \"digitalocean_firewall\" \"$1\" {\n    # protocol - (Required) The type of traffic to be allowed.\n    protocol = \"\"\n\n    # protocol - (Required) The type of traffic to be allowed.\n    protocol = \"\"\n\n    # name - (Required) The Firewall name\n    name = \"\"\n\n    # droplet_ids - (Optional) - The list of the IDs of the Droplets assigned\n    droplet_ids = \"\"\n\n    # tags - (Optional) - The names of the Tags assigned to the Firewall.\n    tags = \"\"\n\n    # inbound_rule - (Optional) The inbound access rule block for the Firewall.\n    inbound_rule = \"\"\n\n    # outbound_rule - (Optional) The outbound access rule block for the Firewall.\n    outbound_rule = \"\"\n\n    # inbound_rule - (Optional) `inbound_rule` supports the following:\n    inbound_rule = \"\"\n\n    # port_range - (Optional) The ports on which traffic will be allowed\n    port_range = \"\"\n\n    # tcp - (Optional) `tcp` or `udp`.\n    tcp = \"\"\n\n    # source_addresses - (Optional) An array of strings containing the IPv4\n    source_addresses = \"\"\n\n    # source_droplet_ids - (Optional) An array containing the IDs of\n    source_droplet_ids = \"\"\n\n    # source_tags - (Optional) An array containing the names of Tags\n    source_tags = \"\"\n\n    # source_load_balancer_uids - (Optional) An array containing the IDs\n    source_load_balancer_uids = \"\"\n\n    # outbound_rule - (Optional) `outbound_rule` supports the following:\n    outbound_rule = \"\"\n\n    # port_range - (Optional) The ports on which traffic will be allowed\n    port_range = \"\"\n\n    # tcp - (Optional) `tcp` or `udp`.\n    tcp = \"\"\n\n    # destination_addresses - (Optional) An array of strings containing the IPv4\n    destination_addresses = \"\"\n\n    # destination_droplet_ids - (Optional) An array containing the IDs of\n    destination_droplet_ids = \"\"\n\n    # destination_tags - (Optional) An array containing the names of Tags\n    destination_tags = \"\"\n\n    # destination_load_balancer_uids - (Optional) An array containing the IDs\n    destination_load_balancer_uids = \"\"\n\n    # Exported Attributes\n    # \"id\" - A unique ID that can be used to identify and reference a Firewall.\n    # \"status\" - A status string indicating the current state of the Firewall.\n    # \"created_at\" - A time value given in ISO8601 combined date and time format\n    # \"pending_changes\" - An list of object containing the fields, \"droplet_id\",\n    # \"name\" - The name of the Firewall.\n    # \"droplet_ids\" - The list of the IDs of the Droplets assigned to\n    # \"tags\" - The names of the Tags assigned to the Firewall.\n    # \"inbound_rules\" - The inbound access rule block for the Firewall.\n    # \"outbound_rules\" - The outbound access rule block for the Firewall.\n}",
        "description": "Provides a DigitalOcean Cloud Firewall resource. This can be used to create,\nmodify, and delete Firewalls.",
        "prefix": "do-resource-firewall"
    },
    "do-resource-floating-ip": {
        "body": "resource \"digitalocean_floating_ip\" \"$1\" {\n    # region - (Required) The region that the Floating IP is reserved to.\n    region = \"\"\n\n    # droplet_id - (Optional) The ID of Droplet that the Floating IP will be assigned to.\n    droplet_id = \"\"\n\n    # Exported Attributes\n    # \"ip_address\" - The IP Address of the resource\n}",
        "description": "Provides a DigitalOcean Floating IP to represent a publicly-accessible static IP addresses that can be mapped to one of your Droplets. ~> **NOTE:** Floating IPs can be assigned to a Droplet either directly on the `digitalocean_floating_ip` resource by setting a `droplet_id` or using the `digitalocean_floating_ip_assignment` resource, but the two cannot be used together.",
        "prefix": "do-resource-floating-ip"
    },
    "do-resource-floating-ip-assignment": {
        "body": "resource \"digitalocean_floating_ip_assignment\" \"$1\" {\n    # ip_address - (Required) The Floating IP to assign to the Droplet.\n    ip_address = \"\"\n\n    # droplet_id - (Optional) The ID of Droplet that the Floating IP will be assigned to.\n    droplet_id = \"\"\n\n    # Exported Attributes\n}",
        "description": "Provides a resource for assigning an existing DigitalOcean Floating IP to a Droplet. This\nmakes it easy to provision floating IP addresses that are not tied to the lifecycle of your\nDroplet.",
        "prefix": "do-resource-floating-ip-assignment"
    },
    "do-resource-kubernetes-cluster": {
        "body": "resource \"digitalocean_kubernetes_cluster\" \"$1\" {\n    # node_count - (Required) The number of Droplet instances in the node pool.\n    node_count = \"\"\n\n    # size - (Required) The slug identifier for the type of Droplet to be used as workers in the node pool.\n    size = \"\"\n\n    # name - (Required) A name for the node pool.\n    name = \"\"\n\n    # node_pool - (Required) A block representing the cluster's default node pool. Additional node pools may be added to the cluster using the `digitalocean_kubernetes_node_pool` resource. The following arguments may be specified:\n    node_pool = \"\"\n\n    # version - (Required) The slug identifier for the version of Kubernetes used for the cluster.\n    version = \"\"\n\n    # region - (Required) The slug identifier for the region where the Kubernetes cluster will be created.\n    region = \"\"\n\n    # name - (Required) A name for the Kubernetes cluster.\n    name = \"\"\n\n    # tags - (Optional) A list of tag names to be applied to the Kubernetes cluster.\n    tags = \"\"\n\n    # tags - (Optional) A list of tag names to be applied to the Kubernetes cluster.\n    tags = \"\"\n\n    # Exported Attributes\n    # \"id\" - A unique ID that can be used to identify and reference a Kubernetes cluster.\n    # \"cluster_subnet\" - The range of IP addresses in the overlay network of the Kubernetes cluster.\n    # \"service_subnet\" - The range of assignable IP addresses for services running in the Kubernetes cluster.\n    # \"ipv4_address\" - The public IPv4 address of the Kubernetes master node.\n    # \"endpoint\" - The base URL of the API server on the Kubernetes master node.\n    # \"status\" -  A string indicating the current status of the cluster. Potential values include running, provisioning, and errored.\n    # \"created_at\" - The date and time when the Kubernetes cluster was created.\n    # \"updated_at\" - The date and time when the Kubernetes cluster was last updated.\n    # \"kube_config.0\" - A representation of the Kubernetes cluster's kubeconfig with the following attributes:\n    # \"raw_config\" - The full contents of the Kubernetes cluster's kubeconfig file.\n    # \"host\" - The URL of the API server on the Kubernetes master node.\n    # \"client_key\" - The base64 encoded private key used by clients to access the cluster.\n    # \"client_certificate\" - The base64 encoded public certificate used by clients to access the cluster.\n    # \"cluster_ca_certificate\" - The base64 encoded public certificate for the cluster's certificate authority.\n    # \"node_pool\" - In addition to the arguments provided, these additional attributes about the cluster's default node pool are exported:\n    # \"id\" -  A unique ID that can be used to identify and reference the node pool.\n    # \"nodes\" - A list of nodes in the pool. Each node exports the following attributes:\n    # \"id\" -  A unique ID that can be used to identify and reference the node.\n    # \"name\" - The auto-generated name for the node.\n    # \"status\" -  A string indicating the current status of the individual node.\n    # \"created_at\" - The date and time when the node was created.\n    # \"updated_at\" - The date and time when the node was last updated.\n}",
        "description": "~> **NOTE:** DigitalOcean Kubernetes is currently in [Limited Availability](https://www.digitalocean.com/docs/platform/product-lifecycle/). In order to access its API, you must first by enable Kubernetes on your account by opting-in via the [cloud control panel](https://cloud.digitalocean.com/kubernetes/clusters). While the Kubernetes Cluster functionality is currently in limited availability the structure of this resource may change over time. Please share any feedback you may have by [opening an issue on GitHub](https://github.com/terraform-providers/terraform-provider-digitalocean/issues). Provides a DigitalOcean Kubernetes cluster resource. This can be used to create, delete, and modify clusters. For more information see the [official documentation](https://www.digitalocean.com/docs/kubernetes/).",
        "prefix": "do-resource-kubernetes-cluster"
    },
    "do-resource-kubernetes-node-pool": {
        "body": "resource \"digitalocean_kubernetes_node_pool\" \"$1\" {\n    # node_count - (Required) The number of Droplet instances in the node pool.\n    node_count = \"\"\n\n    # size - (Required) The slug identifier for the type of Droplet to be used as workers in the node pool.\n    size = \"\"\n\n    # name - (Required) A name for the node pool.\n    name = \"\"\n\n    # cluster_id - (Required) The ID of the Kubernetes cluster to which the node pool is associated.\n    cluster_id = \"\"\n\n    # tags - (Optional) A list of tag names to be applied to the Kubernetes cluster.\n    tags = \"\"\n\n    # Exported Attributes\n    # \"id\" -  A unique ID that can be used to identify and reference the node pool.\n    # \"nodes\" - A list of nodes in the pool. Each node exports the following attributes:\n    # \"id\" -  A unique ID that can be used to identify and reference the node.\n    # \"name\" - The auto-generated name for the node.\n    # \"status\" -  A string indicating the current status of the individual node.\n    # \"created_at\" - The date and time when the node was created.\n    # \"updated_at\" - The date and time when the node was last updated.\n}",
        "description": "~> **NOTE:** DigitalOcean Kubernetes is currently in [Limited Availability](https://www.digitalocean.com/docs/platform/product-lifecycle/). In order to access its API, you must first by enable Kubernetes on your account by opting-in via the [cloud control panel](https://cloud.digitalocean.com/kubernetes/clusters). While the Kubernetes Cluster functionality is currently in limited availability the structure of this resource may change over time. Please share any feedback you may have by [opening an issue on GitHub](https://github.com/terraform-providers/terraform-provider-digitalocean/issues). Provides a DigitalOcean Kubernetes node pool resource. While the default node pool must be defined in the `digitalocean_kubernetes_cluster` resource, this resource can be used to add additional ones to a cluster.",
        "prefix": "do-resource-kubernetes-node-pool"
    },
    "do-resource-loadbalancer": {
        "body": "resource \"digitalocean_loadbalancer\" \"$1\" {\n    # protocol - (Required) The protocol used for health checks sent to the backend Droplets. The possible values are `http` or `tcp`.\n    protocol = \"\"\n\n    # type - (Required) An attribute indicating how and if requests from a client will be persistently served by the same backend Droplet. The possible values are `cookies` or `none`. If not specified, the default value is `none`.\n    type = \"\"\n\n    # target_port - (Required) An integer representing the port on the backend Droplets to which the Load Balancer will send traffic.\n    target_port = \"\"\n\n    # target_protocol - (Required) The protocol used for traffic from the Load Balancer to the backend Droplets. The possible values are: `http`, `https`, or `tcp`.\n    target_protocol = \"\"\n\n    # entry_port - (Required) An integer representing the port on which the Load Balancer instance will listen.\n    entry_port = \"\"\n\n    # entry_protocol - (Required) The protocol used for traffic to the Load Balancer. The possible values are: `http`, `https`, or `tcp`.\n    entry_protocol = \"\"\n\n    # forwarding_rule - (Required) A list of `forwarding_rule` to be assigned to the\n    forwarding_rule = \"\"\n\n    # region - (Required) The region to start in\n    region = \"\"\n\n    # name - (Required) The Load Balancer name\n    name = \"\"\n\n    # algorithm - (Optional) The load balancing algorithm used to determine\n    algorithm = \"\"\n\n    # healthcheck - (Optional) A `healthcheck` block to be assigned to the\n    healthcheck = \"\"\n\n    # sticky_sessions - (Optional) A `sticky_sessions` block to be assigned to the\n    sticky_sessions = \"\"\n\n    # redirect_http_to_https - (Optional) A boolean value indicating whether\n    redirect_http_to_https = \"\"\n\n    # droplet_ids - (Optional) - A list of the IDs of each droplet to be attached to the Load Balancer.\n    droplet_ids = \"\"\n\n    # droplet_tag - (Optional) - The name of a Droplet tag corresponding to Droplets to be assigned to the Load Balancer.\n    droplet_tag = \"\"\n\n    # forwarding_rule - (Optional) `forwarding_rule` supports the following:\n    forwarding_rule = \"\"\n\n    # certificate_id - (Optional) The ID of the TLS certificate to be used for SSL termination.\n    certificate_id = \"\"\n\n    # tls_passthrough - (Optional) A boolean value indicating whether SSL encrypted traffic will be passed through to the backend Droplets. The default value is `false`.\n    tls_passthrough = \"\"\n\n    # sticky_sessions - (Optional) `sticky_sessions` supports the following:\n    sticky_sessions = \"\"\n\n    # cookie_name - (Optional) The name to be used for the cookie sent to the client. This attribute is required when using `cookies` for the sticky sessions type.\n    cookie_name = \"\"\n\n    # cookie_ttl_seconds - (Optional) The number of seconds until the cookie set by the Load Balancer expires. This attribute is required when using `cookies` for the sticky sessions type.\n    cookie_ttl_seconds = \"\"\n\n    # healthcheck - (Optional) `healthcheck` supports the following:\n    healthcheck = \"\"\n\n    # port - (Optional) An integer representing the port on the backend Droplets on which the health check will attempt a connection.\n    port = \"\"\n\n    # path - (Optional) The path on the backend Droplets to which the Load Balancer instance will send a request.\n    path = \"\"\n\n    # check_interval_seconds - (Optional) The number of seconds between between two consecutive health checks. If not specified, the default value is `10`.\n    check_interval_seconds = \"\"\n\n    # response_timeout_seconds - (Optional) The number of seconds the Load Balancer instance will wait for a response until marking a health check as failed. If not specified, the default value is `5`.\n    response_timeout_seconds = \"\"\n\n    # unhealthy_threshold - (Optional) The number of times a health check must fail for a backend Droplet to be marked \"unhealthy\" and be removed from the pool. If not specified, the default value is `3`.\n    unhealthy_threshold = \"\"\n\n    # healthy_threshold - (Optional) The number of times a health check must pass for a backend Droplet to be marked \"healthy\" and be re-added to the pool. If not specified, the default value is `5`.\n    healthy_threshold = \"\"\n\n    # Exported Attributes\n    # \"id\" - The ID of the Load Balancer\n    # \"ip\"- The ip of the Load Balancer\n}",
        "description": "Provides a DigitalOcean Load Balancer resource. This can be used to create,\nmodify, and delete Load Balancers.",
        "prefix": "do-resource-loadbalancer"
    },
    "do-resource-record": {
        "body": "resource \"digitalocean_record\" \"$1\" {\n    # name - (Required) The name of the record.\n    name = \"\"\n\n    # value - (Required) The value of the record.\n    value = \"\"\n\n    # domain - (Required) The domain to add the record to.\n    domain = \"\"\n\n    # type - (Required) The type of record. Must be one of `A`, `AAAA`, `CAA`, `CNAME`, `MX`, `NS`, `TXT`, or `SRV`.\n    type = \"\"\n\n    # port - (Optional) The port of the record. Only valid when type is `SRV`.  Must be between 1 and 65535.\n    port = \"\"\n\n    # priority - (Optional) The priority of the record. Only valid when type is `MX` or `SRV`. Must be between 0 and 65535.\n    priority = \"\"\n\n    # weight - (Optional) The weight of the record. Only valid when type is `SRV`.  Must be between 0 and 65535.\n    weight = \"\"\n\n    # ttl - (Optional) The time to live for the record, in seconds. Must be at least 0.\n    ttl = \"\"\n\n    # flags - (Optional) The flags of the record. Only valid when type is `CAA`. Must be between 0 and 255.\n    flags = \"\"\n\n    # tag - (Optional) The tag of the record. Only valid when type is `CAA`. Must be one of `issue`, `wildissue`, or `iodef`.\n    tag = \"\"\n\n    # Exported Attributes\n    # \"id\" - The record ID\n    # \"fqdn\" - The FQDN of the record\n}",
        "description": "Provides a DigitalOcean DNS record resource.",
        "prefix": "do-resource-record"
    },
    "do-resource-ssh-key": {
        "body": "resource \"digitalocean_ssh_key\" \"$1\" {\n    # public_key - (Required) The public key. If this is a file, it\n    public_key = \"\"\n\n    # name - (Required) The name of the SSH key for identification\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\" - The unique ID of the key\n    # \"name\" - The name of the SSH key\n    # \"public_key\" - The text of the public key\n    # \"fingerprint\" - The fingerprint of the SSH key\n}",
        "description": "Provides a DigitalOcean SSH key resource to allow you to manage SSH\nkeys for Droplet access. Keys created with this resource\ncan be referenced in your Droplet configuration via their ID or\nfingerprint.",
        "prefix": "do-resource-ssh-key"
    },
    "do-resource-tag": {
        "body": "resource \"digitalocean_tag\" \"$1\" {\n    # name - (Required) The name of the tag\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\" - The id of the tag\n    # \"name\" - The name of the tag\n}",
        "description": "Provides a DigitalOcean Tag resource. A Tag is a label that can be applied to a\nDroplet resource in order to better organize or facilitate the lookups and\nactions on it. Tags created with this resource can be referenced in your Droplet\nconfiguration via their ID or name.",
        "prefix": "do-resource-tag"
    },
    "do-resource-volume": {
        "body": "resource \"digitalocean_volume\" \"$1\" {\n    # size - (Required) The size of the block storage volume in GiB. If updated, can only be expanded.\n    size = \"\"\n\n    # name - (Required) A name for the block storage volume. Must be lowercase and be composed only of numbers, letters and \"-\", up to a limit of 64 characters.\n    name = \"\"\n\n    # region - (Required) The region that the block storage volume will be created in.\n    region = \"\"\n\n    # description - (Optional) A free-form text field up to a limit of 1024 bytes to describe a block storage volume.\n    description = \"\"\n\n    # snapshot_id - (Optional) The ID of an existing volume snapshot from which the new volume will be created. If supplied, the region and size will be limitied on creation to that of the referenced snapshot\n    snapshot_id = \"\"\n\n    # initial_filesystem_type - (Optional) Initial filesystem type (`xfs` or `ext4`) for the block storage volume.\n    initial_filesystem_type = \"\"\n\n    # initial_filesystem_label - (Optional) Initial filesystem label for the block storage volume.\n    initial_filesystem_label = \"\"\n\n    # Exported Attributes\n    # \"id\" - The unique identifier for the block storage volume.\n    # \"filesystem_type\" - Filesystem type (\"xfs\" or \"ext4\") for the block storage volume.\n    # \"filesystem_label\" - Filesystem label for the block storage volume.\n    # \"droplet_ids\" - A list of associated droplet ids.\n}",
        "description": "Provides a DigitalOcean Block Storage volume which can be attached to a Droplet in order to provide expanded storage.",
        "prefix": "do-resource-volume"
    },
    "do-resource-volume-attachment": {
        "body": "resource \"digitalocean_volume_attachment\" \"$1\" {\n    # volume_id - (Required) ID of the Volume to be attached to the Droplet.\n    volume_id = \"\"\n\n    # droplet_id - (Required) ID of the Droplet to attach the volume to.\n    droplet_id = \"\"\n\n    # Exported Attributes\n    # \"id\" - The unique identifier for the volume attachment.\n}",
        "description": "Manages attaching a Volume to a Droplet. ~> **NOTE:** Volumes can be attached either directly on the `digitalocean_droplet` resource, or using the `digitalocean_volume_attachment` resource - but the two cannot be used together. If both are used against the same Droplet, the volume attachments will constantly drift.",
        "prefix": "do-resource-volume-attachment"
    },
    "do-resource-volume-snapshot": {
        "body": "resource \"digitalocean_volume_snapshot\" \"$1\" {\n    # volume_id - (Required) The ID of the volume from which the volume snapshot originated.\n    volume_id = \"\"\n\n    # name - (Required) A name for the volume snapshot.\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\" The ID of the volume snapshot.\n    # \"created_at\" - The date and time the volume snapshot was created.\n    # \"min_disk_size\" - The minimum size in gigabytes required for a volume to be created based on this volume snapshot.\n    # \"regions\" - A list of DigitalOcean region \"slugs\" indicating where the volume snapshot is available.\n    # \"size\" - The billable size of the volume snapshot in gigabytes.\n}",
        "description": "Provides a DigitalOcean Volume Snapshot which can be used to create a snapshot from an existing volume.",
        "prefix": "do-resource-volume-snapshot"
    }
}