{
    "librato-resource-alert": {
        "body": "resource \"librato_alert\" \"$1\" {\n    # description - (Required) Description of the alert.\n    description = \"\"\n\n    # name - (Required) The name of the alert.\n    name = \"\"\n\n    # active - (Optional) whether the alert is active (can be triggered). Defaults to true.\n    active = \"\"\n\n    # rearm_seconds - (Optional) minimum amount of time between sending alert notifications, in seconds.\n    rearm_seconds = \"\"\n\n    # services - (Optional) list of notification service IDs.\n    services = \"\"\n\n    # condition - (Optional) A trigger condition for the alert. Conditions documented below.\n    condition = \"\"\n\n    # attributes - (Optional) A hash of additional attribtues for the alert. Attributes documented below.\n    attributes = \"\"\n\n    # Exported Attributes\n    # \"id\" - The ID of the alert.\n    # \"name\" - The name of the alert.\n    # \"description\" - (Required) Description of the alert.\n    # \"active\" - whether the alert is active (can be triggered). Defaults to true.\n    # \"rearm_seconds\" - minimum amount of time between sending alert notifications, in seconds.\n    # \"services\" - list of notification service IDs.\n    # \"condition\" - A trigger condition for the alert. Conditions documented below.\n    # \"type\" - The type of condition. Must be one of \"above\", \"below\" or \"absent\".\n    # \"metric_name\"- The name of the metric this alert condition applies to.\n    # \"source\"- A source expression which identifies which sources for the given metric to monitor.\n    # \"detect_reset\" - boolean: toggles the method used to calculate the delta from the previous sample when the summary_function is \"derivative\".\n    # \"duration\" - number of seconds condition must be true to fire the alert (required for type \"absent\").\n    # \"threshold\" - float: measurements over this number will fire the alert (only for \"above\" or \"below\").\n    # \"summary_function\" - Indicates which statistic of an aggregated measurement to alert on. ((only for \"above\" or \"below\").\n    # \"runbook_url\" - a URL for the runbook to be followed when this alert is firing. Used in the Librato UI if set.\n}",
        "description": "Provides a Librato Alert resource. This can be used to\ncreate and manage alerts on Librato.",
        "prefix": "librato-resource-alert"
    },
    "librato-resource-metric": {
        "body": "resource \"librato_metric\" \"$1\" {\n    # name - (Required) The unique identifier of the metric.\n    name = \"\"\n\n    # type - (Required) The type of metric to create (gauge, counter, or composite).\n    type = \"\"\n\n    # display_name - (Optional) The name which will be used for the metric when viewing the Metrics website.\n    display_name = \"\"\n\n    # description - (Optional) Text that can be used to explain precisely what the metric is measuring.\n    description = \"\"\n\n    # period - (Optional) Number of seconds that is the standard reporting period of the metric.\n    period = \"\"\n\n    # attributes - (Optional) The attributes hash configures specific components of a metric’s visualization.\n    attributes = \"\"\n\n    # composite - (Optional) The definition of the composite metric.\n    composite = \"\"\n\n    # Exported Attributes\n    # \"name\" - The identifier for the metric.\n    # \"display_name\" - The name which will be used for the metric when viewing the Metrics website.\n    # \"type\" - The type of metric to create (gauge, counter, or composite).\n    # \"description\" - Text that describes precisely what the metric is measuring.\n    # \"period\" - Number of seconds that is the standard reporting period of the metric. Setting the period enables Metrics to detect abnormal interruptions in reporting and aids in analytics. For gauge metrics that have service-side aggregation enabled, this option will define the period that aggregation occurs on.\n    # \"source_lag\" -\n    # \"composite\" - The composite definition. Only used when type is composite.\n    # \"color\" - Sets a default color to prefer when visually rendering the metric. Must be a seven character string that represents the hex code of the color e.g. #52D74C.\n    # \"display_max\" - If a metric has a known theoretical maximum value, set display_max so that visualizations can provide perspective of the current values relative to the maximum value.\n    # \"display_min\" - If a metric has a known theoretical minimum value, set display_min so that visualizations can provide perspective of the current values relative to the minimum value.\n    # \"display_units_long\" - A string that identifies the unit of measurement e.g. Microseconds. Typically the long form of display_units_short and used in visualizations e.g. the Y-axis label on a graph.\n    # \"display_units_short\" -\tA terse (usually abbreviated) string that identifies the unit of measurement e.g. uS (Microseconds). Typically the short form of display_units_long and used in visualizations e.g. the tooltip for a point on a graph.\n    # \"display_stacked\" -\tA boolean value indicating whether or not multiple metric streams should be aggregated in a visualization (e.g. stacked graphs). By default counters have display_stacked enabled while gauges have it disabled.\n    # \"summarize_function\" -\tDetermines how to calculate values when rolling up from raw values to higher resolution intervals. Must be one of: ‘average’, 'sum’, 'count’, 'min’, 'max’. If summarize_function is not set the behavior defaults to average.\n    # \"aggregate\"\t- Enable service-side aggregation for this metric. When enabled, measurements sent using the same tag set will be aggregated into single measurements on an interval defined by the period of the metric. If there is no period defined for the metric then all measurements will be aggregated on a 60-second interval.\n}",
        "description": "Provides a Librato Metric resource. This can be used to create and manage metrics on Librato.",
        "prefix": "librato-resource-metric"
    },
    "librato-resource-service": {
        "body": "resource \"librato_service\" \"$1\" {\n    # settings - (Required) a JSON hash of settings specific to the alert type.\n    settings = \"\"\n\n    # title - (Required) The alert title.\n    title = \"\"\n\n    # type - (Required) The type of notificaion.\n    type = \"\"\n\n    # Exported Attributes\n    # \"id\" - The ID of the alert.\n    # \"type\" - The type of notificaion.\n    # \"title\" - The alert title.\n    # \"settings\" - a JSON hash of settings specific to the alert type.\n}",
        "description": "Provides a Librato Service resource. This can be used to\ncreate and manage notification services on Librato.",
        "prefix": "librato-resource-service"
    },
    "librato-resource-space": {
        "body": "resource \"librato_space\" \"$1\" {\n    # name - (Required) The name of the space.\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\" - The ID of the space.\n    # \"name\" - The name of the space.\n}",
        "description": "Provides a Librato Space resource. This can be used to\ncreate and manage spaces on Librato.",
        "prefix": "librato-resource-space"
    },
    "librato-resource-space-chart": {
        "body": "resource \"librato_space_chart\" \"$1\" {\n    # composite - (Required) A composite metric query string to execute when this\n    composite = \"\"\n\n    # group_function - (Required) How to process the results when multiple sources\n    group_function = \"\"\n\n    # source - (Required) The name of a source, or `*` to include all sources.\n    source = \"\"\n\n    # metric - (Required) The name of the metric. May not be specified if\n    metric = \"\"\n\n    # name - (Required) The title of the chart when it is displayed.\n    name = \"\"\n\n    # space_id - (Required) The ID of the space this chart should be in.\n    space_id = \"\"\n\n    # type - (Optional) Indicates the type of chart. Must be one of line or\n    type = \"\"\n\n    # min - (Optional) The minimum display value of the chart's Y-axis.\n    min = \"\"\n\n    # max - (Optional) The maximum display value of the chart's Y-axis.\n    max = \"\"\n\n    # label - (Optional) The Y-axis label.\n    label = \"\"\n\n    # related_space - (Optional) The ID of another space to which this chart is\n    related_space = \"\"\n\n    # stream - (Optional) Nested block describing a metric to use for data in the\n    stream = \"\"\n\n    # composite - (Optional) `composite` is specified.\n    composite = \"\"\n\n    # group_function - (Optional) `group_function` is specified.\n    group_function = \"\"\n\n    # summary_function - (Optional) When visualizing complex measurements or a\n    summary_function = \"\"\n\n    # name - (Optional) A display name to use for the stream when generating the\n    name = \"\"\n\n    # color - (Optional) Sets a color to use when rendering the stream. Must be a\n    color = \"\"\n\n    # units_short - (Optional) Unit value string to use as the tooltip label.\n    units_short = \"\"\n\n    # units_long - (Optional) String value to set as they Y-axis label. All\n    units_long = \"\"\n\n    # min - (Optional) Theoretical minimum Y-axis value.\n    min = \"\"\n\n    # max - (Optional) Theoretical maximum Y-axis value.\n    max = \"\"\n\n    # transform_function - (Optional) Linear formula to run on each measurement\n    transform_function = \"\"\n\n    # period - (Optional) An integer value of seconds that defines the period this\n    period = \"\"\n\n    # Exported Attributes\n    # \"id\" - The ID of the chart.\n    # \"space_id\" - The ID of the space this chart should be in.\n    # \"title\" - The title of the chart when it is displayed.\n}",
        "description": "Provides a Librato Space Chart resource. This can be used to\ncreate and manage charts in Librato Spaces.",
        "prefix": "librato-resource-space-chart"
    }
}