{
    "packet-resource-device": {
        "body": "resource \"packet_device\" \"$1\" {\n    # billing_cycle - (Required) monthly or hourly\n    billing_cycle = \"\"\n\n    # plan - (Required) The hardware config slug\n    plan = \"\"\n\n    # facility - (Required) The facility in which to create the device\n    facility = \"\"\n\n    # operating_system - (Required) The operating system slug\n    operating_system = \"\"\n\n    # project_id - (Required) The id of the project in which to create the device\n    project_id = \"\"\n\n    # hostname - (Required) The device name\n    hostname = \"\"\n\n    # user_data - (Optional) - A string of the desired User Data for the device.\n    user_data = \"\"\n\n    # ipxe_script_url - (Optional) - URL pointing to a hosted iPXE script. More\n    ipxe_script_url = \"\"\n\n    # always_pxe - (Optional) - If true, a device with OS `custom_ipxe` will\n    always_pxe = \"\"\n\n    # hardware_reservation_id - (Optional) - The id of hardware reservation where you want this device deployed, or `next-available` if you want to pick your next available reservation automatically.\n    hardware_reservation_id = \"\"\n\n    # Exported Attributes\n    # \"id\" - The ID of the device\n    # \"hostname\"- The hostname of the device\n    # \"project_id\"- The ID of the project the device belongs to\n    # \"facility\" - The facility the device is in\n    # \"plan\" - The hardware config of the device\n    # \"network\" - The device's private and public IP (v4 and v6) network details\n    # \"access_public_ipv6\" - The ipv6 maintenance IP assigned to the device\n    # \"access_public_ipv4\" - The ipv4 maintenance IP assigned to the device\n    # \"access_private_ipv4\" - The ipv4 private IP assigned to the device\n    # \"locked\" - Whether the device is locked\n    # \"billing_cycle\" - The billing cycle of the device (monthly or hourly)\n    # \"operating_system\" - The operating system running on the device\n    # \"state\" - The status of the device\n    # \"created\" - The timestamp for when the device was created\n    # \"updated\" - The timestamp for the last time the device was updated\n    # \"tags\" - Tags attached to the device\n    # \"hardware_reservation_id\" - The id of hardware reservation which this device occupies\n    # \"root_password\" - Root password to the server (disabled after 24 hours)\n}",
        "description": "Provides a Packet device resource. This can be used to create,\nmodify, and delete devices. ~> **Note:** All arguments including the root_password and user_data will be stored in\n the raw state as plain-text.\n[Read more about sensitive data in state](/docs/state/sensitive-data.html).",
        "prefix": "packet-resource-device"
    },
    "packet-resource-ip-attachment": {
        "body": "resource \"packet_ip_attachment\" \"$1\" {\n    # cidr_notation - (Required) CIDR notation of subnet from block reserved in the same\n    cidr_notation = \"\"\n\n    # device_id - (Required) ID of device to which to assign the subnet\n    device_id = \"\"\n\n    # Exported Attributes\n    # \"id\" - The unique ID of the assignment\n    # \"device_id\" - ID of device to which subnet is assigned\n    # \"cidr_notation\" - Assigned subnet in CIDR notation, e.g. \"147.229.15.30/31\"\n    # \"gateway\" - IP address of gateway for the subnet\n    # \"network\" - Subnet network address\n    # \"netmask\" - Subnet mask in decimal notation, e.g. \"255.255.255.0\"\n    # \"cidr\" - length of CIDR prefix of the subnet as integer\n    # \"address_family\" - Address family as integer (4 or 6)\n    # \"public\" - boolean flag whether subnet is reachable from the Internet\n}",
        "description": "Provides a resource to attach elastic IP subnets to devices. To attach an IP subnet from a reserved block to a provisioned device, you must derive a subnet CIDR belonging to\none of your reserved blocks in the same project and facility as the target device. For example, you have reserved IPv4 address block 147.229.10.152/30, you can choose to assign either the whole\nblock as one subnet to a device; or 2 subnets with CIDRs 147.229.10.152/31' and 147.229.10.154/31; or 4 subnets\nwith mask prefix length 32. More about the elastic IP subnets is [here](https://help.packet.net/technical/networking/elastic-ips). Device and reserved block must be in the same facility.",
        "prefix": "packet-resource-ip-attachment"
    },
    "packet-resource-project": {
        "body": "resource \"packet_project\" \"$1\" {\n    # name - (Required) The name of the Project on Packet.net\n    name = \"\"\n\n    # payment_method - (Optional) The unique ID of the payment method on file to use for services created\n    payment_method = \"\"\n\n    # Exported Attributes\n    # \"id\" - The unique ID of the project\n    # \"payment_method\" - The unique ID of the payment method on file to use for services created\n    # \"created\" - The timestamp for when the Project was created\n    # \"updated\" - The timestamp for the last time the Project was updated\n}",
        "description": "Provides a Packet Project resource to allow you manage devices\nin your projects.",
        "prefix": "packet-resource-project"
    },
    "packet-resource-resevered-ip-block": {
        "body": "resource \"packet_reserved_ip_block\" \"$1\" {\n    # quantity - (Required) The number of allocated /32 addresses, a power of 2\n    quantity = \"\"\n\n    # project_id - (Required) The packet project ID where to allocate the address block\n    project_id = \"\"\n\n    # facility - (Required) The facility where to allocate the address block\n    facility = \"\"\n\n    # Exported Attributes\n    # \"facility\" - The facility where the addresses are\n    # \"project_id\" - To which project the addresses beling\n    # \"quantity\" - Number of /32 addresses in the block\n    # \"id\" - The unique ID of the block\n    # \"cidr_notation\" - Address and mask in CIDR notation, e.g. \"147.229.15.30/31\"\n    # \"network\" - Network IP address portion of the block specification\n    # \"netmask\" - Mask in decimal notation, e.g. \"255.255.255.0\"\n    # \"cidr\" - length of CIDR prefix of the block as integer\n    # \"address_family\" - Address family as integer (4 or 6)\n    # \"public\" - boolean flag whether addresses from a block are public\n}",
        "description": "Provides a resource to create and manage blocks of reserved IP addresses in a project. When user provision first device in a facility, Packet automatically allocates IPv6/56 and private IPv4/25 blocks.\nThe new device then gets IPv6 and private IPv4 addresses from those block. It also gets a public IPv4/31 address.\nEvery new device in the project and facility will automatically get IPv6 and private IPv4 addresses from pre-allocated i\nblocks.\nThe IPv6 and private IPv4 blocks can't be created, only imported. It is only possible to create public IPv4 blocks, with masks from /24 (256 addresses) to /32 (1 address). Once IP block is allocated or imported, an address from it can be assigned to device with the `packet_ip_attachment` resource.",
        "prefix": "packet-resource-resevered-ip-block"
    },
    "packet-resource-ssh-key": {
        "body": "resource \"packet_ssh_key\" \"$1\" {\n    # public_key - (Required) The public key. If this is a file, it\n    public_key = \"\"\n\n    # name - (Required) The name of the SSH key for identification\n    name = \"\"\n\n    # Exported Attributes\n    # \"id\" - The unique ID of the key\n    # \"name\" - The name of the SSH key\n    # \"public_key\" - The text of the public key\n    # \"fingerprint\" - The fingerprint of the SSH key\n    # \"created\" - The timestamp for when the SSH key was created\n    # \"updated\" - The timestamp for the last time the SSH key was updated\n}",
        "description": "Provides a Packet SSH key resource to allow you manage SSH\nkeys on your account. All SSH keys on your account are loaded on\nall new devices, they do not have to be explicitly declared on\ndevice creation.",
        "prefix": "packet-resource-ssh-key"
    },
    "packet-resource-volume": {
        "body": "resource \"packet_volume\" \"$1\" {\n    # size - (Required) The size in GB to make the volume\n    size = \"\"\n\n    # project_id - (Required) The packet project ID to deploy the volume in\n    project_id = \"\"\n\n    # facility - (Required) The facility to create the volume in\n    facility = \"\"\n\n    # plan - (Required) The service plan slug of the volume\n    plan = \"\"\n\n    # billing_cycle - (Optional) The billing cycle, defaults to \"hourly\"\n    billing_cycle = \"\"\n\n    # description - (Optional) Optional description for the volume\n    description = \"\"\n\n    # snapshot_policies - (Optional) Optional list of snapshot policies\n    snapshot_policies = \"\"\n\n    # Exported Attributes\n    # \"id\" - The unique ID of the volume\n    # \"name\" - The name of the volume\n    # \"description\" - The description of the volume\n    # \"size\" - The size in GB of the volume\n    # \"plan\" - Performance plan the volume is on\n    # \"billing_cycle\" - The billing cycle, defaults to hourly\n    # \"facility\" - The facility slug the volume resides in\n    # \"state\" - The state of the volume\n    # \"locked\" - Whether the volume is locked or not\n    # \"project_id \" - The project id the volume is in\n    # \"attachments\" - A list of attachments, each with it's own \"href\" attribute\n    # \"created\" - The timestamp for when the volume was created\n    # \"updated\" - The timestamp for the last time the volume was updated\n}",
        "description": "Provides a Packet Block Storage Volume resource to allow you to\nmanage block volumes on your account.\nOnce created by Terraform, they must then be attached and mounted\nusing the api and `packet_block_attach` and `packet_block_detach`\nscripts.",
        "prefix": "packet-resource-volume"
    },
    "packet-resource-volume-attachment": {
        "body": "resource \"packet_volume_attachment\" \"$1\" {\n    # device_id - (Required) The ID of the device to which the volume should be attached\n    device_id = \"\"\n\n    # volume_id - (Required) The ID of the volume to attach\n    volume_id = \"\"\n\n    # Exported Attributes\n    # \"id\" - The unique ID of the volume attachment\n}",
        "description": "Provides attachment of Packet Block Storage Volume to Devices. Device and volume must be in the same location (facility). Once attached by Terraform, they must then be mounted using the `packet_block_attach` and `packet_block_detach` scripts.",
        "prefix": "packet-resource-volume-attachment"
    }
}