{
    "statuscake-test": {
        "body": "resource \"statuscake_test\" \"$1\" {\n    # test_type - (Required) The type of Test. Either HTTP, TCP, PING, or DNS\n    test_type = \"\"\n\n    # website_url - (Required) The URL of the website to be monitored\n    website_url = \"\"\n\n    # website_name - (Required) This is the name of the test and the website to be monitored.\n    website_name = \"\"\n\n    # check_rate - (Optional) Test check rate in seconds. Defaults to 300\n    check_rate = \"\"\n\n    # contact_id - (Optional) The id of the contact group to be add to the test.  Each test can have only one.\n    contact_id = \"\"\n\n    # paused - (Optional) Whether or not the test is paused. Defaults to false.\n    paused = \"\"\n\n    # timeout - (Optional) The timeout of the test in seconds.\n    timeout = \"\"\n\n    # confirmations - (Optional) The number of confirmation servers to use in order to detect downtime. Defaults to 0.\n    confirmations = \"\"\n\n    # port - (Optional) The port to use when specifying a TCP test.\n    port = \"\"\n\n    # trigger_rate - (Optional) The number of minutes to wait before sending an alert. Default is `5`.\n    trigger_rate = \"\"\n\n    # custom_header - (Optional) Custom HTTP header, must be supplied as JSON.\n    custom_header = \"\"\n\n    # user_agent - (Optional) Test with a custom user agent set.\n    user_agent = \"\"\n\n    # node_locations - (Optional) Set test node locations, must be array of strings.\n    node_locations = \"\"\n\n    # ping_url - (Optional) A URL to ping if a site goes down.\n    ping_url = \"\"\n\n    # basic_user - (Optional) A Basic Auth User account to use to login\n    basic_user = \"\"\n\n    # basic_pass - (Optional) If BasicUser is set then this should be the password for the BasicUser.\n    basic_pass = \"\"\n\n    # public - (Optional) Set 1 to enable public reporting, 0 to disable.\n    public = \"\"\n\n    # logo_image - (Optional) A URL to a image to use for public reporting.\n    logo_image = \"\"\n\n    # branding - (Optional) Set to 0 to use branding (default) or 1 to disable public reporting branding).\n    branding = \"\"\n\n    # website_host - (Optional) Used internally, when possible please add.\n    website_host = \"\"\n\n    # virus - (Optional) Enable virus checking or not. 1 to enable\n    virus = \"\"\n\n    # find_string - (Optional) A string that should either be found or not found.\n    find_string = \"\"\n\n    # do_not_find - (Optional) If the above string should be found to trigger a alert. 1 = will trigger if find_string found.\n    do_not_find = \"\"\n\n    # real_browser - (Optional) Use 1 to TURN OFF real browser testing.\n    real_browser = \"\"\n\n    # test_tags - (Optional) Tags should be seperated by a comma - no spacing between tags (this,is,a set,of,tags).\n    test_tags = \"\"\n\n    # status_codes - (Optional) Comma Seperated List of StatusCodes to Trigger Error on. Defaults are \"204, 205, 206, 303, 400, 401, 403, 404, 405, 406, 408, 410, 413, 444, 429, 494, 495, 496, 499, 500, 501, 502, 503, 504, 505, 506, 507, 508, 509, 510, 511, 521, 522, 523, 524, 520, 598, 599\".\n    status_codes = \"\"\n\n    # use_jar - (Optional) Set to true to enable the Cookie Jar. Required for some redirects. Default is false.\n    use_jar = \"\"\n\n    # post_raw - (Optional) Use to populate the RAW POST data field on the test.\n    post_raw = \"\"\n\n    # final_endpoint - (Optional) Use to specify the expected Final URL in the testing process.\n    final_endpoint = \"\"\n\n    # follow_redirect - (Optional) Use to specify whether redirects should be followed, set to true to enable. Default is false.\n    follow_redirect = \"\"\n\n    # Exported Attributes\n    # \"test_id\" - A unique identifier for the test.\n}",
        "description": "The test resource allows StatusCake tests to be managed by Terraform.",
        "prefix": "statuscake-test"
    }
}