{
    "triton-datasource-account": {
        "body": "data \"triton_account\" \"$1\" {\n    # Exported Attributes\n}",
        "description": "The `triton_account` data source queries Triton for Account information. ~> **NOTE:** This data source uses the name of the Account currently\nconfigured in the [Trition provider][1].",
        "prefix": "triton-datasource-account"
    },
    "triton-datasource-datacenter": {
        "body": "data \"triton_datacenter\" \"$1\" {\n    # Exported Attributes\n}",
        "description": "The `triton_datacenter` data source queries Triton for Data Center information. ~> **NOTE:** This data source uses the endpoint URL of the Data Center currently\nconfigured in the [Trition provider][1].",
        "prefix": "triton-datasource-datacenter"
    },
    "triton-datasource-fabric-network": {
        "body": "data \"triton_fabric_network\" \"$1\" {\n    # name - (Optional) (string)   **Required.** The name of the Fabric Network.\n    name = \"\"\n\n    # vlan_id - (Optional) (integer)   **Required.** The unique identifier (VLAN ID) of the Fabric VLAN.\n    vlan_id = \"\"\n\n    # Exported Attributes\n}",
        "description": "The `triton_fabric_network` data source queries Triton for [Fabric Network][4]\ninformation (e.g., subnet CIDR, gateway, state routes, etc.) based on the\nname of the Fabric Network and ID of the VLAN on which the network has been\ncreated.",
        "prefix": "triton-datasource-fabric-network"
    },
    "triton-datasource-fabric-vlan": {
        "body": "data \"triton_fabric_vlan\" \"$1\" {\n    # name - (Optional) (string)   Optional. The name of the Fabric VLAN.\n    name = \"\"\n\n    # vlan_id - (Optional) (integer)   Optional. The unique identifier (VLAN ID) of the Fabric VLAN.\n    vlan_id = \"\"\n\n    # description - (Optional) (string)   Optional. The description of the Fabric VLAN.\n    description = \"\"\n\n    # Exported Attributes\n}",
        "description": "The `triton_fabric_vlan` data source queries Triton for [Fabric VLAN][1]\ninformation (e.g., VLAN ID, etc.) based either on the name, VLAN ID or\ndescription of the Fabric VLAN.",
        "prefix": "triton-datasource-fabric-vlan"
    },
    "triton-datasource-image": {
        "body": "data \"triton_image\" \"$1\" {\n    # name - (Optional) (string)   The name of the image\n    name = \"\"\n\n    # os - (Optional) (string)   The underlying operating system for the image\n    os = \"\"\n\n    # version - (Optional) (string)   The version for the image\n    version = \"\"\n\n    # public - (Optional) (boolean)   Whether to return public as well as private images\n    public = \"\"\n\n    # state - (Optional) (string)   The state of the image. By default, only `active` images are shown. Must be one of:   `active`, `unactivated`, `disabled`, `creating`, `failed` or `all`, though the   default is sufficient in almost every case.\n    state = \"\"\n\n    # owner - (Optional) (string)   The UUID of the account which owns the image\n    owner = \"\"\n\n    # type - (Optional) (string)   The image type. Must be one of: `zone-dataset`, `lx-dataset`, `zvol`, `docker` or   `other`.\n    type = \"\"\n\n    # most_recent - (Optional) (bool) If more than one result is returned, use the most recent Image.\n    most_recent = \"\"\n\n    # Exported Attributes\n}",
        "description": "The `triton_image` data source queries the Triton Image API for an image ID based\non a variety of different parameters.",
        "prefix": "triton-datasource-image"
    },
    "triton-datasource-network": {
        "body": "data \"triton_network\" \"$1\" {\n    # name - (Optional) (string)\n    name = \"\"\n\n    # Exported Attributes\n}",
        "description": "The `triton_network` data source queries Triton for Network information\n(e.g., Network ID, etc.) based on the name of the Network.",
        "prefix": "triton-datasource-network"
    },
    "triton-resource-fabric": {
        "body": "resource \"triton_fabric\" \"$1\" {\n    # name - (Optional) (String, Required, Change forces new resource)   Network name.\n    name = \"\"\n\n    # description - (Optional) (String, Optional, Change forces new resource)   Optional description of network.\n    description = \"\"\n\n    # subnet - (Optional) (String, Required, Change forces new resource)   CIDR formatted string describing network.\n    subnet = \"\"\n\n    # provision_start_ip - (Optional) (String, Required, Change forces new resource)   First IP on the network that can be assigned.\n    provision_start_ip = \"\"\n\n    # provision_end_ip - (Optional) (String, Required, Change forces new resource)   Last assignable IP on the network.\n    provision_end_ip = \"\"\n\n    # gateway - (Optional) (String, Optional, Change forces new resource)   Optional gateway IP.\n    gateway = \"\"\n\n    # resolvers - (Optional) (List, Optional)   Array of IP addresses for resolvers.\n    resolvers = \"\"\n\n    # routes - (Optional) (Map, Optional, Change forces new resource)   Map of CIDR block to Gateway IP address.\n    routes = \"\"\n\n    # internet_nat - (Optional) (Bool, Optional, Change forces new resource)   If a NAT zone is provisioned at Gateway IP address. Default is `true`.\n    internet_nat = \"\"\n\n    # vlan_id - (Optional) (Int, Required, Change forces new resource)\n    vlan_id = \"\"\n\n    # internet_nat - (Optional) (Bool, Optional, Change forces new resource)   If a NAT zone is provisioned at Gateway IP address. Default is `true`.\n    internet_nat = \"\"\n\n    # Exported Attributes\n}",
        "description": "The `triton_fabric` resource represents an fabric for a Triton account. The fabric is a logical set of interconnected switches.",
        "prefix": "triton-resource-fabric"
    },
    "triton-resource-firewall-rule": {
        "body": "resource \"triton_firewall_rule\" \"$1\" {\n    # rule - (Optional) (string, Required)   The firewall rule described using the Cloud API rule syntax defined at https://docs.joyent.com/public-cloud/network/firewall/cloud-firewall-rules-reference.   Note: Cloud API will normalize rules based on case-sensitivity, parentheses,   ordering of IP addresses, etc. This can result in Terraform updating rules   repeatedly if the rule definition differs from the normalized value.\n    rule = \"\"\n\n    # enabled - (Optional) (boolean, Optional)  Default: `false`   Whether the rule should be effective.\n    enabled = \"\"\n\n    # description - (Optional) (string, Optional)   Description of the firewall rule\n    description = \"\"\n\n    # Exported Attributes\n}",
        "description": "The `triton_firewall_rule` resource represents a rule for the Triton cloud firewall.",
        "prefix": "triton-resource-firewall-rule"
    },
    "triton-resource-instance-template": {
        "body": "resource \"triton_instance_template\" \"$1\" {\n    # template_name - (Optional) (string, Required) Friendly name for the instance template.\n    template_name = \"\"\n\n    # image - (Optional) (string, Required)  UUID of the image.\n    image = \"\"\n\n    # package - (Optional) (string, Required) Package name used for provisioning.\n    package = \"\"\n\n    # firewall_enabled - (Optional) (boolean, Optional) Whether to enable the firewall for group instances. Default is `false`.\n    firewall_enabled = \"\"\n\n    # tags - (Optional) (map, Optional) Tags for group instances. \n    tags = \"\"\n\n    # networks - (Optional) (list, Optional) Network IDs for group instances.\n    networks = \"\"\n\n    # metadata - (Optional) (map, Optional) Metadata for group instances.\n    metadata = \"\"\n\n    # userdata - (Optional) (string, Optional) Data copied to instance on boot.\n    userdata = \"\"\n\n    # Exported Attributes\n}",
        "description": "The `triton_instance_template` resource represents a Triton Service Group instance template. ~> **NOTE:**  Triton Service Groups are in Preview and only supported in specific regions at this time. They will become Generally Available in the near future.",
        "prefix": "triton-resource-instance-template"
    },
    "triton-resource-key": {
        "body": "resource \"triton_key\" \"$1\" {\n    # name - (Optional) (string, Change forces new resource)   The name of the key. If this is left empty, the name is inferred from the comment in the SSH key material.\n    name = \"\"\n\n    # key - (Optional) (string, Required, Change forces new resource)   The SSH key material. In order to read this from a file, use the `file` interpolation.\n    key = \"\"\n\n    # Exported Attributes\n}",
        "description": "The `triton_key` resource represents an SSH key for a Triton account.",
        "prefix": "triton-resource-key"
    },
    "triton-resource-machine": {
        "body": "resource \"triton_machine\" \"$1\" {\n    # name - (Optional) (string)   The friendly name for the machine. Triton will generate a name if one is not specified.\n    name = \"\"\n\n    # tags - (Optional) (map)   A mapping of tags to apply to the machine.\n    tags = \"\"\n\n    # cns - (Optional) (map of CNS attributes, Optional)   A mapping of [CNS](https://docs.joyent.com/public-cloud/network/cns) attributes to apply to the machine.\n    cns = \"\"\n\n    # metadata - (Optional) (map, optional)   A mapping of metadata to apply to the machine.\n    metadata = \"\"\n\n    # package - (Optional) (string, Required)   The name of the package to use for provisioning.\n    package = \"\"\n\n    # image - (Optional) (string, Required)   The UUID of the image to provision.\n    image = \"\"\n\n    # networks - (Optional) (list, optional)   The list of networks to associate with the machine. The network ID will be in hex form, e.g `xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx`.\n    networks = \"\"\n\n    # affinity - (Optional) (list of Affinity rules, Optional)   A list of valid [Affinity Rules](https://apidocs.joyent.com/cloudapi/#affinity-rules) to apply to the machine which assist in data center placement. Using this attribute will force resource creation to be serial. NOTE: Affinity rules are best guess and assist in placing instances across a data center. They're used at creation and not referenced after.\n    affinity = \"\"\n\n    # firewall_enabled - (Optional) (boolean)  Default: `false`   Whether the cloud firewall should be enabled for this machine.\n    firewall_enabled = \"\"\n\n    # root_authorized_keys - (Optional) (string)   The public keys authorized for root access via SSH to the machine.\n    root_authorized_keys = \"\"\n\n    # user_data - (Optional) (string)   Data to be copied to the machine on boot. **NOTE:** The content of `user_data`   will _not be executed_ on boot. The data will only be written to the file on each   boot before the content of the script from `user_script` is to be run. \n    user_data = \"\"\n\n    # user_script - (Optional) (string)   The user script to run on boot (every boot on SmartMachines). To learn more about   both the user script and user data see the [metadata API][2] documentation and the   [Joyent Metadata Data Dictionary][1] specification.\n    user_script = \"\"\n\n    # administrator_pw - (Optional) (string)   The initial password for the Administrator user. Only used for Windows virtual machines.\n    administrator_pw = \"\"\n\n    # cloud_config - (Optional) (string)   Cloud-init configuration for Linux brand machines, used instead of `user_data`.\n    cloud_config = \"\"\n\n    # deletion_protection_enabled - (Optional) (bool)   Whether an instance is destroyable. Default is `false`.\n    deletion_protection_enabled = \"\"\n\n    # Exported Attributes\n}",
        "description": "The `triton_machine` resource represents a virtual machine or infrastructure container running in Triton. ~> **Note:** Starting with Triton 0.2.0, Please note that when you want to specify the networks that you want the machine to be attached to, use the `networks` parameter\nand not the `nic` parameter.",
        "prefix": "triton-resource-machine"
    },
    "triton-resource-service-group": {
        "body": "resource \"triton_service_group\" \"$1\" {\n    # group_name - (Optional) (string, Required) Friendly name for the service group.\n    group_name = \"\"\n\n    # template - (Optional) (string, Required)  Identifier of an instance template.\n    template = \"\"\n\n    # capacity - (Optional) (int, Optional) Number of instances to launch and monitor.\n    capacity = \"\"\n\n    # Exported Attributes\n}",
        "description": "The `triton_service_group` resource represents a Triton Service Group. ~> **NOTE:**  Triton Service Groups are in Preview and only supported in specific regions at this time. They will become Generally Available in the near future.",
        "prefix": "triton-resource-service-group"
    },
    "triton-resource-snapshot": {
        "body": "resource \"triton_snapshot\" \"$1\" {\n    # name - (Optional) (string, Required)   The name for the snapshot.\n    name = \"\"\n\n    # machine_id - (Optional) (string, Required)   The ID of the machine of which to take a snapshot.\n    machine_id = \"\"\n\n    # Exported Attributes\n}",
        "description": "The `triton_snapshot` resource represents a snapshot of a Triton machine.\nSnapshots are not usable with other instances; they are a point-in-time snapshot of the current instance.\nSnapshots can also only be taken of instances that are not of brand `kvm`.",
        "prefix": "triton-resource-snapshot"
    },
    "triton-resource-vlan": {
        "body": "resource \"triton_vlan\" \"$1\" {\n    # vlan_id - (Optional) (int, Required, Change forces new resource)   Number between 0-4095 indicating VLAN ID\n    vlan_id = \"\"\n\n    # name - (Optional) (string, Required)   Unique name to identify VLAN\n    name = \"\"\n\n    # description - (Optional) (string, Optional)   Description of the VLAN\n    description = \"\"\n\n    # Exported Attributes\n}",
        "description": "The `triton_vlan` resource represents an Triton VLAN. A VLAN provides a low level way to segregate and subdivide the network. Traffic on one VLAN cannot, _on its own_, reach another VLAN.",
        "prefix": "triton-resource-vlan"
    }
}